{
    "job_id": 338,
    "job_details": {
        "job_id": 338,
        "Organisatienaam": "Pontifexx",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Developer",
        "Standplaats": "Zwolle",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Je bent een developer die bouwt aan Pontifexx Paddock, ons digitale platform voor Asset Management. Met jouw technische expertise help je de organisatie groeien en maak je het verschil door het ontwikkelen van krachtige, gebruiksvriendelijke applicaties. Daarnaast pak je praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing.\n   Vorm de toekomst van Asset Management\n   met Pontifexx Paddock\n\n   Pontifexx Tech is een vooruitstrevend onderdeel van Pontifexx en continu in beweging. Met Pontifexx Paddock combineren we AI en BI om Asset Management naar een hoger niveau te brengen. In deze rol ben je onmisbaar voor de verdere ontwikkeling van Pontifexx Paddock. Je werkt nauw samen met onze specialisten op het gebied van Maintenance, IFS Ultimo, AI en BI om nieuwe functies en koppelingen te realiseren die onze dienstverlening versterken.\n\n   In deze functie krijg je de kans om de bestaande technische basis van Pontifexx Paddock verder uit te bouwen. We hanteren al een moderne stack bestaande uit verschillende frameworks en cloudservices, maar we staan open voor jouw inbreng om deze nóg beter te maken. Je hebt dus de ruimte om met nieuwe ideeën te komen en samen met het team te bepalen welke technische verbeteringen echt verschil maken. Zo draag je bij aan best practices, performance optimalisaties en de toekomstige richting van ons platform.",
        "Datum gevonden": "2025-03-27",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Bouw",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 3,
        "full_text": "Developer\n\nJe bent een developer die bouwt aan Pontifexx Paddock, ons digitale platform voor Asset Management. Met jouw technische expertise help je de organisatie groeien en maak je het verschil door het ontwikkelen van krachtige, gebruiksvriendelijke applicaties. Daarnaast pak je praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing.\n   Vorm de toekomst van Asset Management\n   met Pontifexx Paddock\n\n   Pontifexx Tech is een vooruitstrevend onderdeel van Pontifexx en continu in beweging. Met Pontifexx Paddock combineren we AI en BI om Asset Management naar een hoger niveau te brengen. In deze rol ben je onmisbaar voor de verdere ontwikkeling van Pontifexx Paddock. Je werkt nauw samen met onze specialisten op het gebied van Maintenance, IFS Ultimo, AI en BI om nieuwe functies en koppelingen te realiseren die onze dienstverlening versterken.\n\n   In deze functie krijg je de kans om de bestaande technische basis van Pontifexx Paddock verder uit te bouwen. We hanteren al een moderne stack bestaande uit verschillende frameworks en cloudservices, maar we staan open voor jouw inbreng om deze nóg beter te maken. Je hebt dus de ruimte om met nieuwe ideeën te komen en samen met het team te bepalen welke technische verbeteringen echt verschil maken. Zo draag je bij aan best practices, performance optimalisaties en de toekomstige richting van ons platform."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on general software development for an Asset Management platform that utilizes AI and BI. However, it lacks specific details about the core responsibilities, technologies, or tasks related to building, training, or deploying AI models, which are characteristic of ML Engineer or GenAI Engineer roles. The role seems to be more about developing applications that *use* AI/BI rather than being an AI specialist."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description emphasizes 'developer die bouwt aan Pontifexx Paddock, ons digitale platform voor Asset Management' and 'ontwikkelen van krachtige, gebruiksvriendelijke applicaties', indicating a focus on building software applications.",
                    "phrase": "developer die bouwt aan Pontifexx Paddock, ons digitale platform voor Asset Management"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'ontwikkelen van krachtige, gebruiksvriendelijke applicaties' directly points to software development activities.",
                    "phrase": "ontwikkelen van krachtige, gebruiksvriendelijke applicaties"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The mention of 'praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing' implies software maintenance and enhancement, which falls under software development.",
                    "phrase": "praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role aims to 'help the organization grow' and 'make a difference', indicating an understanding of business impact and goals.",
                    "phrase": "help je de organisatie groeien en maak je het verschil"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The description mentions 'combineren we AI en BI om Asset Management naar een hoger niveau te brengen' and working with 'specialisten op het gebied van... AI en BI', suggesting some interaction with AI/BI functionalities, though the specific tasks are not detailed.",
                    "phrase": "combineren we AI en BI om Asset Management naar een hoger niveau te brengen"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The statement 'bestaande technische basis van Pontifexx Paddock verder uit te bouwen' and 'best practices, performance optimalisaties' hints at operational aspects of maintaining and improving a platform, though not explicitly MLOps.",
                    "phrase": "best practices, performance optimalisaties"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The mention of 'nieuwe functies en koppelingen te realiseren die onze dienstverlening versterken' points to developing new features and integrations, a core software development task.",
                    "phrase": "nieuwe functies en koppelingen te realiseren die onze dienstverlening versterken"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'de bestaande technische basis van Pontifexx Paddock verder uit te bouwen' refers to extending the existing technical foundation, a software development responsibility.",
                    "phrase": "de bestaande technische basis van Pontifexx Paddock verder uit te bouwen"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The statement 'we staan open voor jouw inbreng om deze nóg beter te maken' and 'met nieuwe ideeën te komen en samen met het team te bepalen welke technische verbeteringen echt verschil maken' suggests contributing to the technical direction and improvements of the platform, which is part of software development.",
                    "phrase": "met nieuwe ideeën te komen en samen met het team te bepalen welke technische verbeteringen echt verschil maken"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Je werkt nauw samen met onze specialisten op het gebied van Maintenance, IFS Ultimo, AI en BI"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "we staan open voor jouw inbreng om deze nóg beter te maken. Je hebt dus de ruimte om met nieuwe ideeën te komen"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "pak je praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing"
                }
            ],
            "technologies": [
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "cloudservices"
                }
            ]
        }
    }
}