{
    "job_id": 779,
    "job_details": {
        "job_id": 779,
        "Organisatienaam": "NN Personeel",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior Data Engineer met passie voor data architectuur",
        "Standplaats": "Zwolle",
        "Vacaturelink (origineel)": "adzuna.nl",
        "Contactpersoon": "Ties Herpers",
        "Telefoonnummer": "+31617336328",
        "E-mail": null,
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als senior Data Engineer lever je een essentiële bijdrage aan de transformatie naar een digitale en data gedreven schadeverzekeraar en intermediair. Als senior Data Engineer werk je nauw samen met de Data Engineers die in onze Data Squads nieuwe en complexe data preparaties ontwerpen en realiseren. Hierdoor kunnen de BI Experts and ML Engineers in deze Data Squads dataproducten leveren die direct waarde toevoegen voor onze klanten en collega's. Meer specifiek ga je doen:\n     * Ontwikkelen, uitbreiden en verbeteren van (virtuele) ETL jobs en data modellen. Dit voor complexe data extracten, transformaties en preparatie processen in het AAV Data Analytisch Platform. Dit platform is gebaseerd op de tools Denodo, Azure SQL&ADF en Databricks en is gehost op Azure\n     * Coachen van Data Engineers in de Data Squads en in het Data Beheer team\n     * Samenwerken met Data Engineers op het gebied van data modellering, data oplossingen bedenken en root-cause analyses uitvoeren\n\n   Aangezien je veel affiniteit hebt met data architectuur, adviseer je in de rol van data architect organisatie breed over hoe we data en AI technologie zo optimaal mogelijk kunnen integreren in ons landschap. Denk hierbij aan:\n     * Samen met de AAV Enterprise Architect richting geven aan de verdere implementatie van onze strategie op basis van o.a. de data productvisie, de kaders en principes van data architectuur als ook de brede Enterprise architectuur\n     * Afstemmen met stakeholders en zo zeker stellen dat onze data producten ook aansluiten binnen de architectuur van ons moederbedrijf, Nationale Nederlanden\n\nAls AAV stimuleren wij onze medewerkers om iedere dag het beste uit zichzelf te halen. En om het initiatief en de verantwoordelijkheid te nemen in het continu verbeteren van onze dienstverlening. Onze cultuur is professioneel en we werken in een informele sfeer met elkaar samen.\n\n   Bij NN werken we hybride. Deels vanuit huis en deels op kantoor. Teams ontmoeten elkaar digitaal, fysiek of hybride. Je spreekt samen met je team af wat het beste past. We hebben onze kantoren zo ingericht dat er voor elk type werk een passende plek is. De officiële standplaats voor deze functie is Zwolle.\n\n   Als senior Data Engineer werk je in de IJsseltoren, het hoogste punt van Zwolle met uitzicht over de IJssel en de mooie oude binnenstad van Zwolle. Een unieke locatie met een unieke samenstelling van bedrijven: de joint venture tussen ABN AMRO en Nationale-Nederlanden. Je rijdt zo vanaf de A28 naar dit moderne kantorencomplex. Restaurant De Lobby biedt elke dag heerlijke, pure gerechten, dus verruil je werkplek gerust voor een verrassende lunch.",
        "Datum gevonden": "2024-10-04",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Zakelijke dienstverlening",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 10,
        "full_text": "Senior Data Engineer met passie voor data architectuur\n\nAls senior Data Engineer lever je een essentiële bijdrage aan de transformatie naar een digitale en data gedreven schadeverzekeraar en intermediair. Als senior Data Engineer werk je nauw samen met de Data Engineers die in onze Data Squads nieuwe en complexe data preparaties ontwerpen en realiseren. Hierdoor kunnen de BI Experts and ML Engineers in deze Data Squads dataproducten leveren die direct waarde toevoegen voor onze klanten en collega's. Meer specifiek ga je doen:\n     * Ontwikkelen, uitbreiden en verbeteren van (virtuele) ETL jobs en data modellen. Dit voor complexe data extracten, transformaties en preparatie processen in het AAV Data Analytisch Platform. Dit platform is gebaseerd op de tools Denodo, Azure SQL&ADF en Databricks en is gehost op Azure\n     * Coachen van Data Engineers in de Data Squads en in het Data Beheer team\n     * Samenwerken met Data Engineers op het gebied van data modellering, data oplossingen bedenken en root-cause analyses uitvoeren\n\n   Aangezien je veel affiniteit hebt met data architectuur, adviseer je in de rol van data architect organisatie breed over hoe we data en AI technologie zo optimaal mogelijk kunnen integreren in ons landschap. Denk hierbij aan:\n     * Samen met de AAV Enterprise Architect richting geven aan de verdere implementatie van onze strategie op basis van o.a. de data productvisie, de kaders en principes van data architectuur als ook de brede Enterprise architectuur\n     * Afstemmen met stakeholders en zo zeker stellen dat onze data producten ook aansluiten binnen de architectuur van ons moederbedrijf, Nationale Nederlanden\n\nAls AAV stimuleren wij onze medewerkers om iedere dag het beste uit zichzelf te halen. En om het initiatief en de verantwoordelijkheid te nemen in het continu verbeteren van onze dienstverlening. Onze cultuur is professioneel en we werken in een informele sfeer met elkaar samen.\n\n   Bij NN werken we hybride. Deels vanuit huis en deels op kantoor. Teams ontmoeten elkaar digitaal, fysiek of hybride. Je spreekt samen met je team af wat het beste past. We hebben onze kantoren zo ingericht dat er voor elk type werk een passende plek is. De officiële standplaats voor deze functie is Zwolle.\n\n   Als senior Data Engineer werk je in de IJsseltoren, het hoogste punt van Zwolle met uitzicht over de IJssel en de mooie oude binnenstad van Zwolle. Een unieke locatie met een unieke samenstelling van bedrijven: de joint venture tussen ABN AMRO en Nationale-Nederlanden. Je rijdt zo vanaf de A28 naar dit moderne kantorencomplex. Restaurant De Lobby biedt elke dag heerlijke, pure gerechten, dus verruil je werkplek gerust voor een verrassende lunch."
    },
    "analysis": {
        "job_profile_classification": {
            "profile": "Ambiguous / Not Relevant",
            "confidence_score": 2,
            "rationale": "The job description heavily emphasizes traditional data engineering tasks, data architecture, and ETL processes. While ML Engineers and GenAI Engineers might interact with data, the core responsibilities and technologies listed do not align with the primary focus of building predictive models or generative AI applications. The mention of 'ML Engineers' in the context of Data Squads seems to refer to their use of data products rather than the core tasks of an ML Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task_name": "Data Engineering",
                    "phrases": [
                        "Ontwikkelen, uitbreiden en verbeteren van (virtuele) ETL jobs en data modellen",
                        "complexe data extracten, transformaties en preparatie processen",
                        "Samenwerken met Data Engineers op het gebied van data modellering",
                        "data oplossingen bedenken"
                    ],
                    "justification": "These phrases directly relate to the design, building, and maintenance of data pipelines and infrastructure, including data transformation and preparation."
                },
                {
                    "task_name": "Business Understanding",
                    "phrases": [
                        "transformatie naar een digitale en data gedreven schadeverzekeraar en intermediair",
                        "dataproducten leveren die direct waarde toevoegen voor onze klanten en collega's",
                        "organisatie breed over hoe we data en AI technologie zo optimaal mogelijk kunnen integreren in ons landschap",
                        "richting geven aan de verdere implementatie van onze strategie op basis van o.a. de data productvisie, de kaders en principes van data architectuur als ook de brede Enterprise architectuur",
                        "Afstemmen met stakeholders en zo zeker stellen dat onze data producten ook aansluiten binnen de architectuur van ons moederbedrijf"
                    ],
                    "justification": "These phrases demonstrate an understanding of the business context, strategic goals, and the need to align technical solutions with business needs and enterprise architecture."
                },
                {
                    "task_name": "Operations Engineering (MLOps)",
                    "phrases": [
                        "AAV Data Analytisch Platform",
                        "gehost op Azure"
                    ],
                    "justification": "While not explicitly MLOps, the mention of a 'Data Analytisch Platform' and hosting on 'Azure' implies managing and operating a data infrastructure, which has overlap with operational aspects."
                },
                {
                    "task_name": "Software Development",
                    "phrases": [
                        "ontwerpen en realiseren"
                    ],
                    "justification": "This phrase implies the design and creation of data solutions, which can be considered a form of software development within the data engineering context."
                }
            ],
            "technologies": [
                {
                    "tech_name": "Denodo",
                    "category": "TECH2"
                },
                {
                    "tech_name": "Azure SQL",
                    "category": "TECH9"
                },
                {
                    "tech_name": "ADF",
                    "category": "TECH6"
                },
                {
                    "tech_name": "Databricks",
                    "category": "TECH6"
                },
                {
                    "tech_name": "Azure",
                    "category": "TECH2"
                }
            ],
            "soft_skills": [
                {
                    "skill_name": "Communication & Collaboration",
                    "phrases": [
                        "werk je nauw samen met de Data Engineers",
                        "Coachen van Data Engineers",
                        "Samenwerken met Data Engineers",
                        "organisatie breed over hoe we data en AI technologie zo optimaal mogelijk kunnen integreren",
                        "Afstemmen met stakeholders",
                        "informele sfeer met elkaar samen",
                        "Teams ontmoeten elkaar digitaal, fysiek of hybride"
                    ],
                    "justification": "The job description repeatedly emphasizes collaboration, coaching, and alignment with various teams and stakeholders."
                },
                {
                    "skill_name": "Learning & Adaptability",
                    "phrases": [
                        "transformatie naar een digitale en data gedreven schadeverzekeraar",
                        "continu verbeteren van onze dienstverlening"
                    ],
                    "justification": "The role is positioned within a transformation and emphasizes continuous improvement, suggesting a need for adaptability."
                },
                {
                    "skill_name": "Problem Solving & Pragmatism",
                    "phrases": [
                        "complexe data preparaties ontwerpen en realiseren",
                        "root-cause analyses uitvoeren",
                        "data oplossingen bedenken"
                    ],
                    "justification": "The role involves designing complex data preparations, performing root-cause analysis, and devising data solutions, all of which require problem-solving skills."
                },
                {
                    "skill_name": "Innovation & Ownership",
                    "phrases": [
                        "passie voor data architectuur",
                        "adviseer je in de rol van data architect",
                        "richting geven aan de verdere implementatie van onze strategie",
                        "stimuleren wij onze medewerkers om iedere dag het beste uit zichzelf te halen",
                        "initiatief en de verantwoordelijkheid te nemen"
                    ],
                    "justification": "The description highlights passion for architecture, advising on strategy, taking initiative, and responsibility, indicating a need for innovation and ownership."
                }
            ]
        }
    }
}