{
    "job_id": 1006,
    "job_details": {
        "job_id": 1006,
        "Organisatienaam": "Q42",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI-engineer",
        "Standplaats": "Den Haag",
        "Vacaturelink (origineel)": "werkenbij.q42.nl",
        "Contactpersoon": "Maurice",
        "Telefoonnummer": "31646465370.0",
        "E-mail": null,
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Tech zit in de kern van alles wat we doen. Onze teams van developers en projectleiders zijn altijd bezig met snel uitproberen, leren en verbeteren. Totdat het product fijn is in gebruik, de business laat groeien én wij er zelf een glimlach van krijgen.\n\nEn we hebben een vacature voor ervaren AI-engineers.\n\n   Wij zoeken ervaren AI-engineers die mooie softwareproducten willen maken voor eindgebruikers met inzet van AI.\n\n   Nieuwe slimme toepassingen\n   AI biedt allerlei kansen voor nieuwe slimme toepassingen. Bij Q42 werken we met diverse klanten samen aan uiteenlopende AI-projecten: van korte experimenten tot langlopende projecten.\n\n   Voorbeeld: BAM\n   BAM maakt voor ieder renovatieproject, zoals het verduurzamen van huizenblokken, gedetailleerde 3D-scans met drones. Het omzetten van deze scans naar nauwkeurige metingen hebben we dankzij AI weten te automatiseren en versnellen. Door eerder over precieze informatie te beschikken kan BAM makkelijker werkzaamheden inplannen en uitvoeren.\n\n   Voorbeeld: Amsterdam Vitaal en Gezond\n   De Amsterdamse huisartsen wilden onderzoeken of zij hun cliënten beter konden helpen met de juiste hulp door de inzet van een laagdrempelige digitale buddy. In dit project hebben we een proof-of-concept ontwikkeld van een slimme en betrouwbare AI-assistent die zorgvragen begrijpt en passende hulp kan bieden. Dus niet een eenvoudige chatbot zoals bij een gemiddelde klantenservice, maar een empathische gesprekspartner die ingewikkelde conversaties kan afhandelen.\n\n   Teams\n   Onze projecten voeren we altijd uit met een team. Onze AI-programmeurs werken altijd nauw samen met onze front-enders, back-enders en app-ontwikkelaars. De precieze teamsamenstelling hangt daarbij steeds af van de opdracht.\n\n   Van elkaar leren\n   De bijna tien AI-engineers binnen Q42 wisselen veel kennis uit door ervaringen met elkaar en met andere collega's te delen. Dat gebeurt via Slack, door samen op kantoor in een uitdaging te duiken en tijdens de regelmatige AI-overleggen.\n\n   Bouwen van robuuste softwareproducten\n   De focus van onze AI-engineers is het bouwen van oplossingen. Ze hebben een goed beeld van de bestaande AI-technieken en hoe deze ingezet kunnen worden. Maar onze AI-experts hebben ook hands on ervaring in het ontwikkelen van robuuste softwareproducten (op basis van bijvoorbeeld cloud- en data-engineering) waarin AI ingezet wordt om het leven van de consument makkelijker te maken.\n\n   Flexibel en creatief meedenken\n   In de functie van AI-engineer is het belangrijk dat je flexibel en creatief kan meedenken met de klant over hoe AI in te zetten in hun projecten, en of AI voor hen wel de juiste oplossing is. De verwachting is dat jij de projecten kan dragen en ervoor zorgt dat het project goed wordt opgeleverd.\n\n1. \"Een wat? Een procedure?\" Ja, we weten 't, wij houden er ook niet van. Hebben we gelukkig ook niet zoveel. Maar omdat nieuwe mensen aannemen best wel heel erg superbelangrijk is, hebben we een manier bedacht om dit écht goed te doen. Komt-i:\n    2. Klik op 'Ik wil kennismaken!' en maak er een mooi verhaal van.\n    3. We organiseren een gesprek om te kletsen over jou én over Q. Bedenk ook van tevoren of je wat code kunt laten zien, iets waar je trots op bent. Dat is veel leuker om naar te kijken dan een CV.\n    4. Daarna doen we nog een gesprek. Maar dit keer krijg je eerst huiswerk mee: een leuke programmeeropdracht die je mag uitvoeren in de taal die je zelf het beste vindt passen.\n    5. De laatste stap is een pair-programming-middag. Je haakt dan zo'n drie uur lang aan bij twee AI-developers. Leuk voor jou om een stel Q'ers beter te leren kennen en ons werk van dichtbij te zien. Leuk voor ons omdat we graag zo veel mogelijk Q'ers betrekken bij de sollicitaties. We stellen hun achteraf de vraag: \"Zou je balen als we haar/hem niet aannemen?\" Als ze dan 'ja' zeggen, weten we genoeg.  \n    6. We doen je een aanbod, we krabbelen, en je komt hier lol en verschil maken.\n\n   In deze blogpost geven we meer uitleg over ons sollicitatieproces, de verschillende stappen, hoe we beoordelen, wat we zoeken in een kandidaat, et cetera.\n\n   Oh, en recruiters: wij zijn zelf heel goed in het vinden van nieuwe collega's. Jullie hulp is dus niet nodig én niet gewenst.",
        "Datum gevonden": "2024-11-29",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "ICT",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 11,
        "full_text": "AI-engineer\n\nTech zit in de kern van alles wat we doen. Onze teams van developers en projectleiders zijn altijd bezig met snel uitproberen, leren en verbeteren. Totdat het product fijn is in gebruik, de business laat groeien én wij er zelf een glimlach van krijgen.\n\nEn we hebben een vacature voor ervaren AI-engineers.\n\n   Wij zoeken ervaren AI-engineers die mooie softwareproducten willen maken voor eindgebruikers met inzet van AI.\n\n   Nieuwe slimme toepassingen\n   AI biedt allerlei kansen voor nieuwe slimme toepassingen. Bij Q42 werken we met diverse klanten samen aan uiteenlopende AI-projecten: van korte experimenten tot langlopende projecten.\n\n   Voorbeeld: BAM\n   BAM maakt voor ieder renovatieproject, zoals het verduurzamen van huizenblokken, gedetailleerde 3D-scans met drones. Het omzetten van deze scans naar nauwkeurige metingen hebben we dankzij AI weten te automatiseren en versnellen. Door eerder over precieze informatie te beschikken kan BAM makkelijker werkzaamheden inplannen en uitvoeren.\n\n   Voorbeeld: Amsterdam Vitaal en Gezond\n   De Amsterdamse huisartsen wilden onderzoeken of zij hun cliënten beter konden helpen met de juiste hulp door de inzet van een laagdrempelige digitale buddy. In dit project hebben we een proof-of-concept ontwikkeld van een slimme en betrouwbare AI-assistent die zorgvragen begrijpt en passende hulp kan bieden. Dus niet een eenvoudige chatbot zoals bij een gemiddelde klantenservice, maar een empathische gesprekspartner die ingewikkelde conversaties kan afhandelen.\n\n   Teams\n   Onze projecten voeren we altijd uit met een team. Onze AI-programmeurs werken altijd nauw samen met onze front-enders, back-enders en app-ontwikkelaars. De precieze teamsamenstelling hangt daarbij steeds af van de opdracht.\n\n   Van elkaar leren\n   De bijna tien AI-engineers binnen Q42 wisselen veel kennis uit door ervaringen met elkaar en met andere collega's te delen. Dat gebeurt via Slack, door samen op kantoor in een uitdaging te duiken en tijdens de regelmatige AI-overleggen.\n\n   Bouwen van robuuste softwareproducten\n   De focus van onze AI-engineers is het bouwen van oplossingen. Ze hebben een goed beeld van de bestaande AI-technieken en hoe deze ingezet kunnen worden. Maar onze AI-experts hebben ook hands on ervaring in het ontwikkelen van robuuste softwareproducten (op basis van bijvoorbeeld cloud- en data-engineering) waarin AI ingezet wordt om het leven van de consument makkelijker te maken.\n\n   Flexibel en creatief meedenken\n   In de functie van AI-engineer is het belangrijk dat je flexibel en creatief kan meedenken met de klant over hoe AI in te zetten in hun projecten, en of AI voor hen wel de juiste oplossing is. De verwachting is dat jij de projecten kan dragen en ervoor zorgt dat het project goed wordt opgeleverd.\n\n1. \"Een wat? Een procedure?\" Ja, we weten 't, wij houden er ook niet van. Hebben we gelukkig ook niet zoveel. Maar omdat nieuwe mensen aannemen best wel heel erg superbelangrijk is, hebben we een manier bedacht om dit écht goed te doen. Komt-i:\n    2. Klik op 'Ik wil kennismaken!' en maak er een mooi verhaal van.\n    3. We organiseren een gesprek om te kletsen over jou én over Q. Bedenk ook van tevoren of je wat code kunt laten zien, iets waar je trots op bent. Dat is veel leuker om naar te kijken dan een CV.\n    4. Daarna doen we nog een gesprek. Maar dit keer krijg je eerst huiswerk mee: een leuke programmeeropdracht die je mag uitvoeren in de taal die je zelf het beste vindt passen.\n    5. De laatste stap is een pair-programming-middag. Je haakt dan zo'n drie uur lang aan bij twee AI-developers. Leuk voor jou om een stel Q'ers beter te leren kennen en ons werk van dichtbij te zien. Leuk voor ons omdat we graag zo veel mogelijk Q'ers betrekken bij de sollicitaties. We stellen hun achteraf de vraag: \"Zou je balen als we haar/hem niet aannemen?\" Als ze dan 'ja' zeggen, weten we genoeg.  \n    6. We doen je een aanbod, we krabbelen, en je komt hier lol en verschil maken.\n\n   In deze blogpost geven we meer uitleg over ons sollicitatieproces, de verschillende stappen, hoe we beoordelen, wat we zoeken in een kandidaat, et cetera.\n\n   Oh, en recruiters: wij zijn zelf heel goed in het vinden van nieuwe collega's. Jullie hulp is dus niet nodig én niet gewenst."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "confidence_score": 4,
            "rationale": "The job description emphasizes building user-facing software products using AI, specifically mentioning AI assistants, chatbots, and applications for end-users. It highlights working with diverse AI projects and integrating AI into robust software solutions, aligning with the core responsibilities of a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task": "Business Understanding",
                    "phrases": [
                        {
                            "phrase": "Onze teams van developers en projectleiders zijn altijd bezig met snel uitproberen, leren en verbeteren. Totdat het product fijn is in gebruik, de business laat groeien én wij er zelf een glimlach van krijgen.",
                            "justification": "This phrase indicates an understanding of how technical work contributes to product usability, business growth, and user satisfaction, which are key aspects of business understanding."
                        },
                        {
                            "phrase": "AI biedt allerlei kansen voor nieuwe slimme toepassingen.",
                            "justification": "This shows an awareness of the potential business opportunities that AI can unlock."
                        },
                        {
                            "phrase": "Door eerder over precieze informatie te beschikken kan BAM makkelijker werkzaamheden inplannen en uitvoeren.",
                            "justification": "This exemplifies understanding how AI-driven insights can directly benefit business operations and planning."
                        },
                        {
                            "phrase": "De Amsterdamse huisartsen wilden onderzoeken of zij hun cliënten beter konden helpen met de juiste hulp door de inzet van een laagdrempelige digitale buddy.",
                            "justification": "This highlights understanding the client's (Amsterdam GPs) business need for better client support through a digital buddy."
                        },
                        {
                            "phrase": "In de functie van AI-engineer is het belangrijk dat je flexibel en creatief kan meedenken met de klant over hoe AI in te zetten in hun projecten, en of AI voor hen wel de juiste oplossing is.",
                            "justification": "This directly states the need to understand client needs and determine the appropriate application of AI for their projects."
                        },
                        {
                            "phrase": "De verwachting is dat jij de projecten kan dragen en ervoor zorgt dat het project goed wordt opgeleverd.",
                            "justification": "This implies responsibility for project success, which requires understanding project goals and business outcomes."
                        }
                    ]
                },
                {
                    "task": "Data Engineering",
                    "phrases": [
                        {
                            "phrase": "op basis van bijvoorbeeld cloud- en data-engineering",
                            "justification": "This phrase explicitly mentions 'data-engineering' as a basis for building AI-powered software products."
                        }
                    ]
                },
                {
                    "task": "Modeling",
                    "phrases": [
                        {
                            "phrase": "ervaren AI-engineers die mooie softwareproducten willen maken voor eindgebruikers met inzet van AI.",
                            "justification": "This indicates the core task of using AI to build products, which involves modeling."
                        },
                        {
                            "phrase": "Het omzetten van deze scans naar nauwkeurige metingen hebben we dankzij AI weten te automatiseren en versnellen.",
                            "justification": "This describes an AI application that automates and accelerates a process, implying model development or application."
                        },
                        {
                            "phrase": "een proof-of-concept ontwikkeld van een slimme en betrouwbare AI-assistent die zorgvragen begrijpt en passende hulp kan bieden.",
                            "justification": "Developing an AI assistant that understands queries and provides help directly relates to building and fine-tuning AI models."
                        },
                        {
                            "phrase": "een empathische gesprekspartner die ingewikkelde conversaties kan afhandelen.",
                            "justification": "This describes a sophisticated AI capability (empathetic conversational partner) that requires advanced modeling techniques, likely LLMs."
                        },
                        {
                            "phrase": "De focus van onze AI-engineers is het bouwen van oplossingen. Ze hebben een goed beeld van de bestaande AI-technieken en hoe deze ingezet kunnen worden.",
                            "justification": "This highlights the application of AI techniques, which inherently involves understanding and utilizing models."
                        }
                    ]
                },
                {
                    "task": "Software Development",
                    "phrases": [
                        {
                            "phrase": "ervaren AI-engineers die mooie softwareproducten willen maken voor eindgebruikers met inzet van AI.",
                            "justification": "This directly states the goal of creating 'software products' for end-users, a core aspect of software development."
                        },
                        {
                            "phrase": "Onze AI-programmeurs werken altijd nauw samen met onze front-enders, back-enders en app-ontwikkelaars.",
                            "justification": "This indicates collaboration with traditional software development roles (front-end, back-end, app developers), implying integration into software products."
                        },
                        {
                            "phrase": "op basis van bijvoorbeeld cloud- en data-engineering) waarin AI ingezet wordt om het leven van de consument makkelijker te maken.",
                            "justification": "Building software products that incorporate AI for consumer benefit is a key software development task."
                        },
                        {
                            "phrase": "een leuke programmeeropdracht die je mag uitvoeren in de taal die je zelf het beste vindt passen.",
                            "justification": "This refers to a programming assignment, a direct indicator of software development skills."
                        },
                        {
                            "phrase": "pair-programming-middag. Je haakt dan zo'n drie uur lang aan bij twee AI-developers.",
                            "justification": "Pair programming with AI developers directly involves software development practices."
                        }
                    ]
                },
                {
                    "task": "Operations Engineering (MLOps)",
                    "phrases": [
                        {
                            "phrase": "op basis van bijvoorbeeld cloud- en data-engineering",
                            "justification": "The mention of 'cloud' in the context of building AI solutions implies infrastructure and deployment considerations, which are part of MLOps."
                        }
                    ]
                }
            ],
            "technologies": [
                {
                    "tech": "TECH2: Cloud Platforms & Services",
                    "phrase": "cloud"
                },
                {
                    "tech": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "AI-assistent"
                },
                {
                    "tech": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "AI-assistent"
                },
                {
                    "tech": "TECH3: LLM / Generative Models",
                    "phrase": "AI-assistent"
                },
                {
                    "tech": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "AI-assistent"
                },
                {
                    "tech": "TECH3: LLM / Generative Models",
                    "phrase": "AI-assistent"
                }
            ],
            "soft_skills": [
                {
                    "skill": "SKILL1: Communication & Collaboration",
                    "phrases": [
                        {
                            "phrase": "Onze AI-programmeurs werken altijd nauw samen met onze front-enders, back-enders en app-ontwikkelaars.",
                            "justification": "Highlights close collaboration with different development teams."
                        },
                        {
                            "phrase": "De bijna tien AI-engineers binnen Q42 wisselen veel kennis uit door ervaringen met elkaar en met andere collega's te delen.",
                            "justification": "Indicates knowledge sharing and collaboration among AI engineers."
                        },
                        {
                            "phrase": "Dat gebeurt via Slack, door samen op kantoor in een uitdaging te duiken en tijdens de regelmatige AI-overleggen.",
                            "justification": "Specifies communication channels and collaborative activities."
                        },
                        {
                            "phrase": "Je haakt dan zo'n drie uur lang aan bij twee AI-developers. Leuk voor jou om een stel Q'ers beter te leren kennen en ons werk van dichtbij te zien.",
                            "justification": "Describes an activity designed for getting to know colleagues and understanding their work, fostering collaboration."
                        }
                    ]
                },
                {
                    "skill": "SKILL2: Learning & Adaptability",
                    "phrases": [
                        {
                            "phrase": "Onze teams van developers en projectleiders zijn altijd bezig met snel uitproberen, leren en verbeteren.",
                            "justification": "Emphasizes a culture of rapid experimentation, learning, and improvement."
                        },
                        {
                            "phrase": "Ze hebben een goed beeld van de bestaande AI-technieken en hoe deze ingezet kunnen worden.",
                            "justification": "Suggests a need to stay updated with current AI techniques."
                        },
                        {
                            "phrase": "In de functie van AI-engineer is het belangrijk dat je flexibel en creatief kan meedenken met de klant over hoe AI in te zetten in hun projecten",
                            "justification": "Highlights the importance of flexibility and creative thinking in applying AI, implying adaptability."
                        }
                    ]
                },
                {
                    "skill": "SKILL3: Problem Solving & Pragmatism",
                    "phrases": [
                        {
                            "phrase": "Totdat het product fijn is in gebruik, de business laat groeien én wij er zelf een glimlach van krijgen.",
                            "justification": "Focuses on delivering a usable product that achieves business goals and user satisfaction, indicating a pragmatic, results-oriented approach."
                        },
                        {
                            "phrase": "Het omzetten van deze scans naar nauwkeurige metingen hebben we dankzij AI weten te automatiseren en versnellen.",
                            "justification": "Demonstrates solving a problem (manual conversion of scans) by applying AI to automate and accelerate it."
                        },
                        {
                            "phrase": "een slimme en betrouwbare AI-assistent die zorgvragen begrijpt en passende hulp kan bieden.",
                            "justification": "Developing a 'smart and reliable' assistant implies problem-solving to meet specific functional requirements."
                        },
                        {
                            "phrase": "De verwachting is dat jij de projecten kan dragen en ervoor zorgt dat het project goed wordt opgeleverd.",
                            "justification": "Implies taking ownership and responsibility for project delivery, which requires problem-solving to overcome challenges."
                        },
                        {
                            "phrase": "een leuke programmeeropdracht die je mag uitvoeren in de taal die je zelf het beste vindt passen.",
                            "justification": "Allows choice of language, suggesting a pragmatic approach to problem-solving based on best fit."
                        }
                    ]
                },
                {
                    "skill": "SKILL5: Innovation & Ownership",
                    "phrases": [
                        {
                            "phrase": "AI biedt allerlei kansen voor nieuwe slimme toepassingen.",
                            "justification": "Suggests looking for new opportunities and innovative applications of AI."
                        },
                        {
                            "phrase": "De focus van onze AI-engineers is het bouwen van oplossingen.",
                            "justification": "Indicates a proactive approach to building solutions rather than just executing tasks."
                        },
                        {
                            "phrase": "De verwachting is dat jij de projecten kan dragen en ervoor zorgt dat het project goed wordt opgeleverd.",
                            "justification": "Directly implies taking ownership and responsibility for project success."
                        },
                        {
                            "phrase": "Komt-i: Klik op 'Ik wil kennismaken!' en maak er een mooi verhaal van.",
                            "justification": "Encourages candidates to take initiative and present themselves proactively."
                        }
                    ]
                }
            ]
        }
    }
}