{
    "job_id": 616,
    "job_details": {
        "job_id": 616,
        "Organisatienaam": "Bending the Rules",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Python Developer - LLM Specialist",
        "Standplaats": "Breda",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Java ontwikkelaar (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "In deze rol ben je verantwoordelijk voor het ontwikkelen en verfijnen van Large Language Models (LLM) specifiek gericht op toepassingen binnen de entertainmentindustrie. De focus ligt op het integreren van tekst- en beeldmodaliteiten op een creatieve en effectieve manier, geschikt voor een ervaren Python ontwikkelaar met kennis van grote taalmodellen en interesse in multimodale systemen.\n\n* LLM Fine-Tuning en Aanpassing: Werken aan het verfijnen van bestaande LLM's (zoals GPT, LLaMA, etc.) om ze te specialiseren voor entertainmenttaken, zoals assistentie bij het schrijven van scripts, beeldgebaseerde verhalen, en het genereren van creatieve content.\n     * Modelintegratie en API-ontwikkeling: Ontwikkelen en onderhouden van API's die de LLM integreren met multimodale input (bijv. tekst- en beeldprompts combineren), wat veelzijdige contentgeneratie en interactie mogelijk maakt.\n     * Implementatie van Trainingspijplijnen: Samenwerken aan het implementeren van schaalbare trainingspijplijnen met Python en relevante ML-bibliotheken (bijv. PyTorch, TensorFlow), met de nadruk op gebruiksvriendelijkheid en snelle iteraties.\n     * Model Evaluatie en Iteratie: Evaluatielussen uitvoeren met aangepaste metrics afgestemd op de entertainmentsector (bijv. creativiteit, verhaallijnconsistentie) en de modelprestaties optimaliseren door iteratieve verbeteringen.\n     * Samenwerkingsgericht Ontwikkelen: Nauw samenwerken met data engineers en MLOps engineers om een naadloze datastroom, modelimplementatie en integratie binnen de bredere infrastructuur te garanderen.",
        "Datum gevonden": "2024-08-31",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Mogelijk vast contract",
        "Parttime / fulltime": "Parttime / Fulltime",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "Python Developer - LLM Specialist\n\nIn deze rol ben je verantwoordelijk voor het ontwikkelen en verfijnen van Large Language Models (LLM) specifiek gericht op toepassingen binnen de entertainmentindustrie. De focus ligt op het integreren van tekst- en beeldmodaliteiten op een creatieve en effectieve manier, geschikt voor een ervaren Python ontwikkelaar met kennis van grote taalmodellen en interesse in multimodale systemen.\n\n* LLM Fine-Tuning en Aanpassing: Werken aan het verfijnen van bestaande LLM's (zoals GPT, LLaMA, etc.) om ze te specialiseren voor entertainmenttaken, zoals assistentie bij het schrijven van scripts, beeldgebaseerde verhalen, en het genereren van creatieve content.\n     * Modelintegratie en API-ontwikkeling: Ontwikkelen en onderhouden van API's die de LLM integreren met multimodale input (bijv. tekst- en beeldprompts combineren), wat veelzijdige contentgeneratie en interactie mogelijk maakt.\n     * Implementatie van Trainingspijplijnen: Samenwerken aan het implementeren van schaalbare trainingspijplijnen met Python en relevante ML-bibliotheken (bijv. PyTorch, TensorFlow), met de nadruk op gebruiksvriendelijkheid en snelle iteraties.\n     * Model Evaluatie en Iteratie: Evaluatielussen uitvoeren met aangepaste metrics afgestemd op de entertainmentsector (bijv. creativiteit, verhaallijnconsistentie) en de modelprestaties optimaliseren door iteratieve verbeteringen.\n     * Samenwerkingsgericht Ontwikkelen: Nauw samenwerken met data engineers en MLOps engineers om een naadloze datastroom, modelimplementatie en integratie binnen de bredere infrastructuur te garanderen."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, fine-tuning, and deployment of Large Language Models (LLMs) for specific applications within the entertainment industry. It highlights core GenAI Engineer responsibilities such as LLM fine-tuning, multimodal integration (text and image), API development for LLM integration, and the use of LLM frameworks. The focus on generative content and interaction aligns perfectly with the definition of a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3: Modeling",
                    "justification": "The description explicitly mentions 'LLM Fine-Tuning en Aanpassing' (LLM Fine-Tuning and Adaptation), 'verfijnen van bestaande LLM's' (refining existing LLMs), and 'genereren van creatieve content' (generating creative content), which are core modeling activities for generative AI.",
                    "phrase": "LLM Fine-Tuning en Aanpassing"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Modelintegratie en API-ontwikkeling' (Model integration and API development) directly relates to integrating and exposing models, a key part of the modeling lifecycle, especially when building applications around them.",
                    "phrase": "Modelintegratie en API-ontwikkeling"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The mention of 'Implementatie van Trainingspijplijnen' (Implementation of Training Pipelines) with ML libraries points to the practical aspects of preparing and running model training processes.",
                    "phrase": "Implementatie van Trainingspijplijnen"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The task of 'Model Evaluatie en Iteratie' (Model Evaluation and Iteration) with custom metrics and performance optimization is a fundamental part of the modeling process.",
                    "phrase": "Model Evaluatie en Iteratie"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description mentions 'ontwikkelen en verfijnen van Large Language Models (LLM) specifiek gericht op toepassingen' (developing and refining LLMs specifically for applications) and 'ontwikkelen en onderhouden van API's die de LLM integreren' (developing and maintaining APIs that integrate the LLM), which are software development tasks focused on building applications around AI models.",
                    "phrase": "ontwikkelen en verfijnen van Large Language Models (LLM) specifiek gericht op toepassingen"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'ontwikkelen en onderhouden van API's die de LLM integreren met multimodale input' (developing and maintaining APIs that integrate the LLM with multimodal input) clearly indicates software development for creating interfaces to AI models.",
                    "phrase": "ontwikkelen en onderhouden van API's die de LLM integreren met multimodale input"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The mention of 'Samenwerken met data engineers en MLOps engineers om een naadloze datastroom, modelimplementatie en integratie binnen de bredere infrastructuur te garanderen' (Collaborating with data engineers and MLOps engineers to ensure seamless data flow, model implementation, and integration within the broader infrastructure) points to operational aspects of deploying and maintaining models.",
                    "phrase": "Samenwerken met data engineers en MLOps engineers om een naadloze datastroom, modelimplementatie en integratie binnen de bredere infrastructuur te garanderen"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'Samenwerken met data engineers... om een naadloze datastroom... te garanderen' (Collaborating with data engineers... to ensure seamless data flow) implies involvement with or understanding of data pipelines and flow, which is part of data engineering.",
                    "phrase": "naadloze datastroom"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Samenwerkingsgericht Ontwikkelen"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Nauw samenwerken met data engineers en MLOps engineers"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "optimaliseren door iteratieve verbeteringen"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "interesse in multimodale systemen"
                }
            ],
            "technologies": [
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "Python"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "LLM"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "GPT"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "LLaMA"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "PyTorch"
                },
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "TensorFlow"
                }
            ]
        }
    }
}