{
    "job_id": 79,
    "job_details": {
        "job_id": 79,
        "Organisatienaam": "Nedap",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Software Developer",
        "Standplaats": "Groenlo",
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": "Michael Harras",
        "Telefoonnummer": null,
        "E-mail": "michael.vonharras@nedap.com",
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We're looking for a developer to join our new team. This team is working on a product that utilizes generative AI technology to support healthcare providers in their logistical processes.\n\n   Your main challenge is to collaborate with the team to translate these new technologies into a user-friendly and effective product. You will work together with our UX designer/researcher, front-end developer, and other team members to quickly develop prototypes. In doing so, you may need to be willing to accept less elegant or scalable solutions for rapid, testable delivery. Based on user testing, we then iteratively improve these prototypes. We are seeking someone with backend and API development experience who likes to go the extra mile. We are looking for curiosity, problem-solving skills, and the willingness to learn and implement new technologies.\n   Depending on your experience, a combination with a more leadership role within the new team is also a possibility.\n\n   Your team\n   Your team is a multidisciplinary product team within the Data Science group. The team consists of a UX designer/researcher and software developers with various specializations. You will be building a new product from scratch, where the team itself is responsible for using an iterative, exploratory process to discover how to leverage new technologies like generative AI and conversational agents to support healthcare workers with logistical challenges. In the long term, the experiences and insights gained from this product will form the foundation for the application of these advanced technologies across all of our products. You can also apply your knowledge more broadly within the Data Science group, allowing you to contribute not only to exploratory work but also to improving or expanding existing solutions.",
        "Datum gevonden": "2023-12-16",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Bouw",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2023,
        "Maand (van datum gevonden)": 12,
        "full_text": "Software Developer\n\nWe're looking for a developer to join our new team. This team is working on a product that utilizes generative AI technology to support healthcare providers in their logistical processes.\n\n   Your main challenge is to collaborate with the team to translate these new technologies into a user-friendly and effective product. You will work together with our UX designer/researcher, front-end developer, and other team members to quickly develop prototypes. In doing so, you may need to be willing to accept less elegant or scalable solutions for rapid, testable delivery. Based on user testing, we then iteratively improve these prototypes. We are seeking someone with backend and API development experience who likes to go the extra mile. We are looking for curiosity, problem-solving skills, and the willingness to learn and implement new technologies.\n   Depending on your experience, a combination with a more leadership role within the new team is also a possibility.\n\n   Your team\n   Your team is a multidisciplinary product team within the Data Science group. The team consists of a UX designer/researcher and software developers with various specializations. You will be building a new product from scratch, where the team itself is responsible for using an iterative, exploratory process to discover how to leverage new technologies like generative AI and conversational agents to support healthcare workers with logistical challenges. In the long term, the experiences and insights gained from this product will form the foundation for the application of these advanced technologies across all of our products. You can also apply your knowledge more broadly within the Data Science group, allowing you to contribute not only to exploratory work but also to improving or expanding existing solutions."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description explicitly mentions 'generative AI technology', 'conversational agents', and the goal of leveraging these technologies to support healthcare providers. The core responsibilities involve translating these new technologies into a user-friendly product, developing prototypes, and iteratively improving them based on user testing. This aligns strongly with the definition of a GenAI Engineer who focuses on designing, developing, and deploying applications built on generative models, and building production-grade user-facing software systems. While 'Software Developer' is in the title, the context clearly points to a specialization in generative AI applications."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4",
                    "justification": "The role involves 'backend and API development experience' and collaborating with a UX designer and front-end developer to 'quickly develop prototypes' and 'iteratively improve these prototypes', which are core software development activities for building user-facing applications.",
                    "phrase": "backend and API development experience"
                },
                {
                    "category": "TASK4",
                    "justification": "The description emphasizes translating new technologies into a 'user-friendly and effective product' and working with a UX designer and front-end developer to build prototypes, indicating a focus on application development.",
                    "phrase": "translate these new technologies into a user-friendly and effective product"
                },
                {
                    "category": "TASK4",
                    "justification": "The need to 'quickly develop prototypes' and 'iteratively improve these prototypes' based on user testing is a direct description of software development cycles for new product features.",
                    "phrase": "quickly develop prototypes"
                },
                {
                    "category": "TASK4",
                    "justification": "The iterative improvement of prototypes based on user testing is a key aspect of agile software development and product refinement.",
                    "phrase": "iteratively improve these prototypes"
                },
                {
                    "category": "TASK3",
                    "justification": "The team's objective is to 'leverage new technologies like generative AI and conversational agents', which directly involves working with and adapting generative models.",
                    "phrase": "leverage new technologies like generative AI and conversational agents"
                },
                {
                    "category": "TASK1",
                    "justification": "The role is part of a team working on a product to 'support healthcare providers in their logistical processes', indicating a need to understand the business context and user needs.",
                    "phrase": "support healthcare providers in their logistical processes"
                },
                {
                    "category": "TASK1",
                    "justification": "The team is responsible for discovering 'how to leverage new technologies' to solve logistical challenges, which requires understanding the business problem and how technology can address it.",
                    "phrase": "discover how to leverage new technologies"
                },
                {
                    "category": "TASK5",
                    "justification": "While not explicitly MLOps, the iterative development, prototyping, and eventual application of advanced technologies across products suggest a need for deployment and maintenance considerations, especially in a production environment.",
                    "phrase": "application of these advanced technologies across all of our products"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL3",
                    "phrase": "problem-solving skills"
                },
                {
                    "category": "SKILL2",
                    "phrase": "willingness to learn and implement new technologies"
                },
                {
                    "category": "SKILL1",
                    "phrase": "collaborate with the team"
                },
                {
                    "category": "SKILL5",
                    "phrase": "leadership role"
                },
                {
                    "category": "SKILL5",
                    "phrase": "go the extra mile"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "generative AI technology"
                },
                {
                    "category": "TECH4",
                    "phrase": "conversational agents"
                }
            ]
        }
    }
}