{
    "job_id": 398,
    "job_details": {
        "job_id": 398,
        "Organisatienaam": "Asmlearlycareer",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Software Developer Internship",
        "Standplaats": "Veldhoven",
        "Vacaturelink (origineel)": "jobsonline.nl",
        "Contactpersoon": "Schoonmaak Veldhoven",
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Stage / afstudeerplaats / bbl (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Alignment Software Application Group is responsible of developing software applications on product wafer alignment domain at ASML. We create tools that helps our customers to optimize, monitor and diagnose wafer alignment process performed within Twinscan.\n\n   Your Assignment\n\n   You will be joining the Proact Team within the Software Development Group. Your task will be to:\n     * Support in developing scripts that would improve daily work; such as scripts that would automatetasks that software developers are performing\n     * Create a proof of concept Large Language Models (LLM) on premise and offline, where we collect, ingest documents; train the LLM with our custom information and be able to ask questions to documents, Become an intern at a Dutch company that's a global industry leader. You'll gain valuable experience in a highly innovative environment - one that sparks your imagination and creativity. In addition to a monthly internship allowance (plus a possible housing or travel allowance), you'll get practical guidance from experts in the field and the chance to work in and experience a dynamic team environment.",
        "Datum gevonden": "2024-03-15",
        "Beroepsgroep": "Overige beroepen",
        "Beroepsklasse": "Overig",
        "Contracttype": "Stage / Afstudeerplaats",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 3,
        "full_text": "Software Developer Internship\n\nAlignment Software Application Group is responsible of developing software applications on product wafer alignment domain at ASML. We create tools that helps our customers to optimize, monitor and diagnose wafer alignment process performed within Twinscan.\n\n   Your Assignment\n\n   You will be joining the Proact Team within the Software Development Group. Your task will be to:\n     * Support in developing scripts that would improve daily work; such as scripts that would automatetasks that software developers are performing\n     * Create a proof of concept Large Language Models (LLM) on premise and offline, where we collect, ingest documents; train the LLM with our custom information and be able to ask questions to documents, Become an intern at a Dutch company that's a global industry leader. You'll gain valuable experience in a highly innovative environment - one that sparks your imagination and creativity. In addition to a monthly internship allowance (plus a possible housing or travel allowance), you'll get practical guidance from experts in the field and the chance to work in and experience a dynamic team environment."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description is for a 'Software Developer Internship' and focuses on developing scripts to automate tasks and creating a proof of concept for an LLM. While it mentions LLMs, the core responsibility appears to be software development and automation scripting, rather than the deep specialization in generative AI model development, fine-tuning, or deployment expected of a GenAI Engineer. The role is also an internship, which typically involves broader learning and support rather than leading specialized AI projects. The description lacks the depth of ML or GenAI specific tasks and technologies to classify it as either ML Engineer or GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves 'developing scripts that would improve daily work' and 'automatetasks that software developers are performing', which are core software development activities focused on improving developer productivity and workflow.",
                    "phrase": "developing scripts that would improve daily work"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "Automating tasks performed by software developers falls under the umbrella of software development, focusing on efficiency and tooling.",
                    "phrase": "scripts that would automatetasks that software developers are performing"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "Creating a proof of concept for an LLM, including collecting and ingesting documents, and training the LLM with custom information, directly relates to the process of adapting or creating models, even if it's a proof of concept.",
                    "phrase": "Create a proof of concept Large Language Models (LLM) on premise and offline, where we collect, ingest documents; train the LLM with our custom information and be able to ask questions to documents"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The internship is within the 'Alignment Software Application Group' responsible for 'developing software applications on product wafer alignment domain', indicating a need to understand the business context of wafer alignment.",
                    "phrase": "Alignment Software Application Group is responsible of developing software applications on product wafer alignment domain"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL5: Innovation and Ownership",
                    "phrase": "highly innovative environment - one that sparks your imagination and creativity"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "chance to work in and experience a dynamic team environment"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "gain valuable experience"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "Large Language Models (LLM)"
                }
            ]
        }
    }
}