{
    "job_id": 1003,
    "job_details": {
        "job_id": 1003,
        "Organisatienaam": "Profi-Workers",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "Machine Learning Engineer",
        "Standplaats": null,
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Machine learning engineer (m/v/x)",
        "Opleidingsniveau": "WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "In deze uitdagende rol ben je verantwoordelijk voor het bouwen, trainen en implementeren van geavanceerde machine learning-modellen die direct bijdragen aan de strategische doelen van het bedrijf. Je krijgt de kans om te werken aan grootschalige datasets en samen te werken met een team van datawetenschappers, softwareontwikkelaars en productmanagers.\n     * Ontwikkelen van AI-oplossingen: Bouw en optimaliseer machine learning-modellen die variëren van voorspellende analyses tot aanbevelingssystemen.\n     * Data-analyse: Werk met enorme datasets, voer analyses uit en zorg ervoor dat jouw modellen robuust en schaalbaar zijn.\n     * Experimenteren met technologieën: Gebruik frameworks zoals TensorFlow, PyTorch en Scikit-learn om cutting-edge oplossingen te ontwikkelen.\n     * Samenwerking: Werk samen met multidisciplinaire teams om machine learning-oplossingen te integreren in schaalbare softwareapplicaties.\n     * Onderzoek en innovatie: Verken nieuwe technieken zoals reinforcement learning en generatieve AI om de grenzen van wat mogelijk is te verleggen.\n     * Productie-klaar maken: Zorg ervoor dat jouw AI-oplossingen klaar zijn voor implementatie in real-world toepassingen.",
        "Datum gevonden": "2024-12-21",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 12,
        "full_text": "Machine Learning Engineer\n\nIn deze uitdagende rol ben je verantwoordelijk voor het bouwen, trainen en implementeren van geavanceerde machine learning-modellen die direct bijdragen aan de strategische doelen van het bedrijf. Je krijgt de kans om te werken aan grootschalige datasets en samen te werken met een team van datawetenschappers, softwareontwikkelaars en productmanagers.\n     * Ontwikkelen van AI-oplossingen: Bouw en optimaliseer machine learning-modellen die variëren van voorspellende analyses tot aanbevelingssystemen.\n     * Data-analyse: Werk met enorme datasets, voer analyses uit en zorg ervoor dat jouw modellen robuust en schaalbaar zijn.\n     * Experimenteren met technologieën: Gebruik frameworks zoals TensorFlow, PyTorch en Scikit-learn om cutting-edge oplossingen te ontwikkelen.\n     * Samenwerking: Werk samen met multidisciplinaire teams om machine learning-oplossingen te integreren in schaalbare softwareapplicaties.\n     * Onderzoek en innovatie: Verken nieuwe technieken zoals reinforcement learning en generatieve AI om de grenzen van wat mogelijk is te verleggen.\n     * Productie-klaar maken: Zorg ervoor dat jouw AI-oplossingen klaar zijn voor implementatie in real-world toepassingen."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description emphasizes building, training, and implementing advanced machine learning models for predictive analytics and recommendation systems. It highlights core ML Engineer responsibilities such as data analysis on large datasets, model robustness and scalability, and experimentation with frameworks like TensorFlow, PyTorch, and Scikit-learn. While generative AI is mentioned as an area for exploration, the primary focus remains on traditional ML model development and deployment, aligning best with the ML Engineer profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Ontwikkelen van AI-oplossingen: Bouw en optimaliseer machine learning-modellen die variëren van voorspellende analyses tot aanbevelingssystemen' directly describes the creation and optimization of machine learning models.",
                    "phrase": "Bouw en optimaliseer machine learning-modellen die variëren van voorspellende analyses tot aanbevelingssystemen"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'Data-analyse: Werk met enorme datasets, voer analyses uit en zorg ervoor dat jouw modellen robuust en schaalbaar zijn' involves working with large datasets and performing analyses, which are key aspects of data engineering for model development.",
                    "phrase": "Werk met enorme datasets, voer analyses uit en zorg ervoor dat jouw modellen robuust en schaalbaar zijn"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Experimenteren met technologieën: Gebruik frameworks zoals TensorFlow, PyTorch en Scikit-learn om cutting-edge oplossingen te ontwikkelen' describes the practical application of ML frameworks for developing solutions, which falls under modeling.",
                    "phrase": "Gebruik frameworks zoals TensorFlow, PyTorch en Scikit-learn om cutting-edge oplossingen te ontwikkelen"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'Samenwerking: Werk samen met multidisciplinaire teams om machine learning-oplossingen te integreren in schaalbare softwareapplicaties' implies integrating ML solutions into broader software applications, a software development task.",
                    "phrase": "integreer machine learning-oplossingen in schaalbare softwareapplicaties"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Onderzoek en innovatie: Verken nieuwe technieken zoals reinforcement learning en generatieve AI om de grenzen van wat mogelijk is te verleggen' indicates exploration and application of advanced modeling techniques, including generative AI.",
                    "phrase": "Verken nieuwe technieken zoals reinforcement learning en generatieve AI"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'Productie-klaar maken: Zorg ervoor dat jouw AI-oplossingen klaar zijn voor implementatie in real-world toepassingen' directly relates to preparing models for production and deployment.",
                    "phrase": "Zorg ervoor dat jouw AI-oplossingen klaar zijn voor implementatie in real-world toepassingen"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The initial sentence 'In deze uitdagende rol ben je verantwoordelijk voor het bouwen, trainen en implementeren van geavanceerde machine learning-modellen die direct bijdragen aan de strategische doelen van het bedrijf' highlights the alignment of ML models with strategic business goals.",
                    "phrase": "bouwen, trainen en implementeren van geavanceerde machine learning-modellen die direct bijdragen aan de strategische doelen van het bedrijf"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "samen te werken met een team van datawetenschappers, softwareontwikkelaars en productmanagers"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Onderzoek en innovatie"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Verken nieuwe technieken"
                }
            ],
            "technologies": [
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "TensorFlow"
                },
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "PyTorch"
                },
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "Scikit-learn"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "generatieve AI"
                }
            ]
        }
    }
}