{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Ontwikkeling van framework voor het onderzoek naar multi-agent general purpose AI-systemen.",
                "justification": "This phrase directly refers to the development of a framework for researching AI systems, which falls under the broader category of model development and research."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Het opzetten en configureren van een testomgeving om generatieve AI-modellen te evalueren aan de hand van cybersecurity-benchmarks.",
                "justification": "Setting up and configuring an environment to evaluate generative AI models aligns with the process of assessing and refining models."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Het ontwikkelen van een werkwijze op basis van coding standards en workflow-automatisering voor reproduceerbare, betrouwbare en onderhoudbare infrastructure-as-code.",
                "justification": "Developing methodologies for coding standards, workflow automation, and infrastructure-as-code are core software development practices."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "speel je een cruciale rol in het vormgeven van het nationale en Europese toezicht op complexe AI binnen de RDI.",
                "justification": "This phrase highlights the role in shaping national and European supervision of AI, indicating a need to understand business and regulatory contexts."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Je bevindt je in de unieke positie om de veiligheids- en beveiligingsrisico's van generatieve AI te onderzoeken, beleidsadvies te geven en bij te dragen aan de maatschappelijke verantwoordelijkheid van de RDI in haar rol als toezichthouder op digitale infrastructuur en AI.",
                "justification": "Researching risks, providing policy advice, and contributing to societal responsibility in a supervisory role requires business and policy understanding."
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Kennisoverdracht naar de junior onderzoekers en engineers."
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "Up-to-date blijven bij de meest recente wetenschappelijke ontwikkelingen op het gebied van cybersecurity en AI."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "generatieve AI"
            },
            {
                "category_id": "TECH3",
                "tool_name": "multi-agent general purpose AI-systemen"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Kennisoverdracht naar de junior onderzoekers en engineers."
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "Up-to-date blijven bij de meest recente wetenschappelijke ontwikkelingen op het gebied van cybersecurity en AI."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "vormgeven van het nationale en Europese toezicht op complexe AI binnen de RDI"
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "beleidsadvies te geven en bij te dragen aan de maatschappelijke verantwoordelijkheid van de RDI"
            }
        ]
    },
    "classification": {
        "profile": "ML Engineer",
        "confidence": 3,
        "rationale": "While the role involves generative AI, the core responsibilities focus on developing frameworks for research, setting up test environments for evaluation, and improving infrastructure-as-code. This leans more towards the engineering and operational aspects of AI models rather than building user-facing applications with LLMs, as described for GenAI Engineer."
    }
}