{
    "job_id": 1116,
    "job_details": {
        "job_id": 1116,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Application Support Engineer, Trilogy (Remote) - $60,000/year USD",
        "Standplaats": "Rotterdam",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Helpdeskmedewerker informatietechnologie (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* AI-Augmented Customer Resolutions: Analyze complex tickets escalated by AI systems, apply human expertise to areas where AI falls short, and then close the gap by improving the AI system\n     * AI Training and Improvement: Review AI-generated solutions and provide detailed feedback and participate in AI model fine-tuning sessions\n     * Cutting-Edge AI Integration: Prototype and test new AI tools and methodologies\n\n   What you will NOT be doing\n\n     * Taking two whole months to get up to speed; you will be expected to ramp up one several products within the first month (we are aware this is aggressive)\n     * Relying on your managers for help; if you are not adept at unblocking yourself, you will likely struggle in this role, * Integrate technical human expertise and AI capabilities to deliver exceptional customer support, focusing on complex issues that AI cannot yet fully resolve",
        "Datum gevonden": "2024-07-19",
        "Beroepsgroep": "Supportmedewerkers",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Cultuur / Recreatie",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 7,
        "full_text": "Application Support Engineer, Trilogy (Remote) - $60,000/year USD\n\n* AI-Augmented Customer Resolutions: Analyze complex tickets escalated by AI systems, apply human expertise to areas where AI falls short, and then close the gap by improving the AI system\n     * AI Training and Improvement: Review AI-generated solutions and provide detailed feedback and participate in AI model fine-tuning sessions\n     * Cutting-Edge AI Integration: Prototype and test new AI tools and methodologies\n\n   What you will NOT be doing\n\n     * Taking two whole months to get up to speed; you will be expected to ramp up one several products within the first month (we are aware this is aggressive)\n     * Relying on your managers for help; if you are not adept at unblocking yourself, you will likely struggle in this role, * Integrate technical human expertise and AI capabilities to deliver exceptional customer support, focusing on complex issues that AI cannot yet fully resolve"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on supporting and improving existing AI systems by analyzing escalated tickets and providing feedback for fine-tuning. While it involves interaction with AI, it does not emphasize the core responsibilities of developing, fine-tuning, or deploying generative models or building production-grade user-facing software systems as a primary function. The role appears to be more about AI-assisted customer support and iterative improvement of AI tools rather than core AI engineering. The salary range also suggests a support role rather than a specialized engineering role."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'participate in AI model fine-tuning sessions' directly relates to the process of adapting or improving machine learning models.",
                    "phrase": "participate in AI model fine-tuning sessions"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'improving the AI system' implies a direct involvement in the modification or enhancement of AI models or their underlying logic.",
                    "phrase": "improving the AI system"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Review AI-generated solutions and provide detailed feedback' indicates an involvement in the evaluation and refinement of AI outputs, which is part of the model improvement cycle.",
                    "phrase": "Review AI-generated solutions and provide detailed feedback"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'Prototype and test new AI tools and methodologies' involves the development and evaluation of new technical solutions, which aligns with software development practices, albeit in an exploratory capacity.",
                    "phrase": "Prototype and test new AI tools and methodologies"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'Analyze complex tickets escalated by AI systems, apply human expertise to areas where AI falls short' shows an understanding of how AI is used in a business context (customer support) and identifying its limitations.",
                    "phrase": "Analyze complex tickets escalated by AI systems, apply human expertise to areas where AI falls short"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'Integrate technical human expertise and AI capabilities to deliver exceptional customer support' demonstrates an understanding of how to combine different capabilities to achieve a business outcome (customer support).",
                    "phrase": "Integrate technical human expertise and AI capabilities to deliver exceptional customer support"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL3",
                    "phrase": "unblocking yourself"
                },
                {
                    "category": "SKILL2",
                    "phrase": "ramp up one several products within the first month"
                },
                {
                    "category": "SKILL1",
                    "phrase": "apply human expertise to areas where AI falls short"
                }
            ],
            "technologies": []
        }
    }
}