{
    "job_id": 924,
    "job_details": {
        "job_id": 924,
        "Organisatienaam": "ING Bank N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Data Engineer CDD",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We are looking for a Data Engineer to join us in Amsterdam. In this role, you will be responsible for designing, building, and optimizing complex data pipelines to process transactional and other data. Y ou will collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture to support the next generation of products and data initiatives.\n       We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills. We hire people based on an evaluation of their potential and support them throughout their time in Amsterdam. Come join us!\n       The Team\n       Within ING, there is ING Analytics (INGA) - a major driving force in its digital transformation of the bank.\n       By creating measurable value for ING and its customers through world-class analytics products and services, INGA helps ING to become a leader in data-driven decision - making. Among others, INGA delivers call & speech analytics, generative AI in risk summarization, insights into portfolio performance, advanced ESG data insights (commercial purposes), data analytics platforms (cloud and on-premises), and many more.\n       A working day in the life of a Data Engineer\n       A typical day for a data engineer starts with coffee, catching up with colleagues, and drafting a plan for the coming day. After the standup, you will start exploring the data to solve business problems, building and maintaining the production-ready infrastructure, and building the data pipelines that clean, transform, and aggregate data from disparate sources. Being an advocate for best practices in data engineering is important while working on such tasks.\n       After lunch, you organized a knowledge-sharing session to explain data security, compliance, and privacy standards to the rest of the data engineering team. Finally, to wrap up the day, you collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning.\n       Roles and responsibilities",
        "Datum gevonden": "2024-12-22",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Financieel / Verzekeringen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 12,
        "full_text": "Data Engineer CDD\n\nWe are looking for a Data Engineer to join us in Amsterdam. In this role, you will be responsible for designing, building, and optimizing complex data pipelines to process transactional and other data. Y ou will collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture to support the next generation of products and data initiatives.\n       We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills. We hire people based on an evaluation of their potential and support them throughout their time in Amsterdam. Come join us!\n       The Team\n       Within ING, there is ING Analytics (INGA) - a major driving force in its digital transformation of the bank.\n       By creating measurable value for ING and its customers through world-class analytics products and services, INGA helps ING to become a leader in data-driven decision - making. Among others, INGA delivers call & speech analytics, generative AI in risk summarization, insights into portfolio performance, advanced ESG data insights (commercial purposes), data analytics platforms (cloud and on-premises), and many more.\n       A working day in the life of a Data Engineer\n       A typical day for a data engineer starts with coffee, catching up with colleagues, and drafting a plan for the coming day. After the standup, you will start exploring the data to solve business problems, building and maintaining the production-ready infrastructure, and building the data pipelines that clean, transform, and aggregate data from disparate sources. Being an advocate for best practices in data engineering is important while working on such tasks.\n       After lunch, you organized a knowledge-sharing session to explain data security, compliance, and privacy standards to the rest of the data engineering team. Finally, to wrap up the day, you collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning.\n       Roles and responsibilities"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses heavily on data engineering tasks such as designing, building, and optimizing data pipelines, cleaning, transforming, and aggregating data. While it mentions collaboration with data scientists and analysts, and indirectly supports machine learning and generative AI initiatives by providing data, it does not describe core responsibilities related to developing, fine-tuning, or deploying generative models themselves, nor does it emphasize predictive modeling or MLOps for AI models. The primary focus remains on data infrastructure and processing, aligning more with traditional data engineering rather than specialized ML or GenAI engineering roles. The mention of 'generative AI in risk summarization' is in the context of what INGA delivers, not necessarily the direct responsibilities of this specific Data Engineer role."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The role is explicitly titled 'Data Engineer' and the description details responsibilities like 'designing, building, and optimizing complex data pipelines', 'process transactional and other data', 'developing and maintaining data solutions', 'building and maintaining the production-ready infrastructure', and 'building the data pipelines that clean, transform, and aggregate data from disparate sources'.",
                    "phrase": "designing, building, and optimizing complex data pipelines"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "This phrase directly relates to the core function of preparing and structuring data for further use, which is a fundamental aspect of data engineering.",
                    "phrase": "clean, transform, and aggregate data from disparate sources"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves collaborating with data scientists and analysts to support 'the next generation of products and data initiatives', and 'exploring the data to solve business problems', indicating a need to understand business context and goals.",
                    "phrase": "solve business problems"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The description mentions supporting 'the next generation of products and data initiatives', which requires understanding the business's strategic direction and how data can contribute to it.",
                    "phrase": "support the next generation of products and data initiatives"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "While the primary focus is data engineering, the role involves 'developing and maintaining data solutions and INGA's data architecture', which implies building and managing software components related to data infrastructure.",
                    "phrase": "developing and maintaining data solutions"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'building and maintaining the production-ready infrastructure' suggests involvement in the operational aspects of data systems, which is analogous to MLOps for data pipelines.",
                    "phrase": "building and maintaining the production-ready infrastructure"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The job description mentions collaborating with data science and analysts to 'develop data models and pipelines for research, reporting, and machine learning', indicating a supporting role in the modeling process.",
                    "phrase": "develop data models and pipelines for research, reporting, and machine learning"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The role requires close 'collaboration with data scientists and analysts' and organizing 'knowledge-sharing session[s]', highlighting the need for effective communication and teamwork.",
                    "phrase": "collaborate closely with data scientists and analysts"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "The description explicitly states they are 'looking for curious and empathetic individuals who are committed to developing themselves and learning new skills', directly pointing to the importance of learning and adaptability.",
                    "phrase": "committed to developing themselves and learning new skills"
                },
                {
                    "category": "SKILL4: Ethical & Legal Responsibility",
                    "justification": "The mention of organizing a 'knowledge-sharing session to explain data security, compliance, and privacy standards' directly relates to ethical and legal considerations in data handling.",
                    "phrase": "data security, compliance, and privacy standards"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "justification": "The task of 'exploring the data to solve business problems' implies analytical and problem-solving skills.",
                    "phrase": "exploring the data to solve business problems"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "Being an 'advocate for best practices in data engineering' suggests a proactive approach and taking ownership of quality standards.",
                    "phrase": "Being an advocate for best practices in data engineering"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborate closely with data scientists and analysts"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "knowledge-sharing session"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "committed to developing themselves and learning new skills"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "exploring the data to solve business problems"
                },
                {
                    "category": "SKILL4: Ethical & Legal Responsibility",
                    "phrase": "data security, compliance, and privacy standards"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Being an advocate for best practices in data engineering"
                }
            ],
            "technologies": []
        }
    }
}