{
    "job_id": 172,
    "job_details": {
        "job_id": 172,
        "Organisatienaam": "Base Cyber Security",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI DevSecOps Engineer",
        "Standplaats": "Amersfoort",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": "professionals@basecybersecurity.com",
        "Beroep": "OTN-engineer (optisch transportnetwerk) (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als AI DevSecOps Engineer speel je een essentiële rol in het waarborgen van de veiligheid en betrouwbaarheid van AI-systemen. Je werkt binnen een innovatief laboratorium dat zich richt op onderzoek en toezicht op geavanceerde AI-toepassingen. Jouw bijdrage is cruciaal bij het ontwikkelen van methoden en tools om risico's binnen AI-systemen te analyseren en te beperken.\n\n   Binnen deze functie ben je verantwoordelijk voor:\n     * Het ontwikkelen van een framework om multi-agent AI-systemen te onderzoeken.\n     * Het opzetten en configureren van een testomgeving voor het evalueren van generatieve AI-modellen op basis van cybersecurity-richtlijnen.\n     * Het implementeren van geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur.\n     * Het delen van kennis en begeleiden van junior engineers en onderzoekers.\n     * Het volgen van de nieuwste ontwikkelingen op het gebied van AI en cybersecurity en deze toepassen in het onderzoek.\n\n   Deze rol biedt de kans om een directe impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context.",
        "Datum gevonden": "2025-02-21",
        "Beroepsgroep": "Network Specialists",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Parttime (≤ 32 uur)",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "AI DevSecOps Engineer\n\nAls AI DevSecOps Engineer speel je een essentiële rol in het waarborgen van de veiligheid en betrouwbaarheid van AI-systemen. Je werkt binnen een innovatief laboratorium dat zich richt op onderzoek en toezicht op geavanceerde AI-toepassingen. Jouw bijdrage is cruciaal bij het ontwikkelen van methoden en tools om risico's binnen AI-systemen te analyseren en te beperken.\n\n   Binnen deze functie ben je verantwoordelijk voor:\n     * Het ontwikkelen van een framework om multi-agent AI-systemen te onderzoeken.\n     * Het opzetten en configureren van een testomgeving voor het evalueren van generatieve AI-modellen op basis van cybersecurity-richtlijnen.\n     * Het implementeren van geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur.\n     * Het delen van kennis en begeleiden van junior engineers en onderzoekers.\n     * Het volgen van de nieuwste ontwikkelingen op het gebied van AI en cybersecurity en deze toepassen in het onderzoek.\n\n   Deze rol biedt de kans om een directe impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description emphasizes developing methods and tools to analyze and mitigate risks within AI systems, focusing on security and reliability. While it mentions generative AI models and multi-agent systems, the core responsibilities lean towards building frameworks for investigation, setting up test environments based on cybersecurity guidelines, implementing automated workflows for infrastructure, and applying the latest developments in AI and cybersecurity. This aligns more closely with the operational and engineering aspects of ensuring AI systems are robust and secure, which is a key component of MLOps (Operations Engineering) and the productionization of models, rather than the core development of generative models themselves. The emphasis on 'DevSecOps' further points to operational security and reliability."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'evalueren van generatieve AI-modellen' directly relates to the process of assessing and potentially fine-tuning or adapting AI models.",
                    "phrase": "evalueren van generatieve AI-modellen"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'ontwikkelen van een framework om multi-agent AI-systemen te onderzoeken' implies building a structured system or application to facilitate research and investigation of AI systems.",
                    "phrase": "ontwikkelen van een framework om multi-agent AI-systemen te onderzoeken"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'opzetten en configureren van een testomgeving voor het evalueren van generatieve AI-modellen op basis van cybersecurity-richtlijnen' involves setting up and managing environments for testing and evaluation, which is a core MLOps activity.",
                    "phrase": "opzetten en configureren van een testomgeving voor het evalueren van generatieve AI-modellen op basis van cybersecurity-richtlijnen"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'implementeren van geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur' directly refers to building automated processes and standards for infrastructure management, a key aspect of MLOps and DevSecOps.",
                    "phrase": "implementeren van geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'waarborgen van de veiligheid en betrouwbaarheid van AI-systemen' and 'analyseren en beperken van risico's binnen AI-systemen' indicates an understanding of the business need for secure and reliable AI, and the alignment of technical work with these goals.",
                    "phrase": "waarborgen van de veiligheid en betrouwbaarheid van AI-systemen"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context' shows an understanding of the broader business and societal implications of AI.",
                    "phrase": "impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "delen van kennis en begeleiden van junior engineers en onderzoekers"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "volgen van de nieuwste ontwikkelingen op het gebied van AI en cybersecurity en deze toepassen in het onderzoek"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "ontwikkelen van methoden en tools om risico's binnen AI-systemen te analyseren en te beperken"
                }
            ],
            "technologies": []
        }
    }
}