{
    "job_id": 707,
    "job_details": {
        "job_id": 707,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Technical Support Engineer, Trilogy (Remote) - $60,000/year USD",
        "Standplaats": "Utrecht",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Technical support specialist (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* AI-Augmented Customer Resolutions: Analyze complex tickets escalated by AI systems, apply human expertise to areas where AI falls short, and then close the gap by improving the AI system\n     * AI Training and Improvement: Review AI-generated solutions and provide detailed feedback and participate in AI model fine-tuning sessions\n     * Cutting-Edge AI Integration: Prototype and test new AI tools and methodologies\n\n   What you will NOT be doing\n\n     * Taking two whole months to get up to speed; you will be expected to ramp up one several products within the first month (we are aware this is aggressive)\n     * Relying on your managers for help; if you are not adept at unblocking yourself, you will likely struggle in this role, * Integrate technical human expertise and AI capabilities to deliver exceptional customer support, focusing on complex issues that AI cannot yet fully resolve",
        "Datum gevonden": "2024-11-23",
        "Beroepsgroep": "Supportmedewerkers",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 11,
        "full_text": "Technical Support Engineer, Trilogy (Remote) - $60,000/year USD\n\n* AI-Augmented Customer Resolutions: Analyze complex tickets escalated by AI systems, apply human expertise to areas where AI falls short, and then close the gap by improving the AI system\n     * AI Training and Improvement: Review AI-generated solutions and provide detailed feedback and participate in AI model fine-tuning sessions\n     * Cutting-Edge AI Integration: Prototype and test new AI tools and methodologies\n\n   What you will NOT be doing\n\n     * Taking two whole months to get up to speed; you will be expected to ramp up one several products within the first month (we are aware this is aggressive)\n     * Relying on your managers for help; if you are not adept at unblocking yourself, you will likely struggle in this role, * Integrate technical human expertise and AI capabilities to deliver exceptional customer support, focusing on complex issues that AI cannot yet fully resolve"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on using and improving AI tools for customer support, rather than developing or engineering AI models or systems from scratch. The core responsibilities involve analyzing tickets, providing feedback to AI, and prototyping new AI tools, which aligns more with the application and enhancement of existing AI rather than core AI engineering. The role is primarily customer-facing and support-oriented, with a strong emphasis on 'AI-Augmented Customer Resolutions' and 'AI Training and Improvement' through feedback, rather than building predictive models or generative applications. This aligns with the 'Ambiguous' profile's definition of roles primarily focused on the USE of AI tools to enhance productivity or roles that are not core AI engineering."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'participate in AI model fine-tuning sessions' directly relates to adapting or training AI models.",
                    "phrase": "participate in AI model fine-tuning sessions"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'Prototype and test new AI tools and methodologies' involves building and testing new functionalities, which is a software development task.",
                    "phrase": "Prototype and test new AI tools and methodologies"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'Integrate technical human expertise and AI capabilities to deliver exceptional customer support' shows an understanding of how to align technical solutions (AI integration) with business goals (exceptional customer support).",
                    "phrase": "Integrate technical human expertise and AI capabilities to deliver exceptional customer support"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'improving the AI system' implies working on the models or logic that power the AI.",
                    "phrase": "improving the AI system"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'Analyze complex tickets escalated by AI systems' requires understanding the nature of the issues and the business context of customer support.",
                    "phrase": "Analyze complex tickets escalated by AI systems"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'Review AI-generated solutions and provide detailed feedback' involves understanding the output of the AI in relation to the problem and the business need for a correct solution.",
                    "phrase": "Review AI-generated solutions and provide detailed feedback"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2",
                    "phrase": "taking two whole months to get up to speed; you will be expected to ramp up one several products within the first month (we are aware this is aggressive)"
                },
                {
                    "category": "SKILL3",
                    "phrase": "if you are not adept at unblocking yourself, you will likely struggle in this role"
                },
                {
                    "category": "SKILL1",
                    "phrase": "Integrate technical human expertise and AI capabilities"
                }
            ],
            "technologies": []
        }
    }
}