{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Data pipelines: Ontwerpen, bouwen en onderhouden van data pipelines op ons Snowflake platform, die onze Tableau-rapportages voeden via een semantische laag.",
                "justification": "This phrase explicitly mentions designing, building, and maintaining data pipelines and mentions Snowflake, which is a data warehousing platform."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Generatieve AI: Overdracht en doorontwikkeling van projecten zoals de GenAI Suite en de Klus Coach (een generatieve AI-assistent voor klanten).",
                "justification": "This phrase directly refers to Generative AI projects, including a generative AI assistant, indicating work on AI models."
            },
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Data Science ondersteuning: Beheer van Dataiku-projecten en ondersteuning van data science-initiatieven.",
                "justification": "Managing Dataiku projects and supporting data science initiatives falls under the broader umbrella of data engineering and preparing data/environments for modeling."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "Linux serverbeheer: Verantwoordelijkheid voor het onderhouden van een Linux-omgeving die cruciaal is voor onze AI-infrastructuur.",
                "justification": "Managing a Linux environment crucial for AI infrastructure implies operational responsibilities for the underlying systems that support AI."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH9",
                "tool_name": "Snowflake"
            },
            {
                "category_id": "TECH7",
                "tool_name": "Tableau"
            },
            {
                "category_id": "TECH3",
                "tool_name": "GenAI"
            },
            {
                "category_id": "TECH11",
                "tool_name": "Dataiku"
            },
            {
                "category_id": "TECH1",
                "tool_name": "Linux"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Je werkt nauw samen met ons data science team, de IT-afdeling en verschillende business units"
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "The role emphasizes the development and improvement of AI infrastructure and specifically mentions 'Generative AI' projects like the 'GenAI Suite' and a 'generative AI assistant'. While data engineering tasks are present, the explicit focus on generative AI models and applications strongly aligns with the GenAI Engineer profile."
    }
}