{
    "job_id": 1092,
    "job_details": {
        "job_id": 1092,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD",
        "Standplaats": "Apeldoorn",
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality",
        "Datum gevonden": "2024-08-02",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD\n\n* Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, fine-tuning, and deployment of applications built on large language models (LLMs) and other generative AI technologies. Key responsibilities include creating autonomous support platforms using LLMs, integrating state-of-the-art AI like GPT-4 Vision, and building systems that interact with users (e.g., customer support chatbots). The role also involves building and maintaining production-grade software systems and ensuring their integration and performance, aligning directly with the definition and evidence profile of a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Create and improve autonomous support platforms using LLMs' directly refers to the development and adaptation of generative models for specific applications.",
                    "phrase": "Create and improve autonomous support platforms using LLMs"
                },
                {
                    "category": "TASK4",
                    "justification": "The description mentions 'troubleshooting, maintaining, and updating tools based on user feedback and support tickets', which are core software development activities for production systems.",
                    "phrase": "troubleshooting, maintaining, and updating tools based on user feedback and support tickets"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'creating an assistant able to guide customers through an upgrade process' describes building an AI-powered application, which involves modeling and generative capabilities.",
                    "phrase": "creating an assistant able to guide customers through an upgrade process"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Test and integrate state-of-the-art AI technologies, like GPT-4 Vision' indicates working with and implementing advanced generative models.",
                    "phrase": "Test and integrate state-of-the-art AI technologies, like GPT-4 Vision"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'providing support and guidance for internal teams on how to best utilize these technologies within their workflows' shows an understanding of how AI can be applied to business processes.",
                    "phrase": "providing support and guidance for internal teams on how to best utilize these technologies within their workflows"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'Evaluate and enhance the performance and integration of AI solutions across different infrastructures' points to operational aspects of AI systems.",
                    "phrase": "Evaluate and enhance the performance and integration of AI solutions across different infrastructures"
                },
                {
                    "category": "TASK4",
                    "justification": "The mention of 'ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction' relates to the software development lifecycle and user support.",
                    "phrase": "ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'significantly boosting the company's innovation capacity and service quality' highlights the business impact and strategic alignment of the AI solutions.",
                    "phrase": "significantly boosting the company's innovation capacity and service quality"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "providing support and guidance for internal teams"
                },
                {
                    "category": "SKILL3",
                    "phrase": "troubleshooting, maintaining, and updating tools"
                },
                {
                    "category": "SKILL5",
                    "phrase": "Create and improve autonomous support platforms"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "LLMs"
                },
                {
                    "category": "TECH3",
                    "phrase": "GPT-4 Vision"
                },
                {
                    "category": "TECH2",
                    "phrase": "AWS"
                },
                {
                    "category": "TECH2",
                    "phrase": "Amazon CodeWhisperer"
                }
            ]
        }
    }
}