{
    "job_id": 1038,
    "job_details": {
        "job_id": 1038,
        "Organisatienaam": "Uber",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior Software Engineer - ML Threat Detection",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "themuse.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": "accommodations@uber.com",
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "You will drive the development and operations of security services and frameworks to support user-facing products and platforms across Uber. You are passionate and pragmatic technologists who are able to design scalable systems while delivering high-quality code. The security landscape is constantly evolving, and with the adoption of ML/GenAI backed by extensive heterogeneous data, security threats are inevitably broadened. With your deep and comprehensive expertise across major technology stacks, you will architect, implement and scale industry-leading security solutions for the entire company. You will collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind.\n\n   What the Candidate Will Need / Bonus Points\n\n     * Developing Security Solutions: designing, developing, and implementing software solutions to enhance the security posture of the organization.\n     * Threat Analysis and Detection: Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation.\n     * Code Review and Testing\n     * Research: Researching new techniques and tools to enhance the organization's cyber defense capabilities.\n     * Collaboration and Communication: Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity.",
        "Datum gevonden": "2024-12-24",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Media / Communicatie",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 12,
        "full_text": "Senior Software Engineer - ML Threat Detection\n\nYou will drive the development and operations of security services and frameworks to support user-facing products and platforms across Uber. You are passionate and pragmatic technologists who are able to design scalable systems while delivering high-quality code. The security landscape is constantly evolving, and with the adoption of ML/GenAI backed by extensive heterogeneous data, security threats are inevitably broadened. With your deep and comprehensive expertise across major technology stacks, you will architect, implement and scale industry-leading security solutions for the entire company. You will collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind.\n\n   What the Candidate Will Need / Bonus Points\n\n     * Developing Security Solutions: designing, developing, and implementing software solutions to enhance the security posture of the organization.\n     * Threat Analysis and Detection: Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation.\n     * Code Review and Testing\n     * Research: Researching new techniques and tools to enhance the organization's cyber defense capabilities.\n     * Collaboration and Communication: Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description emphasizes developing and operationalizing security services and frameworks, architecting and scaling security solutions, and a strong focus on data-driven approaches with ML/GenAI. While it mentions user-facing products, the core responsibility is building security systems, which aligns with the ML Engineer profile's focus on productionizing models and data-driven solutions, particularly in a specialized domain like security threat detection. The mention of 'ML/GenAI backed by extensive heterogeneous data' and 'predictive models' (implied by threat detection) points towards this profile over a GenAI Engineer who typically focuses on language, vision, and interaction models."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'drive the development and operations of security services and frameworks to support user-facing products and platforms' indicates building and maintaining software systems.",
                    "phrase": "drive the development and operations of security services and frameworks to support user-facing products and platforms"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'design scalable systems while delivering high-quality code' is a core software engineering responsibility.",
                    "phrase": "design scalable systems while delivering high-quality code"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The mention of 'ML/GenAI backed by extensive heterogeneous data' and 'security threats are inevitably broadened' implies the use of machine learning models for threat detection and analysis.",
                    "phrase": "ML/GenAI backed by extensive heterogeneous data"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'architect, implement and scale industry-leading security solutions' describes the development and deployment of complex software systems.",
                    "phrase": "architect, implement and scale industry-leading security solutions"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind' shows alignment with business and organizational security goals.",
                    "phrase": "collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'designing, developing, and implementing software solutions to enhance the security posture of the organization' directly relates to building software for security purposes.",
                    "phrase": "designing, developing, and implementing software solutions to enhance the security posture of the organization"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation' implies the use of analytical and potentially predictive models for threat detection.",
                    "phrase": "Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'Code Review and Testing' are standard software development practices.",
                    "phrase": "Code Review and Testing"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Researching new techniques and tools to enhance the organization's cyber defense capabilities' suggests exploring and potentially implementing new modeling approaches for security.",
                    "phrase": "Researching new techniques and tools to enhance the organization's cyber defense capabilities"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The phrase 'Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity' highlights collaboration with various teams.",
                    "phrase": "Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "passionate and pragmatic technologists"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "drive the development and operations"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "The security landscape is constantly evolving"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Collaborate with security leaders and with the broader engineering organization"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Working closely with cross-functional teams"
                }
            ],
            "technologies": []
        }
    }
}