{
    "job_id": 566,
    "job_details": {
        "job_id": 566,
        "Organisatienaam": "Stedin Netbeheer B.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Large Language Model Developer",
        "Standplaats": "Rotterdam",
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "IT projectleider (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Na een heerlijke kop koffie (of thee) start je jouw dag met een meeting met onze Delivery Lead en Lead Developer. Jullie kijken samen hoe een probleem uit het bedrijf opgelost kan worden met taalmodellen; iets waar de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie. Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden?\n\n   Lunchen doe je in het bedrijfsrestaurant op de 18e verdieping, zo geniet je van je eigen of verse lunch en van het uitzicht over heel Rotterdam. Of je loopt even de stad in voor een wandeling. Na de lunch ga je aan de slag met het technisch uitwerken van pilots of opschalingen met Azure OpenAI. Of je maakt een PoC van een ander taalmodel waarmee je in korte tijd toetst of de oplossing financieel, technisch en functioneel haalbaar is voor Stedin.\n\n   Als afsluiter heb je nog een meeting met een Architect en afdeling Security. Hier heb je het over de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is de gemaakte MVP veilig en kunnen we dit in de toekomst beter standaardiseren? Aan het eind van je werkdag sta je in een paar stappen op station Blaak, zo ben je lekker snel weer thuis.\n\n   Jouw sterke punten\n   Worden we blij van\n\n   Als onderdeel van een kleine squad ben jij een verantwoordelijk persoon die veelzijdige taken op zich kan nemen en zelfstandig uit kunt werken. LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is. Naast een dosis creativiteit zorg jij ook dat gemaakte oplossingen veilig zijn en klanten echt geholpen zijn met de eindoplossing. Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis. Je bent niet bang nieuwe ideeën uit te proberen in een PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie, terwijl je steeds scherp blijft op het doel en de randvoorwaarden. Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt.\n\nVolgens ons Stedin@Work concept werk je 50% thuis en 50% op kantoor, wel zo flexibel. Wij zorgen voor jouw thuiswerkfaciliteiten, een thuiswerkvergoeding en reizen naar kantoor doe je met je OV vrij-abonnement waarmee je ook buiten werk onbeperkt kan reizen!",
        "Datum gevonden": "2024-05-23",
        "Beroepsgroep": "Hoofden IT",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Parttime (≤ 32 uur)",
        "Branche": "Nutsvoorzieningen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 5,
        "full_text": "Large Language Model Developer\n\nNa een heerlijke kop koffie (of thee) start je jouw dag met een meeting met onze Delivery Lead en Lead Developer. Jullie kijken samen hoe een probleem uit het bedrijf opgelost kan worden met taalmodellen; iets waar de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie. Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden?\n\n   Lunchen doe je in het bedrijfsrestaurant op de 18e verdieping, zo geniet je van je eigen of verse lunch en van het uitzicht over heel Rotterdam. Of je loopt even de stad in voor een wandeling. Na de lunch ga je aan de slag met het technisch uitwerken van pilots of opschalingen met Azure OpenAI. Of je maakt een PoC van een ander taalmodel waarmee je in korte tijd toetst of de oplossing financieel, technisch en functioneel haalbaar is voor Stedin.\n\n   Als afsluiter heb je nog een meeting met een Architect en afdeling Security. Hier heb je het over de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is de gemaakte MVP veilig en kunnen we dit in de toekomst beter standaardiseren? Aan het eind van je werkdag sta je in een paar stappen op station Blaak, zo ben je lekker snel weer thuis.\n\n   Jouw sterke punten\n   Worden we blij van\n\n   Als onderdeel van een kleine squad ben jij een verantwoordelijk persoon die veelzijdige taken op zich kan nemen en zelfstandig uit kunt werken. LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is. Naast een dosis creativiteit zorg jij ook dat gemaakte oplossingen veilig zijn en klanten echt geholpen zijn met de eindoplossing. Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis. Je bent niet bang nieuwe ideeën uit te proberen in een PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie, terwijl je steeds scherp blijft op het doel en de randvoorwaarden. Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt.\n\nVolgens ons Stedin@Work concept werk je 50% thuis en 50% op kantoor, wel zo flexibel. Wij zorgen voor jouw thuiswerkfaciliteiten, een thuiswerkvergoeding en reizen naar kantoor doe je met je OV vrij-abonnement waarmee je ook buiten werk onbeperkt kan reizen!"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, fine-tuning, and deployment of applications built on large language models (LLMs), including working with Azure OpenAI and other language models for Proof of Concepts (PoCs). It also mentions building solutions that are secure and deliver tangible results in production, aligning with the core responsibilities of a GenAI Engineer. The focus on prompt engineering, evaluating feasibility, and delivering production-ready software around LLMs strongly supports this classification."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves understanding business problems and translating them into solutions using language models to improve business processes and create value for the client and operations.",
                    "phrase": "hoe een probleem uit het bedrijf opgelost kan worden met taalmodellen; iets waar de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie. Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden?"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The job explicitly mentions working with language models, developing pilots and upscaling with Azure OpenAI, and creating PoCs for other language models to test feasibility.",
                    "phrase": "het technisch uitwerken van pilots of opschalingen met Azure OpenAI. Of je maakt een PoC van een ander taalmodel"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role requires delivering long-term, well-functioning software in production, implying the development of robust applications around LLM technology.",
                    "phrase": "langdurig goed werkende software af te leveren in productie"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The description mentions ensuring the MVP is secure and how it should be integrated into the IT landscape, as well as standardizing future implementations, which touches upon operational aspects of deploying and maintaining solutions.",
                    "phrase": "hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is de gemaakte MVP veilig en kunnen we dit in de toekomst beter standaardiseren?"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "meeting met onze Delivery Lead en Lead Developer. Jullie kijken samen hoe een probleem uit het bedrijf opgelost kan worden"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "meeting met een Architect en afdeling Security. Hier heb je het over de toepasbaarheid van de gemaakte oplossing"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt."
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is."
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "Je bent niet bang nieuwe ideeën uit te proberen in een PoC"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "maar bent ook sterk in langdurig goed werkende software af te leveren in productie, terwijl je steeds scherp blijft op het doel en de randvoorwaarden."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "als onderdeel van een kleine squad ben jij een verantwoordelijk persoon die veelzijdige taken op zich kan nemen en zelfstandig uit kunt werken."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Naast een dosis creativiteit zorg jij ook dat gemaakte oplossingen veilig zijn en klanten echt geholpen zijn met de eindoplossing."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis."
                }
            ],
            "technologies": [
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "Azure OpenAI"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "taalmodellen"
                }
            ]
        }
    }
}