{
    "job_id": 147,
    "job_details": {
        "job_id": 147,
        "Organisatienaam": "ABN AMRO Bank N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Business Developer",
        "Standplaats": "Amersfoort",
        "Vacaturelink (origineel)": "abnamro.com",
        "Contactpersoon": "Justus Damman, Emma Meuter",
        "Telefoonnummer": "+31621894323",
        "E-mail": "justus.damman@florius.nl",
        "Beroep": "Business development manager (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als Business Developer Digital / business analist binnen Florius/Moneyou werk je samen met je team aan digitale oplossingen voor (onafhankelijk) hypotheekadviseurs en klanten. Denk hierbij aan Florius.nl, mijnFlorius/mijnMoneyou en de extranetten voor adviseurs van ABN AMRO, Forius en Moneyou. Je team bestaat uit 1 of 2 Digital collega's en 5 a 8 developers vanuit IT. Samen werken jullie aan innovatieve toepassingen voor Florius, Moneyou en ABN AMRO (intermediaire distributie hypotheken).\n\nBinnen Florius/Moneyou wordt gewerkt met vanuit een overall backlog, waarbij het werk door 1 van de circa 10 business / IT teams wordt opgepakt. Het team is verantwoordelijk voor de verdere invulling en realisatie van het product. Je werkt mee aan de roadmaps voor MijnFlorius/MijnMoneyou, maar ook onderdelen van de extranetten of toepassingen zoals de chatbot, de Florius apps, digitaal ondertekenen, online identificeren etc.. Het team houdt die verantwoordelijkheid ook na oplevering (\"You build it, you run it\"). Je bepaalt samen met de Team Product Owner (Digital collega) en het team jullie eigen backlog. Complexe vraagstukken (functionaliteit voor klanten en adviseurs zoals wettelijke aanpassingen in de aanvraagmodules, inloggen voor adviseurs en klanten, extra aflossen via iDeal, indienen en wijzigingen van hypotheekverzoeken) vind je uitdagend om samen met je team op te lossen. Om je werk goed te doen, moet je je zelf regelmatig verdiepen in de materie, zodat de beste oplossing\n   voor adviseur of klant kan worden gemaakt. Maar ook storingen komen direct bij het team terecht, dus moeten in worden gepast. Dit doe je in een moderne IT omgeving.\n\nWerkomgeving\n\n   Florius/Moneyou kent circa 200 directe collega's en Digital 20 a 25. Naast Digital kent Florius een Customer Experience afdeling (MarCom), Channel Management (beleid), Advies & Service (klantcontact), Intermediaire Verkoop (relatiemanagement), Customer Due Diligence en Moneyou. Je zit dus midden in de hypotheken business en je werkt zeer intensief samen met de IT-collega's die de (veelal Digital) zaken maken. Je werkt dagelijks in het agile team en samen ben je van idee tot en met realisatie en gebruik verantwoordelijk. Met je team breng je dit van \"een idee\" naar werkende functionaliteit waar adviseurs en klanten dagelijks gebruik van maken. Een deel van de werkzaamheden bevat het vertalen van wet- en regelgeving naar concrete stories die developers kunnen oppakken.\n   Je werkt binnen ABN AMRO en dus alle mogelijkheden om je als professional te ontwikkelen en daarnaast binnen Florius/Moneyou met alle mogelijkheden om je ideeën te realiseren met je team\n\nHet succes van onze organisatie staat of valt met de kwaliteit van onze mensen en de ideeen die zij hebben. Echt verrassende inzichten en innovatieve oplossingen voor onze klanten ontstaan door een samenspel van culturen, kennis en ervaring. Daarom is diversiteit voor onze organisatie ontzettend belangrijk. Om ervoor te zorgen dat alle collega's binnen ABN AMRO hun kwaliteiten kunnen ontplooien, stimuleren we een inclusieve cultuur waarin iedereen zich betrokken en gewaardeerd voelt.\n\nDisclaimerexterne recruitmentbureaus\n\n   Externe recruitmentbureaus dienen een overeenkomst met ABN AMRO BANK N.V. te hebben getekend, uitgegeven door een Talent Acquisition Specialist, om cv's te mogen indienen. Acquisitie wordt daarom niet op prijs gesteld.",
        "Datum gevonden": "2025-02-08",
        "Beroepsgroep": "Managers verkoop",
        "Beroepsklasse": "Verkoop en handel",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Financieel / Verzekeringen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Business Developer\n\nAls Business Developer Digital / business analist binnen Florius/Moneyou werk je samen met je team aan digitale oplossingen voor (onafhankelijk) hypotheekadviseurs en klanten. Denk hierbij aan Florius.nl, mijnFlorius/mijnMoneyou en de extranetten voor adviseurs van ABN AMRO, Forius en Moneyou. Je team bestaat uit 1 of 2 Digital collega's en 5 a 8 developers vanuit IT. Samen werken jullie aan innovatieve toepassingen voor Florius, Moneyou en ABN AMRO (intermediaire distributie hypotheken).\n\nBinnen Florius/Moneyou wordt gewerkt met vanuit een overall backlog, waarbij het werk door 1 van de circa 10 business / IT teams wordt opgepakt. Het team is verantwoordelijk voor de verdere invulling en realisatie van het product. Je werkt mee aan de roadmaps voor MijnFlorius/MijnMoneyou, maar ook onderdelen van de extranetten of toepassingen zoals de chatbot, de Florius apps, digitaal ondertekenen, online identificeren etc.. Het team houdt die verantwoordelijkheid ook na oplevering (\"You build it, you run it\"). Je bepaalt samen met de Team Product Owner (Digital collega) en het team jullie eigen backlog. Complexe vraagstukken (functionaliteit voor klanten en adviseurs zoals wettelijke aanpassingen in de aanvraagmodules, inloggen voor adviseurs en klanten, extra aflossen via iDeal, indienen en wijzigingen van hypotheekverzoeken) vind je uitdagend om samen met je team op te lossen. Om je werk goed te doen, moet je je zelf regelmatig verdiepen in de materie, zodat de beste oplossing\n   voor adviseur of klant kan worden gemaakt. Maar ook storingen komen direct bij het team terecht, dus moeten in worden gepast. Dit doe je in een moderne IT omgeving.\n\nWerkomgeving\n\n   Florius/Moneyou kent circa 200 directe collega's en Digital 20 a 25. Naast Digital kent Florius een Customer Experience afdeling (MarCom), Channel Management (beleid), Advies & Service (klantcontact), Intermediaire Verkoop (relatiemanagement), Customer Due Diligence en Moneyou. Je zit dus midden in de hypotheken business en je werkt zeer intensief samen met de IT-collega's die de (veelal Digital) zaken maken. Je werkt dagelijks in het agile team en samen ben je van idee tot en met realisatie en gebruik verantwoordelijk. Met je team breng je dit van \"een idee\" naar werkende functionaliteit waar adviseurs en klanten dagelijks gebruik van maken. Een deel van de werkzaamheden bevat het vertalen van wet- en regelgeving naar concrete stories die developers kunnen oppakken.\n   Je werkt binnen ABN AMRO en dus alle mogelijkheden om je als professional te ontwikkelen en daarnaast binnen Florius/Moneyou met alle mogelijkheden om je ideeën te realiseren met je team\n\nHet succes van onze organisatie staat of valt met de kwaliteit van onze mensen en de ideeen die zij hebben. Echt verrassende inzichten en innovatieve oplossingen voor onze klanten ontstaan door een samenspel van culturen, kennis en ervaring. Daarom is diversiteit voor onze organisatie ontzettend belangrijk. Om ervoor te zorgen dat alle collega's binnen ABN AMRO hun kwaliteiten kunnen ontplooien, stimuleren we een inclusieve cultuur waarin iedereen zich betrokken en gewaardeerd voelt.\n\nDisclaimerexterne recruitmentbureaus\n\n   Externe recruitmentbureaus dienen een overeenkomst met ABN AMRO BANK N.V. te hebben getekend, uitgegeven door een Talent Acquisition Specialist, om cv's te mogen indienen. Acquisitie wordt daarom niet op prijs gesteld."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on business development and analysis within the financial/mortgage sector, involving digital solutions and collaboration with IT teams. While it mentions digital applications like chatbots and online identification, it does not detail the development, fine-tuning, or deployment of AI models or generative technologies. The core responsibilities are centered around understanding business needs, translating requirements, and managing product roadmaps, rather than specialized AI engineering tasks. Therefore, it falls under the 'Ambiguous' category as it's primarily a business-focused role with some digital aspects, but not a core AI engineering position."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves working with digital solutions for mortgage advisors and customers, contributing to roadmaps, and translating legal and regulatory requirements into actionable stories for developers. This demonstrates a need to understand the business context and translate business needs into technical requirements.",
                    "phrase": "Als Business Developer Digital / business analist binnen Florius/Moneyou werk je samen met je team aan digitale oplossingen voor (onafhankelijk) hypotheekadviseurs en klanten."
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The description mentions working on complex functional issues for customers and advisors, such as legal adjustments in application modules, login functionalities, and mortgage request submissions. This requires understanding business needs and challenges.",
                    "phrase": "Complexe vraagstukken (functionaliteit voor klanten en adviseurs zoals wettelijke aanpassingen in de aanvraagmodules, inloggen voor adviseurs en klanten, extra aflossen via iDeal, indienen en wijzigingen van hypotheekverzoeken) vind je uitdagend om samen met je team op te lossen."
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role requires translating legal and regulatory frameworks into concrete stories that developers can implement, which is a key aspect of understanding business and regulatory requirements.",
                    "phrase": "Een deel van de werkzaamheden bevat het vertalen van wet- en regelgeving naar concrete stories die developers kunnen oppakken."
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves working on digital solutions and applications like chatbots, apps, and digital signing, which are user-facing software systems. The team is responsible for the realization and use of these products.",
                    "phrase": "Je werkt mee aan de roadmaps voor MijnFlorius/MijnMoneyou, maar ook onderdelen van de extranetten of toepassingen zoals de chatbot, de Florius apps, digitaal ondertekenen, online identificeren etc."
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'You build it, you run it' indicates a responsibility for the operational aspects of the products after they are delivered, which aligns with the principles of MLOps.",
                    "phrase": "Het team houdt die verantwoordelijkheid ook na oplevering ('You build it, you run it')."
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The description states that the team directly receives and addresses issues and malfunctions, which is part of the operational responsibility for running systems.",
                    "phrase": "Maar ook storingen komen direct bij het team terecht, dus moeten in worden gepast."
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The role emphasizes working together with a team of Digital colleagues and developers, as well as collaborating intensively with IT colleagues.",
                    "phrase": "Je team bestaat uit 1 of 2 Digital collega's en 5 a 8 developers vanuit IT. Samen werken jullie aan innovatieve toepassingen..."
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The job description highlights working daily in an agile team and being jointly responsible from idea to realization and use, implying close collaboration.",
                    "phrase": "Je werkt dagelijks in het agile team en samen ben je van idee tot en met realisatie en gebruik verantwoordelijk."
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "The text states that to do the job well, one must regularly delve into the subject matter to create the best solution, indicating a need for continuous learning and adaptation.",
                    "phrase": "Om je werk goed te doen, moet je je zelf regelmatig verdiepen in de materie, zodat de beste oplossing voor adviseur of klant kan worden gemaakt."
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "justification": "The role involves tackling complex functional issues and finding solutions collaboratively with the team, which requires problem-solving skills.",
                    "phrase": "Complexe vraagstukken (functionaliteit voor klanten en adviseurs zoals wettelijke aanpassingen in de aanvraagmodules, inloggen voor adviseurs en klanten, extra aflossen via iDeal, indienen en wijzigingen van hypotheekverzoeken) vind je uitdagend om samen met je team op te lossen."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "The description mentions working on innovative applications and realizing ideas with the team, suggesting a drive for innovation and taking ownership of the product's lifecycle.",
                    "phrase": "Samen werken jullie aan innovatieve toepassingen voor Florius, Moneyou en ABN AMRO (intermediaire distributie hypotheken)."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "The 'You build it, you run it' principle implies taking full ownership of the product's development and maintenance.",
                    "phrase": "Het team houdt die verantwoordelijkheid ook na oplevering ('You build it, you run it')."
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "samen met je team aan digitale oplossingen"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Samen werken jullie aan innovatieve toepassingen"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "je werkt zeer intensief samen met de IT-collega's"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Je werkt dagelijks in het agile team en samen ben je van idee tot en met realisatie en gebruik verantwoordelijk."
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Om je werk goed te doen, moet je je zelf regelmatig verdiepen in de materie"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "Complexe vraagstukken ... vind je uitdagend om samen met je team op te lossen."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "innovatieve toepassingen"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "realiseren met je team"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "'You build it, you run it'"
                }
            ],
            "technologies": [
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "chatbot"
                }
            ]
        }
    }
}