{
    "job_id": 1126,
    "job_details": {
        "job_id": 1126,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Application Support Engineer, Trilogy (Remote) - $60,000/year USD",
        "Standplaats": "Den Haag",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Helpdeskmedewerker informatietechnologie (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* AI-Augmented Customer Resolutions: Analyze complex tickets escalated by AI systems, apply human expertise to areas where AI falls short, and then close the gap by improving the AI system\n     * AI Training and Improvement: Review AI-generated solutions and provide detailed feedback and participate in AI model fine-tuning sessions\n     * Cutting-Edge AI Integration: Prototype and test new AI tools and methodologies\n\n   What you will NOT be doing\n\n     * Taking two whole months to get up to speed; you will be expected to ramp up one several products within the first month (we are aware this is aggressive)\n     * Relying on your managers for help; if you are not adept at unblocking yourself, you will likely struggle in this role, * Integrate technical human expertise and AI capabilities to deliver exceptional customer support, focusing on complex issues that AI cannot yet fully resolve",
        "Datum gevonden": "2024-07-19",
        "Beroepsgroep": "Supportmedewerkers",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 7,
        "full_text": "Application Support Engineer, Trilogy (Remote) - $60,000/year USD\n\n* AI-Augmented Customer Resolutions: Analyze complex tickets escalated by AI systems, apply human expertise to areas where AI falls short, and then close the gap by improving the AI system\n     * AI Training and Improvement: Review AI-generated solutions and provide detailed feedback and participate in AI model fine-tuning sessions\n     * Cutting-Edge AI Integration: Prototype and test new AI tools and methodologies\n\n   What you will NOT be doing\n\n     * Taking two whole months to get up to speed; you will be expected to ramp up one several products within the first month (we are aware this is aggressive)\n     * Relying on your managers for help; if you are not adept at unblocking yourself, you will likely struggle in this role, * Integrate technical human expertise and AI capabilities to deliver exceptional customer support, focusing on complex issues that AI cannot yet fully resolve"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on supporting and improving existing AI systems by analyzing escalated tickets and providing feedback for fine-tuning. While it involves interacting with AI and improving its performance, it does not involve the core development, research, or deployment of AI models or applications from scratch. The primary focus is on customer support and enhancing AI capabilities through human oversight and feedback, rather than building AI-driven products or solutions. This aligns more with using AI tools to enhance productivity in a support role rather than being a core AI development role."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'participate in AI model fine-tuning sessions' directly relates to adapting or improving machine learning models.",
                    "phrase": "participate in AI model fine-tuning sessions"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'Prototype and test new AI tools and methodologies' involves developing and evaluating new technical approaches, which falls under software development in the context of integrating AI.",
                    "phrase": "Prototype and test new AI tools and methodologies"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'Integrate technical human expertise and AI capabilities to deliver exceptional customer support' implies building or enhancing systems that combine human and AI elements for a specific function, which is a form of software development.",
                    "phrase": "Integrate technical human expertise and AI capabilities to deliver exceptional customer support"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'improving the AI system' suggests a direct involvement in enhancing the performance or capabilities of an AI model or system.",
                    "phrase": "improving the AI system"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'Analyze complex tickets escalated by AI systems' indicates understanding and working within the context of customer issues and how AI is applied to them, which relates to business understanding in a support context.",
                    "phrase": "Analyze complex tickets escalated by AI systems"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'Review AI-generated solutions and provide detailed feedback' involves understanding the output of AI in relation to customer needs and providing input for improvement, linking to business understanding and quality assurance.",
                    "phrase": "Review AI-generated solutions and provide detailed feedback"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2",
                    "phrase": "ramp up one several products within the first month"
                },
                {
                    "category": "SKILL3",
                    "phrase": "adept at unblocking yourself"
                },
                {
                    "category": "SKILL5",
                    "phrase": "unblocking yourself"
                }
            ],
            "technologies": []
        }
    }
}