{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "fungereer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers.",
                "justification": "This phrase highlights the role of connecting business domain experts with the AI development team, indicating an understanding of business needs."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "signaleer je kansen voor het inzetten van AI, breng je vragen en wensen in kaart en analyseer je processen.",
                "justification": "This describes identifying opportunities, understanding needs, and analyzing processes, all core to business understanding in a technical context."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "met technieken als Retrieval Augmented Generation (RAG) en Agentic Frameworks.",
                "justification": "RAG and Agentic Frameworks are specific techniques used in building and fine-tuning generative AI models."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "zet je vervolgens om in passende AI-applicaties",
                "justification": "This indicates the conversion of findings into functional AI applications, which is a software development task."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "full stack AI developer",
                "justification": "The title itself implies a broad range of software development responsibilities, covering both front-end and back-end aspects of AI applications."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "beschik jij over actuele kennis en kunde van zowel front end als back end.",
                "justification": "Explicitly states the requirement for both front-end and back-end development skills."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "generatieve AI"
            },
            {
                "category_id": "TECH3",
                "tool_name": "Retrieval Augmented Generation (RAG)"
            },
            {
                "category_id": "TECH4",
                "tool_name": "Agentic Frameworks"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end. En ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI."
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "fungereer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers."
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "analyseer je processen. Deze bevindingen zet je vervolgens om in passende AI-applicaties"
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "En ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "optimaal willen benutten."
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 5,
        "rationale": "The job explicitly mentions 'generatieve AI', 'Retrieval Augmented Generation (RAG)', and 'Agentic Frameworks', which are core to the GenAI Engineer profile. The emphasis on building 'AI-applicaties' using these techniques, along with full-stack development skills, strongly aligns with the definition of a GenAI Engineer."
    }
}