{
    "job_id": 607,
    "job_details": {
        "job_id": 607,
        "Organisatienaam": "Alliander",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Engineer",
        "Standplaats": "Arnhem",
        "Vacaturelink (origineel)": "alliander.com",
        "Contactpersoon": "Sandra Jokhan, Bram van der Linde",
        "Telefoonnummer": "+31642329903+31642329903",
        "E-mail": "bram.van.der.linde@alliander.com,sandra.jokhan@alliander.com",
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Je zorgt voor de ontwikkeling, integratie en uitrol van LLM agents die kennisdeling tussen teams versnellen en de automatisering van dagelijkse werkprocessen mogelijk maakt. Daarnaast ondersteun je andere teams met ons MLOps platform om ML modellen te creëren en deployen, waarbij je een scherp oog houdt op cloud en MLOps best practices. Bovendien speel je een actieve rol in het vergroten van de AI-vaardigheden van jezelf, jouw teamleden en collega's, door het volgen en delen van de laatste ontwikkelingen in het veld. Ten slotte draag jij samen met je team de operationele verantwoordelijkheid voor onze tools en diensten.\n\n   Als team bieden wij twee producten aan: Voltix Assistant en Voltix MLOps platform. Het Voltix Assistant product gaat voorzien in een vlotte gestandaardiseerde uitrol van LLM agents voor allerlei interne use cases. De hoofdmoot van deze use cases zal focussen op het gemakkelijk vindbaar maken van de juiste kennis in onze grote organisatie. Met het Voltix MLOps platform helpen wij andere teams snel en juist op weg door middel van een gestandaardiseerde AWS cloud omgeving, zowel voor het ontwikkelen, testen en uitrollen van ML modellen, maar ook voor het uitvoeren van data-analyses. Wij maken dus zelf geen modellen, we zijn een platform team.\n\n   Het energienet van de toekomst maken we voor iedereen, mét iedereen. En als AI Engineer werk jij hieraan mee. Zo ben jij bezig met het:\n     * Vertalen van LLM-use cases naar technische oplossingen en standaardoplossingen voor meerdere use cases waar mogelijk.\n     * Implementeren, uitrollen en beheren van LLM-agents, met een voorkeur voor bestaande frameworks en LLM-modellen.\n     * Integreren van interne databronnen (zoals SharePoint en Confluence) als kennisbasis voor de LLM-agents.\n     * Inbouwen van LLM-agents in eindgebruikertools, zoals Microsoft Teams.\n     * Onderhouden van het MLOps-platform op AWS, voor veilige en gecontroleerde levering van ML-modellen door data science teams.",
        "Datum gevonden": "2024-11-05",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Nutsvoorzieningen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 11,
        "full_text": "AI Engineer\n\nJe zorgt voor de ontwikkeling, integratie en uitrol van LLM agents die kennisdeling tussen teams versnellen en de automatisering van dagelijkse werkprocessen mogelijk maakt. Daarnaast ondersteun je andere teams met ons MLOps platform om ML modellen te creëren en deployen, waarbij je een scherp oog houdt op cloud en MLOps best practices. Bovendien speel je een actieve rol in het vergroten van de AI-vaardigheden van jezelf, jouw teamleden en collega's, door het volgen en delen van de laatste ontwikkelingen in het veld. Ten slotte draag jij samen met je team de operationele verantwoordelijkheid voor onze tools en diensten.\n\n   Als team bieden wij twee producten aan: Voltix Assistant en Voltix MLOps platform. Het Voltix Assistant product gaat voorzien in een vlotte gestandaardiseerde uitrol van LLM agents voor allerlei interne use cases. De hoofdmoot van deze use cases zal focussen op het gemakkelijk vindbaar maken van de juiste kennis in onze grote organisatie. Met het Voltix MLOps platform helpen wij andere teams snel en juist op weg door middel van een gestandaardiseerde AWS cloud omgeving, zowel voor het ontwikkelen, testen en uitrollen van ML modellen, maar ook voor het uitvoeren van data-analyses. Wij maken dus zelf geen modellen, we zijn een platform team.\n\n   Het energienet van de toekomst maken we voor iedereen, mét iedereen. En als AI Engineer werk jij hieraan mee. Zo ben jij bezig met het:\n     * Vertalen van LLM-use cases naar technische oplossingen en standaardoplossingen voor meerdere use cases waar mogelijk.\n     * Implementeren, uitrollen en beheren van LLM-agents, met een voorkeur voor bestaande frameworks en LLM-modellen.\n     * Integreren van interne databronnen (zoals SharePoint en Confluence) als kennisbasis voor de LLM-agents.\n     * Inbouwen van LLM-agents in eindgebruikertools, zoals Microsoft Teams.\n     * Onderhouden van het MLOps-platform op AWS, voor veilige en gecontroleerde levering van ML-modellen door data science teams."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, integration, and deployment of LLM agents, building RAG systems by integrating internal data sources, and embedding these agents into end-user tools like Microsoft Teams. It also mentions supporting other teams with an MLOps platform for ML model deployment, but explicitly states 'we don't build models ourselves, we are a platform team'. This focus on generative AI applications and agent development, supported by MLOps and software development for user-facing tools, aligns directly with the GenAI Engineer profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The role involves implementing, deploying, and managing LLM agents, with a preference for existing frameworks and LLM models, and integrating internal data sources as knowledge bases for these agents. This directly relates to working with and adapting generative models.",
                    "phrase": "Implementeren, uitrollen en beheren van LLM-agents, met een voorkeur voor bestaande frameworks en LLM-modellen."
                },
                {
                    "category": "TASK3",
                    "justification": "The role involves integrating internal data sources like SharePoint and Confluence to serve as knowledge bases for LLM agents, which is a core component of building RAG systems.",
                    "phrase": "Integreren van interne databronnen (zoals SharePoint en Confluence) als kennisbasis voor de LLM-agents."
                },
                {
                    "category": "TASK4",
                    "justification": "The role requires embedding LLM agents into end-user tools such as Microsoft Teams, which involves traditional software development to integrate AI capabilities into user-facing applications.",
                    "phrase": "Inbouwen van LLM-agents in eindgebruikertools, zoals Microsoft Teams."
                },
                {
                    "category": "TASK5",
                    "justification": "The job involves maintaining an MLOps platform on AWS for the secure and controlled delivery of ML models by data science teams, which is a direct application of Operations Engineering in an AI context.",
                    "phrase": "Onderhouden van het MLOps-platform op AWS, voor veilige en gecontroleerde levering van ML-modellen door data science teams."
                },
                {
                    "category": "TASK1",
                    "justification": "The role involves translating LLM use cases into technical solutions and standard solutions where possible, indicating an understanding of business needs and translating them into technical requirements.",
                    "phrase": "Vertalen van LLM-use cases naar technische oplossingen en standaardoplossingen voor meerdere use cases waar mogelijk."
                },
                {
                    "category": "TASK5",
                    "justification": "The team shares operational responsibility for their tools and services, which includes the MLOps platform and LLM agents, indicating a focus on production-grade systems.",
                    "phrase": "Draag jij samen met je team de operationele verantwoordelijkheid voor onze tools en diensten."
                },
                {
                    "category": "TASK2",
                    "justification": "The role supports other teams with their MLOps platform to create and deploy ML models, and mentions a standardized AWS cloud environment for developing, testing, and deploying ML models, as well as for data analysis. While the team doesn't build models themselves, they provide the infrastructure for data processing and model deployment.",
                    "phrase": "Ondersteun je andere teams met ons MLOps platform om ML modellen te creëren en deployen, waarbij je een scherp oog houdt op cloud en MLOps best practices."
                },
                {
                    "category": "TASK1",
                    "justification": "The role involves accelerating knowledge sharing between teams and enabling the automation of daily work processes through LLM agents, demonstrating an understanding of business needs and how AI can address them.",
                    "phrase": "Je zorgt voor de ontwikkeling, integratie en uitrol van LLM agents die kennisdeling tussen teams versnellen en de automatisering van dagelijkse werkprocessen mogelijk maakt."
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2",
                    "phrase": "Bovendien speel je een actieve rol in het vergroten van de AI-vaardigheden van jezelf, jouw teamleden en collega's, door het volgen en delen van de laatste ontwikkelingen in het veld."
                },
                {
                    "category": "SKILL5",
                    "phrase": "Ten slotte draag jij samen met je team de operationele verantwoordelijkheid voor onze tools en diensten."
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "LLM"
                },
                {
                    "category": "TECH4",
                    "phrase": "frameworks"
                },
                {
                    "category": "TECH2",
                    "phrase": "AWS"
                },
                {
                    "category": "TECH6",
                    "phrase": "MLOps"
                },
                {
                    "category": "TECH9",
                    "phrase": "SharePoint"
                },
                {
                    "category": "TECH9",
                    "phrase": "Confluence"
                },
                {
                    "category": "TECH1",
                    "phrase": "Microsoft Teams"
                }
            ]
        }
    }
}