{
    "job_id": 103,
    "job_details": {
        "job_id": 103,
        "Organisatienaam": "Tilburg University",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Research software engineer",
        "Standplaats": "Tilburg",
        "Vacaturelink (origineel)": "tilburguniversity.edu",
        "Contactpersoon": "Emiel Krahmer",
        "Telefoonnummer": null,
        "E-mail": "E.J.Krahmer@tilburguniversity.edu",
        "Beroep": "R&D IT engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "This is a new and structural position offered within the Department of Communication and Cognition at Tilburg University. It is funded by the Sectorplan Social Sciences and Humanities and partly associated with a recent NWO-KIC grant. The successful candidate will divide their time primarily between these two domains.\n\n   In the Department of Communication and Cognition, we increasingly rely on computational methods, for example, to collect and analyze data, but also to develop new digital applications which can be used for research purposes. The research software engineer will offer support to researchers, PhD candidates and (research master) students by developing, maintaining, and/or customizing new and existing tools for research purposes. Since this is a new function, we anticipate that the successful candidate will help set-up a digital support structure for the department, maintaining an overview of available tools, and offering small-scale programming support for individual researchers.\n\n   In the NWO-KIC project, we will develop a digital self-management platform that aims to help people with, for example, a history of depression to better monitor their own well-being, in order to prevent relapse. The platform to be developed will rest upon an existing experience sampling method (an app which asks participants repeatedly to briefly report on, for example, their thoughts, activities, and emotions on various moments during the day) and we will explore to what extent other sources of information can be integrated in this platform as well. The research software engineer will spend half of their time supporting the development and implementation of this platform.\n\n   In short, the main tasks of the successful candidate will be offering computational support to researchers with their research, helping to manage the computational research infrastructure of the department, offering support in the education of technical skills, such as programming or (automated) data collection and annotation, and collaborating with researchers within the NWO-KIC project for the technical development of a self-management platform for people with severe mental illness.",
        "Datum gevonden": "2023-11-10",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Tijdelijk contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Onderwijs / Onderzoek",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2023,
        "Maand (van datum gevonden)": 11,
        "full_text": "Research software engineer\n\nThis is a new and structural position offered within the Department of Communication and Cognition at Tilburg University. It is funded by the Sectorplan Social Sciences and Humanities and partly associated with a recent NWO-KIC grant. The successful candidate will divide their time primarily between these two domains.\n\n   In the Department of Communication and Cognition, we increasingly rely on computational methods, for example, to collect and analyze data, but also to develop new digital applications which can be used for research purposes. The research software engineer will offer support to researchers, PhD candidates and (research master) students by developing, maintaining, and/or customizing new and existing tools for research purposes. Since this is a new function, we anticipate that the successful candidate will help set-up a digital support structure for the department, maintaining an overview of available tools, and offering small-scale programming support for individual researchers.\n\n   In the NWO-KIC project, we will develop a digital self-management platform that aims to help people with, for example, a history of depression to better monitor their own well-being, in order to prevent relapse. The platform to be developed will rest upon an existing experience sampling method (an app which asks participants repeatedly to briefly report on, for example, their thoughts, activities, and emotions on various moments during the day) and we will explore to what extent other sources of information can be integrated in this platform as well. The research software engineer will spend half of their time supporting the development and implementation of this platform.\n\n   In short, the main tasks of the successful candidate will be offering computational support to researchers with their research, helping to manage the computational research infrastructure of the department, offering support in the education of technical skills, such as programming or (automated) data collection and annotation, and collaborating with researchers within the NWO-KIC project for the technical development of a self-management platform for people with severe mental illness."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on supporting researchers with computational methods, developing research tools, and contributing to a specific project involving a digital self-management platform. While it mentions computational support, data collection, analysis, and programming, it lacks specific details about advanced AI/ML model development, fine-tuning, or the core responsibilities of an ML or GenAI Engineer as defined in the coding book. The role appears to be more of a general research software engineer or computational support specialist rather than a specialized AI/ML role."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves supporting researchers and PhD candidates, understanding their research needs, and aligning computational solutions with departmental and project goals, such as the NWO-KIC project for a self-management platform.",
                    "phrase": "offer support to researchers, PhD candidates and (research master) students by developing, maintaining, and/or customizing new and existing tools for research purposes"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role is associated with specific funding (Sectorplan Social Sciences and Humanities, NWO-KIC grant) and departmental research goals, requiring an understanding of these contexts.",
                    "phrase": "funded by the Sectorplan Social Sciences and Humanities and partly associated with a recent NWO-KIC grant."
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The description mentions the need to collect and analyze data, which are fundamental aspects of data engineering.",
                    "phrase": "for example, to collect and analyze data"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The role involves supporting researchers in automated data collection, a key data engineering task.",
                    "phrase": "offering support in the education of technical skills, such as programming or (automated) data collection and annotation"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves developing, maintaining, and customizing new and existing tools for research purposes, which falls under software development.",
                    "phrase": "developing, maintaining, and/or customizing new and existing tools for research purposes"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role requires supporting the technical development of a digital self-management platform, including implementation, which is a software development task.",
                    "phrase": "collaborating with researchers within the NWO-KIC project for the technical development of a self-management platform"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves developing new digital applications for research purposes.",
                    "phrase": "develop new digital applications which can be used for research purposes"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The role includes helping to manage the computational research infrastructure of the department, which aligns with operational aspects of managing technical resources.",
                    "phrase": "helping to manage the computational research infrastructure of the department"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The role involves setting up a digital support structure and maintaining an overview of available tools, which are organizational and operational tasks related to infrastructure.",
                    "phrase": "help set-up a digital support structure for the department, maintaining an overview of available tools"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborating with researchers"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "offering support to researchers"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "new function"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "developing new digital applications which can be used for research purposes"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "developing, maintaining, and/or customizing new and existing tools for research purposes"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "help set-up a digital support structure for the department"
                }
            ],
            "technologies": [
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "programming"
                }
            ]
        }
    }
}