{
    "job_id": 182,
    "job_details": {
        "job_id": 182,
        "Organisatienaam": "Centric",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Backend Developer",
        "Standplaats": "Veghel",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Backend developer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "You will join the new Generative AI team in the Digital Service Platform at Vanderlande, where you'll shape the future of logistics by harnessing the power of AI. Your mission will be to architect and develop a scalable, agentic AI product suite designed to optimize service interactions, enhancing both the efficiency and profitability of Vanderlande's service business. Initially, you'll lead the architecture and development of a RAG (Retrieval-Augmented Generation) agent, focusing on ADAPTO and predictive maintenance. You will use managed services (from Azure and Databricks) to quickly deliver a solution that can be validated and tested with key users and customers. The scope will soon expand to include agents focused on providing analysis of local operational data, generated from ADAPTO.\n       You will leverage our existing data management platform, insights product and other services from Databricks and Azure to quickly deliver a solution that can be validated and tested with key users and customers. Further down the line, the focus will shift towards building a multi-agent system which will leverage global operational and corporate data and documents to provide simple conclusions on ADAPTO service tickets. This solution should be able to eventually scale towards providing proactive issue identification and resolution recommendations.\n       Responsibilities:\n          + Collaborate with a cross-functional team of experts to define, design, architect and build a generative AI framework that can be expanded and scaled towards an agentic AI solution.\n          + Build backend services supporting a generative AI solution, initially focusing on RAG.\n          + Collaborate with Data scientists and front-end engineers in developing effective contracts, APIs and services.\n          + Design and implement microservices architecture leveraging Azure cloud and the Databricks platform.\n          + Develop and maintain infrastructure as code (IaC) using Terraform.\n          + Use Jira to track and manage development tasks and project progress.\n          + Ensure that the developed software meets high quality standards by implementing unit, component, and integration tests. Qualifications",
        "Datum gevonden": "2025-02-17",
        "Beroepsgroep": "Web Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "ICT",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Backend Developer\n\nYou will join the new Generative AI team in the Digital Service Platform at Vanderlande, where you'll shape the future of logistics by harnessing the power of AI. Your mission will be to architect and develop a scalable, agentic AI product suite designed to optimize service interactions, enhancing both the efficiency and profitability of Vanderlande's service business. Initially, you'll lead the architecture and development of a RAG (Retrieval-Augmented Generation) agent, focusing on ADAPTO and predictive maintenance. You will use managed services (from Azure and Databricks) to quickly deliver a solution that can be validated and tested with key users and customers. The scope will soon expand to include agents focused on providing analysis of local operational data, generated from ADAPTO.\n       You will leverage our existing data management platform, insights product and other services from Databricks and Azure to quickly deliver a solution that can be validated and tested with key users and customers. Further down the line, the focus will shift towards building a multi-agent system which will leverage global operational and corporate data and documents to provide simple conclusions on ADAPTO service tickets. This solution should be able to eventually scale towards providing proactive issue identification and resolution recommendations.\n       Responsibilities:\n          + Collaborate with a cross-functional team of experts to define, design, architect and build a generative AI framework that can be expanded and scaled towards an agentic AI solution.\n          + Build backend services supporting a generative AI solution, initially focusing on RAG.\n          + Collaborate with Data scientists and front-end engineers in developing effective contracts, APIs and services.\n          + Design and implement microservices architecture leveraging Azure cloud and the Databricks platform.\n          + Develop and maintain infrastructure as code (IaC) using Terraform.\n          + Use Jira to track and manage development tasks and project progress.\n          + Ensure that the developed software meets high quality standards by implementing unit, component, and integration tests. Qualifications"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development of generative AI solutions, specifically mentioning RAG systems, agentic AI product suites, and multi-agent systems. It requires building backend services to support these GenAI features, integrating with cloud platforms (Azure, Databricks), and developing APIs. While it involves software development and MLOps, the core focus is on leveraging and building around generative models, aligning perfectly with the GenAI Engineer profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The role involves architecting and developing a RAG (Retrieval-Augmented Generation) agent and later expanding to multi-agent systems, which are core modeling tasks in generative AI.",
                    "phrase": "architect and develop a scalable, agentic AI product suite"
                },
                {
                    "category": "TASK3",
                    "justification": "The description explicitly mentions building a RAG agent as an initial focus, which is a key generative AI modeling technique.",
                    "phrase": "architecture and development of a RAG (Retrieval-Augmented Generation) agent"
                },
                {
                    "category": "TASK3",
                    "justification": "The role involves building agents that provide analysis of operational data using generative AI.",
                    "phrase": "agents focused on providing analysis of local operational data"
                },
                {
                    "category": "TASK3",
                    "justification": "The future scope includes building a multi-agent system to derive conclusions from data, a generative AI modeling task.",
                    "phrase": "building a multi-agent system"
                },
                {
                    "category": "TASK4",
                    "justification": "The role requires building backend services that support generative AI solutions, which is a core software development responsibility.",
                    "phrase": "Build backend services supporting a generative AI solution"
                },
                {
                    "category": "TASK4",
                    "justification": "The job involves designing and implementing microservices architecture, a fundamental software development practice.",
                    "phrase": "Design and implement microservices architecture"
                },
                {
                    "category": "TASK4",
                    "justification": "Developing and maintaining infrastructure as code (IaC) is a software development practice for managing infrastructure.",
                    "phrase": "Develop and maintain infrastructure as code (IaC)"
                },
                {
                    "category": "TASK4",
                    "justification": "Ensuring software quality through testing is a standard software development practice.",
                    "phrase": "implementing unit, component, and integration tests"
                },
                {
                    "category": "TASK5",
                    "justification": "The role involves leveraging cloud services (Azure, Databricks) for quick delivery and validation, which is part of deploying and managing AI solutions.",
                    "phrase": "use managed services (from Azure and Databricks) to quickly deliver a solution"
                },
                {
                    "category": "TASK5",
                    "justification": "The need to scale solutions and provide proactive issue identification and resolution recommendations implies operational considerations for production systems.",
                    "phrase": "scale towards providing proactive issue identification and resolution recommendations"
                },
                {
                    "category": "TASK1",
                    "justification": "The role requires collaborating with a cross-functional team to define and architect a generative AI framework, indicating an understanding of business needs and technical alignment.",
                    "phrase": "Collaborate with a cross-functional team of experts to define, design, architect and build a generative AI framework"
                },
                {
                    "category": "TASK4",
                    "justification": "Collaborating with Data scientists and front-end engineers to develop APIs and services is a software development task focused on integration.",
                    "phrase": "Collaborate with Data scientists and front-end engineers in developing effective contracts, APIs and services."
                },
                {
                    "category": "TASK5",
                    "justification": "Using Jira to track development tasks and project progress is a common practice in operations engineering and project management for software development.",
                    "phrase": "Use Jira to track and manage development tasks and project progress."
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "Collaborate with a cross-functional team of experts"
                },
                {
                    "category": "SKILL1",
                    "phrase": "Collaborate with Data scientists and front-end engineers"
                },
                {
                    "category": "SKILL5",
                    "phrase": "shape the future of logistics by harnessing the power of AI"
                },
                {
                    "category": "SKILL5",
                    "phrase": "lead the architecture and development"
                },
                {
                    "category": "SKILL3",
                    "phrase": "optimize service interactions"
                },
                {
                    "category": "SKILL3",
                    "phrase": "proactive issue identification and resolution recommendations"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "Generative AI"
                },
                {
                    "category": "TECH3",
                    "phrase": "RAG (Retrieval-Augmented Generation)"
                },
                {
                    "category": "TECH3",
                    "phrase": "agentic AI"
                },
                {
                    "category": "TECH2",
                    "phrase": "Azure"
                },
                {
                    "category": "TECH2",
                    "phrase": "Databricks"
                },
                {
                    "category": "TECH4",
                    "phrase": "LangChain"
                },
                {
                    "category": "TECH6",
                    "phrase": "Terraform"
                }
            ]
        }
    }
}