{
    "job_id": 163,
    "job_details": {
        "job_id": 163,
        "Organisatienaam": "All About Work",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "Lead Developer Generative AI",
        "Standplaats": "Rotterdam",
        "Vacaturelink (origineel)": "jobbird.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Lead developer (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Door de energietransitie neemt ons werk ontzettend toe. Daarom zijn we ons werk aan het verslimmen met behulp van AI, zodat we samen werk kunnen maken van een leefwereld vol nieuwe energie. Jij kan hier aan bijdrage als nieuwe Lead Developer collega. Als Lead Developer werk je in het functie team Generative AI naast het Digitale Innovatie team van Stedin. Dit team is speciaal opgericht om met volle focus de kansen en mogelijkheden van Generative AI uit te gaan nutten, want de mogelijkheden blijken eindeloos en de vraag uit het bedrijf is enorm.\n\nNa een heerlijke kop koffie (of thee) die je in gebarentaal bij onze 'gebarista' (slechthorende barista) hebt besteld, start je jouw dag met de stand up van het Generative AI team, hierin vertel je huidige stand van zaken in de ontwikkeling van de laatste features. Daarna heb je een meeting met de Product Owner en de interne stakeholders. Jullie kijken samen hoe een probleem uit het bedrijf opgelost kan worden met de nieuwste taalmodellen; iets waar de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie. Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?\n\n   Lunchen doe je in het bedrijfsrestaurant op de 18e verdieping, zo geniet je van je eigen of verse lunch en van het uitzicht over heel Rotterdam. Of je loopt even de stad in voor een wandeling. Na de lunch ga je aan de slag met het technisch uitwerken van een nieuwe feature voor StedinGPT, onze interne versie van ChatGPT.\n\n   Als afsluiter heb je nog een meeting met een architect en afdeling security. Hier heb je het over de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is het plan voor de aankomende features veilig en kunnen we dit in de toekomst beter standaardiseren? Aan het eind van je werkdag sta je in een paar stappen op station Blaak, zo ben je lekker snel weer thuis.\n\nAls onderdeel van een snel groeiend team ben jij een verantwoordelijk persoon die veelzijdige taken op zich kan nemen en duidelijk knopen kan doorhakken op technische keuzes. LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is. Naast een dosis creativiteit zorg jij ook dat gemaakte oplossingen veilig zijn en klanten echt geholpen zijn met de eindoplossing. Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis. Je bent niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie, terwijl je steeds scherp blijft op het doel en de randvoorwaarden. Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt. Wat jou verder onze nieuwe Lead Developer maakt?\n\nVanaf dag één werk je in het Generative AI team. Dit team opereert als een DevOps team binnen een groot bedrijf en bestaat uit gedreven en enthousiaste developers, die op zoek zijn samen met de Product Owner naar het toevoegen van waarde d.m.v. Generative AI. Dit snel groeiende team is in staat om snel nieuwe ideeën om te zetten in realiteit binnen de complexe context van de netbeheerder, bijvoorbeeld door het uitvoeren van kleinschalige MVP's, maar ook het naar productie brengen van Generative AI binnen het IT landschap van Stedin.",
        "Datum gevonden": "2025-02-06",
        "Beroepsgroep": "Coördinatoren IT",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Lead Developer Generative AI\n\nDoor de energietransitie neemt ons werk ontzettend toe. Daarom zijn we ons werk aan het verslimmen met behulp van AI, zodat we samen werk kunnen maken van een leefwereld vol nieuwe energie. Jij kan hier aan bijdrage als nieuwe Lead Developer collega. Als Lead Developer werk je in het functie team Generative AI naast het Digitale Innovatie team van Stedin. Dit team is speciaal opgericht om met volle focus de kansen en mogelijkheden van Generative AI uit te gaan nutten, want de mogelijkheden blijken eindeloos en de vraag uit het bedrijf is enorm.\n\nNa een heerlijke kop koffie (of thee) die je in gebarentaal bij onze 'gebarista' (slechthorende barista) hebt besteld, start je jouw dag met de stand up van het Generative AI team, hierin vertel je huidige stand van zaken in de ontwikkeling van de laatste features. Daarna heb je een meeting met de Product Owner en de interne stakeholders. Jullie kijken samen hoe een probleem uit het bedrijf opgelost kan worden met de nieuwste taalmodellen; iets waar de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie. Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?\n\n   Lunchen doe je in het bedrijfsrestaurant op de 18e verdieping, zo geniet je van je eigen of verse lunch en van het uitzicht over heel Rotterdam. Of je loopt even de stad in voor een wandeling. Na de lunch ga je aan de slag met het technisch uitwerken van een nieuwe feature voor StedinGPT, onze interne versie van ChatGPT.\n\n   Als afsluiter heb je nog een meeting met een architect en afdeling security. Hier heb je het over de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is het plan voor de aankomende features veilig en kunnen we dit in de toekomst beter standaardiseren? Aan het eind van je werkdag sta je in een paar stappen op station Blaak, zo ben je lekker snel weer thuis.\n\nAls onderdeel van een snel groeiend team ben jij een verantwoordelijk persoon die veelzijdige taken op zich kan nemen en duidelijk knopen kan doorhakken op technische keuzes. LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is. Naast een dosis creativiteit zorg jij ook dat gemaakte oplossingen veilig zijn en klanten echt geholpen zijn met de eindoplossing. Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis. Je bent niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie, terwijl je steeds scherp blijft op het doel en de randvoorwaarden. Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt. Wat jou verder onze nieuwe Lead Developer maakt?\n\nVanaf dag één werk je in het Generative AI team. Dit team opereert als een DevOps team binnen een groot bedrijf en bestaat uit gedreven en enthousiaste developers, die op zoek zijn samen met de Product Owner naar het toevoegen van waarde d.m.v. Generative AI. Dit snel groeiende team is in staat om snel nieuwe ideeën om te zetten in realiteit binnen de complexe context van de netbeheerder, bijvoorbeeld door het uitvoeren van kleinschalige MVP's, maar ook het naar productie brengen van Generative AI binnen het IT landschap van Stedin."
    },
    "analysis": {
        "job_profile_classification": {
            "profile": "GenAI Engineer",
            "confidence_score": 5,
            "rationale": "The job description heavily emphasizes building and deploying applications using generative AI, specifically mentioning \"Generative AI team\", \"Generative AI\", \"language models\", and \"StedinGPT, our internal version of ChatGPT\". The core responsibilities align with developing user-facing GenAI solutions, RAG systems, and productionizing them, which are hallmarks of a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task_category": "TASK1: Business Understanding",
                    "phrases": [
                        "Door de energietransitie neemt ons werk ontzettend toe. Daarom zijn we ons werk aan het verslimmen met behulp van AI, zodat we samen werk kunnen maken van een leefwereld vol nieuwe energie.",
                        "Uiteindelijk wil je dat de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie.",
                        "Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?",
                        "Hier heb je het over de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is het plan voor de aankomende features veilig en kunnen we dit in de toekomst beter standaardiseren?",
                        "Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis.",
                        "Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt.",
                        "bestaat uit gedreven en enthousiaste developers, die op zoek zijn samen met de Product Owner naar het toevoegen van waarde d.m.v. Generative AI."
                    ],
                    "justification": "These phrases highlight understanding the business context (energy transition, Stedin's operations), translating business needs into AI solutions, identifying value creation, and aligning technical solutions with business goals and IT landscape."
                },
                {
                    "task_category": "TASK3: Modeling",
                    "phrases": [
                        "het functie team Generative AI",
                        "de kansen en mogelijkheden van Generative AI uit te gaan nutten",
                        "oplossing opgelost kan worden met de nieuwste taalmodellen",
                        "technisch uitwerken van een nieuwe feature voor StedinGPT, onze interne versie van ChatGPT.",
                        "LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is.",
                        "het naar productie brengen van Generative AI binnen het IT landschap van Stedin."
                    ],
                    "justification": "These phrases directly refer to working with Generative AI, language models, and specific applications like ChatGPT, indicating core modeling activities related to these technologies."
                },
                {
                    "task_category": "TASK4: Software Development",
                    "phrases": [
                        "Lead Developer Generative AI",
                        "stand up van het Generative AI team, hierin vertel je huidige stand van zaken in de ontwikkeling van de laatste features.",
                        "technisch uitwerken van een nieuwe feature voor StedinGPT",
                        "de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap",
                        "langdurig goed werkende software af te leveren in productie",
                        "het naar productie brengen van Generative AI binnen het IT landschap van Stedin."
                    ],
                    "justification": "The role is explicitly 'Lead Developer', involving the development of features, technical elaboration of solutions, integrating them into an IT landscape, and delivering production-ready software."
                },
                {
                    "task_category": "TASK5: Operations Engineering (MLOps)",
                    "phrases": [
                        "oplossing opgelost kan worden met de nieuwste taalmodellen; iets waar de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie. Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?",
                        "Hier heb je het over de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is het plan voor de aankomende features veilig en kunnen we dit in de toekomst beter standaardiseren?",
                        "Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis.",
                        "Je bent niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie, terwijl je steeds scherp blijft op het doel en de randvoorwaarden.",
                        "Dit snel groeiende team is in staat om snel nieuwe ideeën om te zetten in realiteit binnen de complexe context van de netbeheerder, bijvoorbeeld door het uitvoeren van kleinschalige MVP's, maar ook het naar productie brengen van Generative AI binnen het IT landschap van Stedin."
                    ],
                    "justification": "Phrases like 'veilige en schaalbare manier', 'terecht moet komen in het Stedin IT landschap', 'standaardiseren', 'langdurig goed werkende software af te leveren in productie', and 'naar productie brengen' indicate a focus on operationalizing and maintaining AI solutions."
                }
            ],
            "technologies": [
                {
                    "tech_category": "TECH3: LLM / Generative Models",
                    "technologies": [
                        "Generative AI",
                        "taalmodellen",
                        "StedinGPT",
                        "ChatGPT"
                    ]
                },
                {
                    "tech_category": "TECH4: LLM Frameworks & Libraries",
                    "technologies": [
                        "LLM technologie"
                    ]
                }
            ],
            "soft_skills": [
                {
                    "skill_category": "SKILL1: Communication & Collaboration",
                    "skills": [
                        "stand up van het Generative AI team, hierin vertel je huidige stand van zaken",
                        "meeting met de Product Owner en de interne stakeholders. Jullie kijken samen hoe een probleem uit het bedrijf opgelost kan worden",
                        "meeting met een architect en afdeling security. Hier heb je het over de toepasbaarheid van de gemaakte oplossing"
                    ]
                },
                {
                    "skill_category": "SKILL2: Learning & Adaptability",
                    "skills": [
                        "Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt."
                    ]
                },
                {
                    "skill_category": "SKILL3: Problem Solving & Pragmatism",
                    "skills": [
                        "hoe een probleem uit het bedrijf opgelost kan worden met de nieuwste taalmodellen",
                        "doorziet goed voor welk probleem welke oplossing geschikt is.",
                        "Je bent niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie"
                    ]
                },
                {
                    "skill_category": "SKILL5: Innovation & Ownership",
                    "skills": [
                        "Lead Developer",
                        "verantwoordelijk persoon die veelzijdige taken op zich kan nemen en duidelijk knopen kan doorhakken op technische keuzes.",
                        "Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis.",
                        "Je bent niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC"
                    ]
                }
            ]
        }
    }
}