{
    "job_id": 134,
    "job_details": {
        "job_id": 134,
        "Organisatienaam": "Synthesia",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior ML Platform Engineer - DataOps",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "startup.jobs",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We are looking for a Senior ML Platform Engineer - DataOps to help R&D manage large data-sets of audio-video data at Synthesia. We are creating a new ML Platform team, that will be supporting 7+ teams developing cutting edge solutions in generative video synthesis. You will join us to set up a world class data function, managing a lake with PB scale data and building complex audio/visual data pipelines to bring order and make data consumption simple. You are going to super-charge our research., In this position, you will set up and provide data management for our ML teams in R&D at Synthesia. You will help set up our audio-video data pipeline for the Video team and our speech data pipeline for the Voice team. You will be responsible for:\n     * Data storage - our data lake for large scale audio-visual datasets\n     * Data sources - set up our ingest process, working with external data providers\n     * Data annotation - manage data verification and annotation, working with external providers\n     * Data pipelines - deploy custom ML data transformations, working with our ML teams\n     * Data access - create transient data-sets on demand to support ML model training\n     * Data tracking - usage tracking and monitoring across all data sources, You will work in a hybrid setting with an office in Amsterdam",
        "Datum gevonden": "2023-02-02",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Cultuur / Recreatie",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2023,
        "Maand (van datum gevonden)": 2,
        "full_text": "Senior ML Platform Engineer - DataOps\n\nWe are looking for a Senior ML Platform Engineer - DataOps to help R&D manage large data-sets of audio-video data at Synthesia. We are creating a new ML Platform team, that will be supporting 7+ teams developing cutting edge solutions in generative video synthesis. You will join us to set up a world class data function, managing a lake with PB scale data and building complex audio/visual data pipelines to bring order and make data consumption simple. You are going to super-charge our research., In this position, you will set up and provide data management for our ML teams in R&D at Synthesia. You will help set up our audio-video data pipeline for the Video team and our speech data pipeline for the Voice team. You will be responsible for:\n     * Data storage - our data lake for large scale audio-visual datasets\n     * Data sources - set up our ingest process, working with external data providers\n     * Data annotation - manage data verification and annotation, working with external providers\n     * Data pipelines - deploy custom ML data transformations, working with our ML teams\n     * Data access - create transient data-sets on demand to support ML model training\n     * Data tracking - usage tracking and monitoring across all data sources, You will work in a hybrid setting with an office in Amsterdam"
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description heavily emphasizes data engineering tasks such as managing large-scale data lakes, building complex audio/visual data pipelines, setting up ingest processes, data annotation, and creating data access for ML model training. While it mentions supporting teams developing generative video synthesis, the core responsibilities and technologies described align more closely with the data-centric and MLOps aspects of an ML Engineer role, particularly in managing data infrastructure for ML teams, rather than the direct development and fine-tuning of generative models or building user-facing applications around them, which is the hallmark of a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK2",
                    "justification": "The role involves managing a data lake with PB scale data, building complex audio/visual data pipelines, setting up ingest processes, and creating transient data-sets for ML model training, all of which are core data engineering activities.",
                    "phrase": "manage a lake with PB scale data"
                },
                {
                    "category": "TASK2",
                    "justification": "The role explicitly mentions building complex audio/visual data pipelines to make data consumption simple, which is a key data engineering responsibility.",
                    "phrase": "building complex audio/visual data pipelines"
                },
                {
                    "category": "TASK2",
                    "justification": "Setting up and providing data management for ML teams, including setting up audio-video and speech data pipelines, falls under data engineering.",
                    "phrase": "set up and provide data management for our ML teams"
                },
                {
                    "category": "TASK2",
                    "justification": "Managing data storage, specifically a data lake for large-scale audio-visual datasets, is a data engineering task.",
                    "phrase": "Data storage - our data lake for large scale audio-visual datasets"
                },
                {
                    "category": "TASK2",
                    "justification": "Setting up the ingest process and working with external data providers to bring data into the system is a data engineering responsibility.",
                    "phrase": "Data sources - set up our ingest process, working with external data providers"
                },
                {
                    "category": "TASK2",
                    "justification": "Managing data verification and annotation, especially when working with external providers, is part of preparing data for ML, fitting into data engineering.",
                    "phrase": "Data annotation - manage data verification and annotation, working with external providers"
                },
                {
                    "category": "TASK2",
                    "justification": "Deploying custom ML data transformations and working with ML teams to integrate them is a data engineering task, bridging data preparation and model needs.",
                    "phrase": "Data pipelines - deploy custom ML data transformations, working with our ML teams"
                },
                {
                    "category": "TASK2",
                    "justification": "Creating transient data-sets on demand to support ML model training involves data preparation and provisioning, which is a data engineering function.",
                    "phrase": "Data access - create transient data-sets on demand to support ML model training"
                },
                {
                    "category": "TASK2",
                    "justification": "Tracking data usage and monitoring across all data sources is crucial for data governance and management, aligning with data engineering principles.",
                    "phrase": "Data tracking - usage tracking and monitoring across all data sources"
                },
                {
                    "category": "TASK5",
                    "justification": "The role is described as 'Senior ML Platform Engineer - DataOps', explicitly highlighting the DataOps aspect which is synonymous with MLOps, focusing on managing and optimizing data pipelines and infrastructure for ML.",
                    "phrase": "Senior ML Platform Engineer - DataOps"
                },
                {
                    "category": "TASK1",
                    "justification": "The role aims to 'super-charge our research' and support teams developing 'cutting edge solutions in generative video synthesis', indicating an understanding of how data infrastructure supports research and development goals.",
                    "phrase": "You will join us to set up a world class data function, managing a lake with PB scale data and building complex audio/visual data pipelines to bring order and make data consumption simple. You are going to super-charge our research."
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "working with our ML teams"
                },
                {
                    "category": "SKILL5",
                    "phrase": "Senior ML Platform Engineer"
                }
            ],
            "technologies": [
                {
                    "category": "TECH1",
                    "phrase": "ML"
                }
            ]
        }
    }
}