{
    "job_id": 1244,
    "job_details": {
        "job_id": 1244,
        "Organisatienaam": "Sogeti",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "Machine Learning Engineer",
        "Standplaats": "Vianen",
        "Vacaturelink (origineel)": "jobbird.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Machine learning engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Sogeti is een organisatie met een goede werksfeer en zo min mogelijk hiërarchische verhoudingen. Ga je bij ons als Machine Learning Engineer de slag? Dan kun je rekenen op honderden collega's die klaarstaan om klanten te helpen, en ook elkaar graag een helpende hand bieden. Sogetisten gaan niet alleen voor goede resultaten, maar ook voor lol tijdens het werk. Deze snelgroeiende groep collega's krijgt energie van hun vak en dat merk je op de werkvloer. Sogeti is een fijne werkgever en geeft jou de ruimte om de inhoud in te duiken!\n\nAls Machine Learning Engineer help je onze klanten vertrouwd te maken met het verwerken van complexe data door middel van machine learning, data mining en deep learning technologieën. Je zet statistische modellen en voorspellende algoritmes in om verborgen patronen te onthullen. Daarbij ontwikkel je end-tot-end oplossingen om je werk te operationaliseren. Niet alleen PoC's maar ook robuuste oplossingen die in productie worden gebruikt. Dit doe je samen met het Center of Excellence (CoE) van ons AI-team, of in directe samenwerking met de klant. Je creëert echte impact door middel van het toepassen van machine learning en AI-technieken.",
        "Datum gevonden": "2024-07-12",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 7,
        "full_text": "Machine Learning Engineer\n\nSogeti is een organisatie met een goede werksfeer en zo min mogelijk hiërarchische verhoudingen. Ga je bij ons als Machine Learning Engineer de slag? Dan kun je rekenen op honderden collega's die klaarstaan om klanten te helpen, en ook elkaar graag een helpende hand bieden. Sogetisten gaan niet alleen voor goede resultaten, maar ook voor lol tijdens het werk. Deze snelgroeiende groep collega's krijgt energie van hun vak en dat merk je op de werkvloer. Sogeti is een fijne werkgever en geeft jou de ruimte om de inhoud in te duiken!\n\nAls Machine Learning Engineer help je onze klanten vertrouwd te maken met het verwerken van complexe data door middel van machine learning, data mining en deep learning technologieën. Je zet statistische modellen en voorspellende algoritmes in om verborgen patronen te onthullen. Daarbij ontwikkel je end-tot-end oplossingen om je werk te operationaliseren. Niet alleen PoC's maar ook robuuste oplossingen die in productie worden gebruikt. Dit doe je samen met het Center of Excellence (CoE) van ons AI-team, of in directe samenwerking met de klant. Je creëert echte impact door middel van het toepassen van machine learning en AI-technieken."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description emphasizes building and operationalizing end-to-end solutions using machine learning, data mining, and deep learning technologies. It specifically mentions using statistical models and predictive algorithms to uncover patterns and developing robust solutions for production, aligning with the core responsibilities and evidence profile of an ML Engineer. While generative AI is not explicitly mentioned, the focus on predictive modeling and productionizing models strongly points to this profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'statistische modellen en voorspellende algoritmes in te zetten om verborgen patronen te onthullen' directly relates to the creation and application of models for prediction and pattern discovery.",
                    "phrase": "statistische modellen en voorspellende algoritmes in te zetten om verborgen patronen te onthullen"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'machine learning, data mining en deep learning technologieën' refers to the core techniques used in building and applying models.",
                    "phrase": "machine learning, data mining en deep learning technologieën"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'ontwikkel je end-tot-end oplossingen om je werk te operationaliseren' implies building complete solutions, which includes software development aspects beyond just model training.",
                    "phrase": "ontwikkel je end-tot-end oplossingen om je werk te operationaliseren"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'Niet alleen PoC's maar ook robuuste oplossingen die in productie worden gebruikt' indicates a focus on deploying and maintaining models in a production environment, which is a key aspect of MLOps.",
                    "phrase": "Niet alleen PoC's maar ook robuuste oplossingen die in productie worden gebruikt"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'help je onze klanten vertrouwd te maken met het verwerken van complexe data' suggests understanding client needs and translating them into data processing solutions.",
                    "phrase": "help je onze klanten vertrouwd te maken met het verwerken van complexe data"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'creëert echte impact door middel van het toepassen van machine learning en AI-technieken' implies building and deploying solutions that have a real-world impact, often involving software development.",
                    "phrase": "creëert echte impact door middel van het toepassen van machine learning en AI-technieken"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "honderden collega's die klaarstaan om klanten te helpen, en ook elkaar graag een helpende hand bieden"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "geeft jou de ruimte om de inhoud in te duiken!"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "in directe samenwerking met de klant"
                }
            ],
            "technologies": [
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "machine learning"
                },
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "deep learning"
                },
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "statistische modellen"
                },
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "voorspellende algoritmes"
                }
            ]
        }
    }
}