{
    "job_id": 1007,
    "job_details": {
        "job_id": 1007,
        "Organisatienaam": "Radboud Universiteit",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "PHP Developer",
        "Standplaats": "Nijmegen",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": "Roel Hermkens",
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Programmeur PHP (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "De website van de Radboud Universiteit is ons visitekaartje en van essentieel belang voor duizenden studenten en medewerkers. Als PHP Developer draag je bij aan het verder ontwikkelen en vormgeven van ons Drupal CMS en geef jij onze digitale bezoekers de best mogelijke webervaring. Met volop kansen om jezelf te ontwikkelen en je functie eigen te maken, kun je uitgroeien tot dé expert waar collega's op vertrouwen. Wil jij jouw kwaliteiten inzetten in een maatschappelijke organisatie met een complex IT-landschap? Dan hebben wij jou nodig!\n\n   Als ervaren PHP Developer zijn jouw werkzaamheden erg divers. Je vertaalt samen met het team een functionele behoefte naar een passende oplossing binnen het Drupal CMS. Dat kan bijvoorbeeld betekenen dat we een stuk maatwerk implementeren met PHP, dat je meewerkt aan de front-end in javascript of dat je een externe koppeling moet opzetten en inrichten. Daarnaast beheer je ook het platform waar Drupal op draait, waarbij je bezig bent met de backend van het systeem. Uiteraard doe je dat samen met je collega ontwikkelaars en met collega's binnen team Applications omtrent generieke standaarden en richtlijnen.\n\n   Als PHP Developer werk je in een scrumteam nauw samen met zowel collega ontwikkelaars als de product owner en functioneel beheerders. We werken met twee wekelijkse cycli van planning, refinement, retro en release. Met onze dagelijkse scrum stand-up houden we overzicht op onze werkzaamheden. Samen met Marketing & Communicatie vertaal je wensen naar hoogwaardige oplossingen. Naast innovatie zorg je voor een goed beheersbaar platform en werk je aan je eigen ontwikkeling. Je krijgt ruimte om je rol vorm te geven, taken op te pakken die je interessant vindt, en te groeien naar een functie waarin je collega's ondersteunt. Je ziet het als een uitdaging om samen te werken met verschillende disciplines binnen een complexe organisatie als de universiteit.\n\n   Als Drupal team werken we de komende tijd hard aan verbeteringen van de website, waaronder de presentatie van onze opleidingen en minoren. Tegelijkertijd zijn we continu bezig met het verbeteren van de prestaties van de website. Ook komend jaar blijven we ambitieus. We richten ons op de doorontwikkeling van de UX, homepage, menu en zoekfunctionaliteit. Daarnaast onderzoeken we hoe generatieve AI onze redacteuren kan ondersteunen. Kortom: er zijn voldoende innovatieve projecten en ambities waar je als PHP Developer jouw kennis in kunt delen.",
        "Datum gevonden": "2024-12-20",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Mogelijk vast contract",
        "Parttime / fulltime": "Parttime / Fulltime",
        "Branche": "Onderwijs / Onderzoek",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 12,
        "full_text": "PHP Developer\n\nDe website van de Radboud Universiteit is ons visitekaartje en van essentieel belang voor duizenden studenten en medewerkers. Als PHP Developer draag je bij aan het verder ontwikkelen en vormgeven van ons Drupal CMS en geef jij onze digitale bezoekers de best mogelijke webervaring. Met volop kansen om jezelf te ontwikkelen en je functie eigen te maken, kun je uitgroeien tot dé expert waar collega's op vertrouwen. Wil jij jouw kwaliteiten inzetten in een maatschappelijke organisatie met een complex IT-landschap? Dan hebben wij jou nodig!\n\n   Als ervaren PHP Developer zijn jouw werkzaamheden erg divers. Je vertaalt samen met het team een functionele behoefte naar een passende oplossing binnen het Drupal CMS. Dat kan bijvoorbeeld betekenen dat we een stuk maatwerk implementeren met PHP, dat je meewerkt aan de front-end in javascript of dat je een externe koppeling moet opzetten en inrichten. Daarnaast beheer je ook het platform waar Drupal op draait, waarbij je bezig bent met de backend van het systeem. Uiteraard doe je dat samen met je collega ontwikkelaars en met collega's binnen team Applications omtrent generieke standaarden en richtlijnen.\n\n   Als PHP Developer werk je in een scrumteam nauw samen met zowel collega ontwikkelaars als de product owner en functioneel beheerders. We werken met twee wekelijkse cycli van planning, refinement, retro en release. Met onze dagelijkse scrum stand-up houden we overzicht op onze werkzaamheden. Samen met Marketing & Communicatie vertaal je wensen naar hoogwaardige oplossingen. Naast innovatie zorg je voor een goed beheersbaar platform en werk je aan je eigen ontwikkeling. Je krijgt ruimte om je rol vorm te geven, taken op te pakken die je interessant vindt, en te groeien naar een functie waarin je collega's ondersteunt. Je ziet het als een uitdaging om samen te werken met verschillende disciplines binnen een complexe organisatie als de universiteit.\n\n   Als Drupal team werken we de komende tijd hard aan verbeteringen van de website, waaronder de presentatie van onze opleidingen en minoren. Tegelijkertijd zijn we continu bezig met het verbeteren van de prestaties van de website. Ook komend jaar blijven we ambitieus. We richten ons op de doorontwikkeling van de UX, homepage, menu en zoekfunctionaliteit. Daarnaast onderzoeken we hoe generatieve AI onze redacteuren kan ondersteunen. Kortom: er zijn voldoende innovatieve projecten en ambities waar je als PHP Developer jouw kennis in kunt delen."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description is for a PHP Developer focused on Drupal CMS development, website experience, and backend system management. While it mentions exploring generative AI for editor support, this is a future exploration and not a core responsibility of the role. The primary focus is on traditional web development and CMS customization, which does not align with the core responsibilities or technologies of an ML Engineer or GenAI Engineer. Therefore, it falls under the 'Ambiguous' category as it's a technical role not primarily focused on AI model development or deployment."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves developing and shaping the Drupal CMS, implementing custom solutions with PHP, working on the front-end with JavaScript, and setting up external integrations. This directly aligns with building and integrating software.",
                    "phrase": "verder ontwikkelen en vormgeven van ons Drupal CMS"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "Translating functional needs into solutions within the Drupal CMS, including custom PHP implementation, front-end JavaScript work, and external integrations, are core software development activities.",
                    "phrase": "Je vertaalt samen met het team een functionele behoefte naar een passende oplossing binnen het Drupal CMS. Dat kan bijvoorbeeld betekenen dat we een stuk maatwerk implementeren met PHP, dat je meewerkt aan de front-end in javascript of dat je een externe koppeling moet opzetten en inrichten."
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "Managing the platform where Drupal runs and working on the backend of the system are aspects of software development and system administration.",
                    "phrase": "Daarnaast beheer je ook het platform waar Drupal op draait, waarbij je bezig bent met de backend van het systeem."
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "Collaborating with Marketing & Communication to translate wishes into high-quality solutions indicates an understanding of business needs and translating them into technical outcomes.",
                    "phrase": "Samen met Marketing & Communicatie vertaal je wensen naar hoogwaardige oplossingen."
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The job description mentions exploring how generative AI can support editors, which touches upon the application of AI models, although it's an area of investigation rather than a core development task.",
                    "phrase": "Daarnaast onderzoeken we hoe generatieve AI onze redacteuren kan ondersteunen."
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Managing the platform where Drupal runs and ensuring a well-managed platform touches upon operational aspects of the system.",
                    "phrase": "Daarnaast beheer je ook het platform waar Drupal op draait"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Ensuring a well-managed platform is a key aspect of operations engineering.",
                    "phrase": "zorg je voor een goed beheersbaar platform"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "samen met het team"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "samen met je collega ontwikkelaars en met collega's binnen team Applications"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "werk je in een scrumteam nauw samen met zowel collega ontwikkelaars als de product owner en functioneel beheerders"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Samen met Marketing & Communicatie"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "naast innovatie"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "met volop kansen om jezelf te ontwikkelen en je functie eigen te maken"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "je krijgt ruimte om je rol vorm te geven, taken op te pakken die je interessant vindt"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "vertalen van een functionele behoefte naar een passende oplossing"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Je ziet het als een uitdaging om samen te werken met verschillende disciplines binnen een complexe organisatie als de universiteit."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "ambities waar je als PHP Developer jouw kennis in kunt delen."
                }
            ],
            "technologies": [
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "PHP"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "javascript"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "generatieve AI"
                }
            ]
        }
    }
}