{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Assist researchers and students to efficiently deploy scientific workloads on the various AI/HPC platforms",
                "justification": "This phrase indicates the need to understand the scientific research needs (business context) and translate them into actionable deployment strategies on AI/HPC platforms."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "work with researchers to understand and optimize their application (benchmarking, code optimization)",
                "justification": "This involves comprehending the researchers' goals and challenges to provide optimized solutions, aligning technical work with user needs."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Optimizing application workflow (pre-processing, simulation, post-processing, data storage, etc.) to make the best use of a given platform.",
                "justification": "This task requires understanding the overall research workflow and business objectives to optimize resource utilization and efficiency."
            },
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Optimizing application workflow (pre-processing, simulation, post-processing, data storage, etc.)",
                "justification": "The mention of pre-processing, post-processing, and data storage within application workflows directly relates to data engineering tasks."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "AI/ML Application Support Engineer",
                "justification": "The job title itself implies support and interaction with AI/ML applications, which inherently involves understanding and potentially optimizing models."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "optimize their application (benchmarking, code optimization)",
                "justification": "Benchmarking and code optimization are activities often performed to improve the performance of underlying ML models or scientific simulations."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "deploy scientific workloads on the various AI/HPC platforms, such as batch computing clusters (local clusters, SURF CPU/GPU clusters) and cloud infrastructure (like Azure and Rescale)",
                "justification": "Deploying workloads on specific platforms involves software deployment and integration tasks."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Optimizing application workflow",
                "justification": "Optimizing workflows often involves scripting, configuring, and integrating different software components."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "AI/HPC infrastructure engineering know-how",
                "justification": "Possessing infrastructure engineering know-how, even with a focus on applications, suggests involvement in operational aspects of AI/HPC systems."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "Benchmarking and administration/accounting of workloads.",
                "justification": "Benchmarking and administration of workloads are key operational tasks in managing computing resources."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "Training and communication for end-users.",
                "justification": "Training end-users on how to use AI/HPC platforms and workflows falls under operational support and enablement."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH1",
                "tool_name": "Python"
            },
            {
                "category_id": "TECH2",
                "tool_name": "Azure"
            },
            {
                "category_id": "TECH6",
                "tool_name": "HPC"
            },
            {
                "category_id": "TECH6",
                "tool_name": "Rescale"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "proactive, service-minded, and self-driven"
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "help us build and professionalize this innovative service."
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "rise above yourself, in your profession, and as a person? Do you want to be challenged every day?"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "You will closely work with researchers, students of all departments, and TU/e institutes as well as with industry partners."
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Training and communication for end-users."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "proactive, service-minded, and self-driven"
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "help us shape the future of our university, scientists, and students."
            }
        ]
    },
    "classification": {
        "profile": "ML Engineer",
        "confidence": 3,
        "rationale": "While the role involves AI/ML, the primary focus is on application support, workflow optimization, and infrastructure interaction (HPC, cloud). It lacks the core focus on algorithm development, model training/evaluation, or productionizing prototypes from data scientists typical of an ML Engineer. The role is more application-centric and operational, leaning away from pure ML model building."
    }
}