{
    "job_id": 781,
    "job_details": {
        "job_id": 781,
        "Organisatienaam": "Nillion",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Lead AI Engineer",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "jobsonline.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Hoofd engineering (m/v/x)",
        "Opleidingsniveau": "WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We're looking for a Lead AI Engineer with a strong background in generative AI models and an interest in Privacy Enhancing Technologies (PET). The ideal candidate will explore the intersection of generative AI and MPC, developing new techniques and methodologies that allow for secure, distributed AI computations. You will be working with the Nillion Product team and report to Nillion's AI Product Lead., * You will design & execute a technical AI roadmap towards bridging the gap between AI and confidential computing, in close collaboration with our AI and cryptography team\n     * You will work closely with our cryptography team, getting up to speed with the technical nuances & implementing AI models accordingly\n     * You will adapt AI model architectures to work in a performant way under a confidential computing paradigm and technically implement these architectures in our AI toolkit\n     * You will have regular touchpoints with AI developers on the Nillion network and integrate their feedback in our AI roadmap\n     * You will work closely with our DevRel team and actively contribute to creating easy-to-use AI tools and suitable AI development workflows",
        "Datum gevonden": "2024-09-21",
        "Beroepsgroep": "Hoofden engineering",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 9,
        "full_text": "Lead AI Engineer\n\nWe're looking for a Lead AI Engineer with a strong background in generative AI models and an interest in Privacy Enhancing Technologies (PET). The ideal candidate will explore the intersection of generative AI and MPC, developing new techniques and methodologies that allow for secure, distributed AI computations. You will be working with the Nillion Product team and report to Nillion's AI Product Lead., * You will design & execute a technical AI roadmap towards bridging the gap between AI and confidential computing, in close collaboration with our AI and cryptography team\n     * You will work closely with our cryptography team, getting up to speed with the technical nuances & implementing AI models accordingly\n     * You will adapt AI model architectures to work in a performant way under a confidential computing paradigm and technically implement these architectures in our AI toolkit\n     * You will have regular touchpoints with AI developers on the Nillion network and integrate their feedback in our AI roadmap\n     * You will work closely with our DevRel team and actively contribute to creating easy-to-use AI tools and suitable AI development workflows"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes working with generative AI models, adapting AI model architectures for confidential computing, and implementing these in an AI toolkit. It also mentions developing AI tools and workflows, aligning with the core responsibilities of a GenAI Engineer focused on building and deploying generative AI applications. While cryptography and confidential computing are mentioned, the primary focus remains on the application and adaptation of AI models, particularly generative ones."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'adapt AI model architectures to work in a performant way under a confidential computing paradigm' directly relates to modifying and implementing AI models, which falls under the Modeling category.",
                    "phrase": "adapt AI model architectures to work in a performant way under a confidential computing paradigm"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'implementing AI models accordingly' indicates the practical application and building of AI models, fitting the Modeling task.",
                    "phrase": "implementing AI models accordingly"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'implement these architectures in our AI toolkit' suggests building and integrating AI components into a usable system, which is part of Software Development.",
                    "phrase": "implement these architectures in our AI toolkit"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'creating easy-to-use AI tools and suitable AI development workflows' points to the development of software tools and processes for AI development, falling under Software Development.",
                    "phrase": "creating easy-to-use AI tools and suitable AI development workflows"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'design & execute a technical AI roadmap towards bridging the gap between AI and confidential computing' involves understanding strategic goals and translating them into a technical plan, which is Business Understanding.",
                    "phrase": "design & execute a technical AI roadmap towards bridging the gap between AI and confidential computing"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'working with the Nillion Product team and report to Nillion's AI Product Lead' indicates alignment with product strategy and business objectives.",
                    "phrase": "working with the Nillion Product team and report to Nillion's AI Product Lead"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'regular touchpoints with AI developers on the Nillion network and integrate their feedback in our AI roadmap' involves understanding user needs and incorporating them into the technical strategy.",
                    "phrase": "regular touchpoints with AI developers on the Nillion network and integrate their feedback in our AI roadmap"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "in close collaboration with our AI and cryptography team"
                },
                {
                    "category": "SKILL1",
                    "phrase": "You will work closely with our cryptography team"
                },
                {
                    "category": "SKILL1",
                    "phrase": "You will have regular touchpoints with AI developers on the Nillion network"
                },
                {
                    "category": "SKILL1",
                    "phrase": "You will work closely with our DevRel team"
                },
                {
                    "category": "SKILL2",
                    "phrase": "getting up to speed with the technical nuances"
                },
                {
                    "category": "SKILL3",
                    "phrase": "explore the intersection of generative AI and MPC, developing new techniques and methodologies"
                },
                {
                    "category": "SKILL5",
                    "phrase": "Lead AI Engineer"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "generative AI models"
                },
                {
                    "category": "TECH2",
                    "phrase": "Nillion network"
                }
            ]
        }
    }
}