{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "create models that guides the avatar's verbal and non verbal cues",
                "justification": "This phrase directly refers to the creation and guidance of models for avatar behavior."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Developing, maintaining and deploying Computer Vision algorithms and models",
                "justification": "This explicitly states the development, maintenance, and deployment of models and algorithms."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Adapting off-the-shelf solutions for the purposes of our product",
                "justification": "This describes the process of modifying existing models or solutions for a specific use case."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "create high quality, production ready code",
                "justification": "This indicates a focus on writing production-grade software."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Building libraries to accelerate the iteration speed during development (abstracting common functionality, automating tests sweeps, visualising results etc.)",
                "justification": "This describes the creation of software libraries to improve the development workflow."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "integrating CI/CD",
                "justification": "CI/CD integration is a core software development practice for deployment."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "Taking ownership of the full ML lifecycle from concept, development, testing, validation to deployment",
                "justification": "This phrase covers the entire lifecycle of an ML model, which is central to MLOps."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Contribute to a high-quality codebase, develop tests where necessary, and participate in code reviews.",
                "justification": "These are standard software development practices focused on code quality and collaboration."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Writing clean and efficient code, and defining best practices both in the code base you own and in adoption of the tools you build.",
                "justification": "This emphasizes the creation and adherence to good coding practices."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Optimising for deployment - turning prototypes into working solutions.",
                "justification": "This focuses on the practical aspect of making prototypes functional for deployment."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Developing production quality software, our teams work \"full stack\" with the ability to deliver direct to product and impact the world.",
                "justification": "This highlights the development of production software and full-stack capabilities to deliver to product."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "create highly realistic, emotional and life-like synthetic humans through text-to-video.",
                "justification": "This describes the ultimate business goal and product vision of the role."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "working at the heart of the dynamic Avatar Video Team helping with the research and development of our generative avatar performance abilities.",
                "justification": "This indicates the context of the work within a specific team and its focus on generative avatar performance."
            }
        ],
        "technologies": [],
        "soft_skills": [
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "take ownership of production pipelines"
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "take ownership of the full ML lifecycle"
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "take ownership of the full ML lifecycle from concept, development, testing, validation to deployment."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "defining best practices both in the code base you own and in adoption of the tools you build."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "our teams work \"full stack\" with the ability to deliver direct to product and impact the world."
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "Optimising for deployment - turning prototypes into working solutions."
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "passion for working on cutting edge problems"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "participate in code reviews."
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 5,
        "rationale": "The job description heavily emphasizes the development and deployment of generative models for 'synthetic humans through text-to-video' and 'avatar performance abilities'. It specifically mentions creating models that guide avatar cues, adapting solutions, and a focus on the full ML lifecycle, aligning with the core responsibilities of a GenAI Engineer."
    }
}