{
    "job_id": 608,
    "job_details": {
        "job_id": 608,
        "Organisatienaam": "Alliander",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Engineer (English-Speaking)",
        "Standplaats": "Arnhem",
        "Vacaturelink (origineel)": "alliander.com",
        "Contactpersoon": "Sandra Jokhan",
        "Telefoonnummer": "+31642329903",
        "E-mail": "bram.van.der.linde@alliander.com,sandra.jokhan@alliander.com",
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "You will be responsible for the development, integration, and rollout of LLM agents that accelerate knowledge sharing between teams and enable the automation of daily work processes. Additionally, you will support other teams with our MLOps platform to create and deploy ML models, while keeping a keen eye on cloud and MLOps best practices. Furthermore, you will play an active role in enhancing the AI skills of yourself, your team members, and colleagues by following and sharing the latest developments in the field. Finally, together with your team, you will carry operational responsibility for our tools and services.\n\n   As a team, we offer two products: the Voltix Assistant and the Voltix MLOps platform. The Voltix Assistant product will provide a smooth, standardized rollout of LLM agents for various internal use cases. The main focus of these use cases will be to make the right knowledge easily accessible within our large organization. With the Voltix MLOps platform, we help other teams get started quickly and accurately through a standardized AWS cloud environment, both for developing, testing, and deploying ML models, as well as for conducting data analyses. We do not create models ourselves; we are a platform team.\n\n   We are creating the energy grid of the future, for everyone, with everyone. And as AI Engineer, you can play your part in this. Your role will involve:\n     * Translating LLM use cases into technical solutions and standardized solutions for multiple use cases where possible.\n     * Implementing, rolling out, and managing LLM agents, with a preference for existing frameworks and LLM models.\n     * Integrating internal data sources (such as SharePoint and Confluence) as a knowledge base for the LLM agents.\n     * Embedding LLM agents into end-user tools, such as Microsoft Teams.\n     * Maintaining the MLOps platform on AWS for secure and controlled delivery of ML models by data science teams.\n\n   You complete our network\n\n   Did you know that Alliander is made up of different companies? Together with Liander, Qirion, Qterra, Dep, Firan and Entrnce, we develop and manage the energy grid for millions of people in the Netherlands. And in the light of the current energy transition, that is no easy task. We are realising this transition with a large group of talented professionals. Thanks to them, we have every confidence that we will be able to safeguard the Netherlands' energy future. Together with you, we will make this happen.\n\n   Having a mindset in which only the best is good enough is only possible with the right motivation. As a member of the AI Acceleration team, you'll be part of a young and dynamic team made up of a Product Owner, Tech Lead, Scrum Master, and six AI engineers. Together, we leverage our experience with AWS, MLOps, and data science to accelerate AI advancements at Alliander. This is essential, as AI also plays a crucial role in addressing the challenges of a sustainable energy transition. Our clients are diverse, including primarily data science teams developing internal applications, digitalization teams, and several business intelligence teams., Working with the latest technologies and innovations. With your talent and strengths, you can do that at our company. Will you contribute with your well-considered approaches, clear communication, and seamless collaboration? We are looking in particular for a candidate with",
        "Datum gevonden": "2024-11-07",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Nutsvoorzieningen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 11,
        "full_text": "AI Engineer (English-Speaking)\n\nYou will be responsible for the development, integration, and rollout of LLM agents that accelerate knowledge sharing between teams and enable the automation of daily work processes. Additionally, you will support other teams with our MLOps platform to create and deploy ML models, while keeping a keen eye on cloud and MLOps best practices. Furthermore, you will play an active role in enhancing the AI skills of yourself, your team members, and colleagues by following and sharing the latest developments in the field. Finally, together with your team, you will carry operational responsibility for our tools and services.\n\n   As a team, we offer two products: the Voltix Assistant and the Voltix MLOps platform. The Voltix Assistant product will provide a smooth, standardized rollout of LLM agents for various internal use cases. The main focus of these use cases will be to make the right knowledge easily accessible within our large organization. With the Voltix MLOps platform, we help other teams get started quickly and accurately through a standardized AWS cloud environment, both for developing, testing, and deploying ML models, as well as for conducting data analyses. We do not create models ourselves; we are a platform team.\n\n   We are creating the energy grid of the future, for everyone, with everyone. And as AI Engineer, you can play your part in this. Your role will involve:\n     * Translating LLM use cases into technical solutions and standardized solutions for multiple use cases where possible.\n     * Implementing, rolling out, and managing LLM agents, with a preference for existing frameworks and LLM models.\n     * Integrating internal data sources (such as SharePoint and Confluence) as a knowledge base for the LLM agents.\n     * Embedding LLM agents into end-user tools, such as Microsoft Teams.\n     * Maintaining the MLOps platform on AWS for secure and controlled delivery of ML models by data science teams.\n\n   You complete our network\n\n   Did you know that Alliander is made up of different companies? Together with Liander, Qirion, Qterra, Dep, Firan and Entrnce, we develop and manage the energy grid for millions of people in the Netherlands. And in the light of the current energy transition, that is no easy task. We are realising this transition with a large group of talented professionals. Thanks to them, we have every confidence that we will be able to safeguard the Netherlands' energy future. Together with you, we will make this happen.\n\n   Having a mindset in which only the best is good enough is only possible with the right motivation. As a member of the AI Acceleration team, you'll be part of a young and dynamic team made up of a Product Owner, Tech Lead, Scrum Master, and six AI engineers. Together, we leverage our experience with AWS, MLOps, and data science to accelerate AI advancements at Alliander. This is essential, as AI also plays a crucial role in addressing the challenges of a sustainable energy transition. Our clients are diverse, including primarily data science teams developing internal applications, digitalization teams, and several business intelligence teams., Working with the latest technologies and innovations. With your talent and strengths, you can do that at our company. Will you contribute with your well-considered approaches, clear communication, and seamless collaboration? We are looking in particular for a candidate with"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, integration, and rollout of LLM agents, including building RAG systems by integrating internal data sources. It also mentions embedding these agents into end-user tools like Microsoft Teams and supporting an MLOps platform for ML model deployment. The core responsibilities align with the definition of a GenAI Engineer, focusing on generative models and building user-facing applications around them, rather than traditional predictive modeling."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The role involves the development, integration, and rollout of LLM agents, which directly relates to working with and adapting generative models.",
                    "phrase": "development, integration, and rollout of LLM agents"
                },
                {
                    "category": "TASK3",
                    "justification": "The description explicitly mentions supporting other teams with the MLOps platform to create and deploy ML models, indicating involvement in the modeling lifecycle.",
                    "phrase": "support other teams with our MLOps platform to create and deploy ML models"
                },
                {
                    "category": "TASK5",
                    "justification": "The job requires keeping a keen eye on cloud and MLOps best practices, and maintaining the MLOps platform for secure and controlled delivery of ML models.",
                    "phrase": "keeping a keen eye on cloud and MLOps best practices"
                },
                {
                    "category": "TASK5",
                    "justification": "The role involves carrying operational responsibility for tools and services, which aligns with maintaining production systems.",
                    "phrase": "carry operational responsibility for our tools and services"
                },
                {
                    "category": "TASK4",
                    "justification": "Translating LLM use cases into technical solutions and standardized solutions for multiple use cases indicates software development to build reusable components.",
                    "phrase": "Translating LLM use cases into technical solutions and standardized solutions"
                },
                {
                    "category": "TASK3",
                    "justification": "Implementing, rolling out, and managing LLM agents, with a preference for existing frameworks and LLM models, directly involves working with generative models.",
                    "phrase": "Implementing, rolling out, and managing LLM agents"
                },
                {
                    "category": "TASK2",
                    "justification": "Integrating internal data sources like SharePoint and Confluence as a knowledge base for LLM agents is a form of data preparation and integration for model use.",
                    "phrase": "Integrating internal data sources (such as SharePoint and Confluence) as a knowledge base for the LLM agents"
                },
                {
                    "category": "TASK4",
                    "justification": "Embedding LLM agents into end-user tools such as Microsoft Teams is a core software development task to integrate AI features into applications.",
                    "phrase": "Embedding LLM agents into end-user tools, such as Microsoft Teams"
                },
                {
                    "category": "TASK5",
                    "justification": "Maintaining the MLOps platform on AWS for secure and controlled delivery of ML models by data science teams is a direct MLOps responsibility.",
                    "phrase": "Maintaining the MLOps platform on AWS for secure and controlled delivery of ML models"
                },
                {
                    "category": "TASK1",
                    "justification": "The role involves supporting other teams and clients (data science teams, digitalization teams, business intelligence teams) with AI solutions, requiring an understanding of their needs.",
                    "phrase": "support other teams with our MLOps platform"
                },
                {
                    "category": "TASK1",
                    "justification": "The job description mentions translating LLM use cases into technical solutions, which requires understanding business needs and translating them into technical requirements.",
                    "phrase": "Translating LLM use cases into technical solutions"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2",
                    "phrase": "following and sharing the latest developments in the field"
                },
                {
                    "category": "SKILL1",
                    "phrase": "clear communication"
                },
                {
                    "category": "SKILL1",
                    "phrase": "seamless collaboration"
                },
                {
                    "category": "SKILL5",
                    "phrase": "play your part in this"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "LLM agents"
                },
                {
                    "category": "TECH6",
                    "phrase": "MLOps platform"
                },
                {
                    "category": "TECH2",
                    "phrase": "AWS"
                },
                {
                    "category": "TECH4",
                    "phrase": "existing frameworks"
                },
                {
                    "category": "TECH3",
                    "phrase": "LLM models"
                },
                {
                    "category": "TECH9",
                    "phrase": "SharePoint"
                },
                {
                    "category": "TECH9",
                    "phrase": "Confluence"
                },
                {
                    "category": "TECH4",
                    "phrase": "LLM agents"
                },
                {
                    "category": "TECH4",
                    "phrase": "Microsoft Teams"
                }
            ]
        }
    }
}