{
    "job_id": 551,
    "job_details": {
        "job_id": 551,
        "Organisatienaam": "Rochdale",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Data engineer",
        "Standplaats": "Zaanstad",
        "Vacaturelink (origineel)": "rochdale.nl",
        "Contactpersoon": "Chris Horst",
        "Telefoonnummer": null,
        "E-mail": "chorst@rochdale.nl",
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Rochdale zet zich in voor sterke buurten, waar inwoners meer kansen hebben. We bouwen, verduurzamen en maken kwetsbare buurten sterker. Jij kunt hier een mooie bijdrage aan leveren vanuit jouw rol als data engineer. Je bent verantwoordelijk voor de ETL-processen waardoor de organisatie elke dag de beschikking heeft over actuele informatie. Je bent op de hoogte van de laatste technologische ontwikkelingen, zoals op het gebied van\n\n   GenAI en bent in staat deze te vertalen naar bruikbare toepassingen voor onze (eind)gebruikers. Daarnaast focus jij je op onze Lakehouse constructie in de Microsoft Azure omgeving en zorgt voor de doorontwikkeling ervan. Python en SQL zijn bekende termen voor jou en ook het toepassen van CI/CD methodologieën zijn jou niet onbekend.\n\n   De afdeling waar je komt te werken is het Data Competence Center (DCC) binnen de afdeling Digitalisering & Informatievoorziening en bestaat uit twee data-specialisten en een datamanager. Het DCC maakt gebruik van de modernste Microsoft Azure tooling waaronder PowerBI, Azure DevOps, Data Lake en Synapse Analytics. Het DCC werkt volgens de scrum methodiek en ontwikkelt met behulp van DevOps. De afdeling Digitalisering & Informatievoorziening heeft zich de afgelopen jaren meer en meer ontwikkeld naar een regie-organisatie, die enerzijds de (veranderende) behoefte vanuit de business ophaalt en ordent en anderzijds de dienstverlening door externe IT-dienstverleners regisseert, zodat deze aansluit op de behoefte van de business. Wij zoeken een collega die warm loopt als engineer voor het neerzetten, onderhouden en verder optimaliseren van ons data-infrastructuur.\n\n   Jouw werkdag\n   Eerst een kop koffie halen op 5, waar de barista van de espressobar voor je klaar staat. Dan start de dag met een standup met het DCC-team. De uitdagingen voor het team zijn groot: hoe gaan we in gesprek met onze collega's om duidelijk te krijgen welke behoefte aan (stuur)informatie er is en hoe kunnen we dit vormgeven met onze data en technieken. Met als perspectief uiteraard hoe deze stuurinformatie bijdraagt aan onze strategische doelen en het verschil gaat maken voor de collega's en onze huurders. Jij als data engineer adviseert over nieuwe technologische toepassingen en ontwikkelingen en neemt het team mee in het optimaliseren van de bestaande technieken en processen. Naast adviseren ga je ook aan de slag met het daadwerkelijk uitwerken en implementeren van deze nieuwe initiatieven en ontwikkelingen.\n\n   Als data engineer ben je gesprekspartner voor het team DCC en de D&I afdeling, je doet analyses en komt met voorstellen. Samenwerken met collega's en meedoen in projecten is vanzelfsprekend. Je brengt hier je kennis en expertise over technologische mogelijkheden in. Ook is er tijd nodig om de data-architectuur en -structuur op orde te brengen en houden. We conformeren ons aan standaarden en we bewaken de datakwaliteit; kortom binnen het DCC werken we 'netjes'.",
        "Datum gevonden": "2024-02-15",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Handel",
        "Organisatiegrootte": "500-999",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 2,
        "full_text": "Data engineer\n\nRochdale zet zich in voor sterke buurten, waar inwoners meer kansen hebben. We bouwen, verduurzamen en maken kwetsbare buurten sterker. Jij kunt hier een mooie bijdrage aan leveren vanuit jouw rol als data engineer. Je bent verantwoordelijk voor de ETL-processen waardoor de organisatie elke dag de beschikking heeft over actuele informatie. Je bent op de hoogte van de laatste technologische ontwikkelingen, zoals op het gebied van\n\n   GenAI en bent in staat deze te vertalen naar bruikbare toepassingen voor onze (eind)gebruikers. Daarnaast focus jij je op onze Lakehouse constructie in de Microsoft Azure omgeving en zorgt voor de doorontwikkeling ervan. Python en SQL zijn bekende termen voor jou en ook het toepassen van CI/CD methodologieën zijn jou niet onbekend.\n\n   De afdeling waar je komt te werken is het Data Competence Center (DCC) binnen de afdeling Digitalisering & Informatievoorziening en bestaat uit twee data-specialisten en een datamanager. Het DCC maakt gebruik van de modernste Microsoft Azure tooling waaronder PowerBI, Azure DevOps, Data Lake en Synapse Analytics. Het DCC werkt volgens de scrum methodiek en ontwikkelt met behulp van DevOps. De afdeling Digitalisering & Informatievoorziening heeft zich de afgelopen jaren meer en meer ontwikkeld naar een regie-organisatie, die enerzijds de (veranderende) behoefte vanuit de business ophaalt en ordent en anderzijds de dienstverlening door externe IT-dienstverleners regisseert, zodat deze aansluit op de behoefte van de business. Wij zoeken een collega die warm loopt als engineer voor het neerzetten, onderhouden en verder optimaliseren van ons data-infrastructuur.\n\n   Jouw werkdag\n   Eerst een kop koffie halen op 5, waar de barista van de espressobar voor je klaar staat. Dan start de dag met een standup met het DCC-team. De uitdagingen voor het team zijn groot: hoe gaan we in gesprek met onze collega's om duidelijk te krijgen welke behoefte aan (stuur)informatie er is en hoe kunnen we dit vormgeven met onze data en technieken. Met als perspectief uiteraard hoe deze stuurinformatie bijdraagt aan onze strategische doelen en het verschil gaat maken voor de collega's en onze huurders. Jij als data engineer adviseert over nieuwe technologische toepassingen en ontwikkelingen en neemt het team mee in het optimaliseren van de bestaande technieken en processen. Naast adviseren ga je ook aan de slag met het daadwerkelijk uitwerken en implementeren van deze nieuwe initiatieven en ontwikkelingen.\n\n   Als data engineer ben je gesprekspartner voor het team DCC en de D&I afdeling, je doet analyses en komt met voorstellen. Samenwerken met collega's en meedoen in projecten is vanzelfsprekend. Je brengt hier je kennis en expertise over technologische mogelijkheden in. Ook is er tijd nodig om de data-architectuur en -structuur op orde te brengen en houden. We conformeren ons aan standaarden en we bewaken de datakwaliteit; kortom binnen het DCC werken we 'netjes'."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job title is 'Data Engineer' and the primary responsibilities focus on ETL processes, data infrastructure, and Lakehouse construction within Azure. While GenAI is mentioned as a technology to be aware of and translate into applications, the core duties and technologies described (Python, SQL, Azure tooling like Data Lake and Synapse Analytics, CI/CD, DevOps) are more aligned with traditional data engineering and MLOps rather than specialized GenAI development. The role emphasizes data infrastructure and information provision for business users, not the development or fine-tuning of generative models themselves. Therefore, it does not fit the specific criteria for a GenAI Engineer or ML Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The description explicitly states the role is responsible for ETL processes, managing a Lakehouse construction, and ensuring the organization has up-to-date information, which are core data engineering functions.",
                    "phrase": "verantwoordelijk voor de ETL-processen waardoor de organisatie elke dag de beschikking heeft over actuele informatie"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Focusing on the Lakehouse construction in Azure and its further development directly relates to data infrastructure and engineering.",
                    "phrase": "focus jij je op onze Lakehouse constructie in de Microsoft Azure omgeving en zorgt voor de doorontwikkeling ervan"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The mention of applying CI/CD methodologies and working with DevOps aligns with operations engineering practices for software and data pipelines.",
                    "phrase": "het toepassen van CI/CD methodologieën zijn jou niet onbekend"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Working with Azure DevOps is a direct indicator of MLOps practices.",
                    "phrase": "Azure DevOps"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves understanding business needs for information and translating them into data solutions, aligning technical work with strategic goals.",
                    "phrase": "hoe deze stuurinformatie bijdraagt aan onze strategische doelen en het verschil gaat maken voor de collega's en onze huurders"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The description highlights the need to gather and organize changing business needs and ensure services align with business requirements.",
                    "phrase": "de (veranderende) behoefte vanuit de business ophaalt en ordent en anderzijds de dienstverlening door externe IT-dienstverleners regisseert, zodat deze aansluit op de behoefte van de business"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "While not the primary focus, the role involves implementing new initiatives and developments, which can include software components for data applications.",
                    "phrase": "ga je ook aan de slag met het daadwerkelijk uitwerken en implementeren van deze nieuwe initiatieven en ontwikkelingen"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The mention of GenAI and translating it into usable applications suggests some level of model application or integration, though not necessarily deep model development.",
                    "phrase": "GenAI en bent in staat deze te vertalen naar bruikbare toepassingen voor onze (eind)gebruikers"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "Advising on new technological applications and optimizing existing techniques and processes can involve aspects of model selection or improvement.",
                    "phrase": "adviseert over nieuwe technologische toepassingen en ontwikkelingen en neemt het team mee in het optimaliseren van de bestaande technieken en processen"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "Ensuring the data architecture and structure are in order relates to the foundational software engineering aspects of data systems.",
                    "phrase": "de data-architectuur en -structuur op orde te brengen en houden"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "gesprekspartner voor het team DCC en de D&I afdeling"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Samenwerken met collega's en meedoen in projecten is vanzelfsprekend"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "De uitdagingen voor het team zijn groot: hoe gaan we in gesprek met onze collega's om duidelijk te krijgen welke behoefte aan (stuur)informatie er is en hoe kunnen we dit vormgeven met onze data en technieken."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "neemt het team mee in het optimaliseren van de bestaande technieken en processen"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "het neerzetten, onderhouden en verder optimaliseren van ons data-infrastructuur"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Je bent op de hoogte van de laatste technologische ontwikkelingen"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "GenAI"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "Python"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "SQL"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "Microsoft Azure"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "CI/CD"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "DevOps"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "Azure DevOps"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "Data Lake"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "Synapse Analytics"
                },
                {
                    "category": "TECH7: Data Visualization",
                    "phrase": "PowerBI"
                }
            ]
        }
    }
}