{
    "job_id": 1046,
    "job_details": {
        "job_id": 1046,
        "Organisatienaam": "Witteveen+Bos N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Full stack AI developer",
        "Standplaats": "Deventer",
        "Vacaturelink (origineel)": "magnet.me",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Full stack developer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "De opkomst van AI-technologie markeert een nieuw tijdperk, waarvan wij als Witteveen+Bos de meerwaarde optimaal willen benutten. Om ons groeiende AI-team te versterken zoeken wij een full stack AI developer.\n\n   Idealiter ben jij als een Zwitsers zakmes op het gebied van generatieve AI. Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end. En ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI.\n\n   In je rol als full stack AI developer fungeer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers.\n\n   Samen met de ingenieurs en adviseurs signaleer je kansen voor het inzetten van AI, breng je vragen en wensen in kaart en analyseer je processen. Deze bevindingen zet je vervolgens om in passende AI-applicaties met technieken als Retrieval Augmented Generation (RAG) en Agentic Frameworks.\n\nProduct-Marktcombinatie\n\n   Je wordt onderdeel van de afdeling Informatiemanagement en digital support (IMDS). Deze afdeling helpt de Witteveen+Bos organisatie haar ambities te realiseren op het vlak van datagedreven en digitaal werken, onder meer met behulp van AI. De afdeling is gericht op het ondersteunen bij de veranderopgaven van de organisatie en op het optimaliseren van de informatievoorziening aan de gebruikers. De afdeling is daarnaast verantwoordelijk voor integraal projectmanagement binnen de bedrijfsvoering, business intelligence en data-analyse en het implementeren van het werken onder architectuur.",
        "Datum gevonden": "2025-01-29",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Zakelijke dienstverlening",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 1,
        "full_text": "Full stack AI developer\n\nDe opkomst van AI-technologie markeert een nieuw tijdperk, waarvan wij als Witteveen+Bos de meerwaarde optimaal willen benutten. Om ons groeiende AI-team te versterken zoeken wij een full stack AI developer.\n\n   Idealiter ben jij als een Zwitsers zakmes op het gebied van generatieve AI. Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end. En ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI.\n\n   In je rol als full stack AI developer fungeer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers.\n\n   Samen met de ingenieurs en adviseurs signaleer je kansen voor het inzetten van AI, breng je vragen en wensen in kaart en analyseer je processen. Deze bevindingen zet je vervolgens om in passende AI-applicaties met technieken als Retrieval Augmented Generation (RAG) en Agentic Frameworks.\n\nProduct-Marktcombinatie\n\n   Je wordt onderdeel van de afdeling Informatiemanagement en digital support (IMDS). Deze afdeling helpt de Witteveen+Bos organisatie haar ambities te realiseren op het vlak van datagedreven en digitaal werken, onder meer met behulp van AI. De afdeling is gericht op het ondersteunen bij de veranderopgaven van de organisatie en op het optimaliseren van de informatievoorziening aan de gebruikers. De afdeling is daarnaast verantwoordelijk voor integraal projectmanagement binnen de bedrijfsvoering, business intelligence en data-analyse en het implementeren van het werken onder architectuur."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description emphasizes building AI applications using generative AI techniques like RAG and Agentic Frameworks, acting as a bridge between business experts and AI developers, and developing user-facing software systems. This aligns strongly with the definition and core responsibilities of a GenAI Engineer, particularly the focus on generative models and application development."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves acting as a connector between domain experts and the AI team, identifying opportunities for AI, and mapping out business needs and wishes. This requires understanding the business context and translating it into technical requirements.",
                    "phrase": "fungeer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers. Samen met de ingenieurs en adviseurs signaleer je kansen voor het inzetten van AI, breng je vragen en wensen in kaart en analyseer je processen."
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The description explicitly mentions using techniques like Retrieval Augmented Generation (RAG) and Agentic Frameworks to create AI applications, which falls under the core process of adapting and implementing generative AI models.",
                    "phrase": "Deze bevindingen zet je vervolgens om in passende AI-applicaties met technieken als Retrieval Augmented Generation (RAG) en Agentic Frameworks."
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role is described as a 'full stack AI developer' with knowledge of both front-end and back-end, and the responsibility to convert findings into 'AI applications'. This indicates a focus on building and integrating AI into software systems.",
                    "phrase": "Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end. ...zet je vervolgens om in passende AI-applicaties"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "While not explicitly detailed, the mention of 'production-grade' systems and the need to deploy and maintain AI applications implies MLOps responsibilities, which are inherent in a full-stack AI development role.",
                    "phrase": "bouwen en onderhouden van production-grade user-facing software systems"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "fungeer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers."
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI."
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "signaleer je kansen voor het inzetten van AI, breng je vragen en wensen in kaart en analyseer je processen. Deze bevindingen zet je vervolgens om in passende AI-applicaties"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end."
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "generatieve AI"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "Retrieval Augmented Generation (RAG)"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "Agentic Frameworks"
                }
            ]
        }
    }
}