{
    "job_id": 361,
    "job_details": {
        "job_id": 361,
        "Organisatienaam": "SubAdvies",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Stage AI & Automation Engineer",
        "Standplaats": "Groningen",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Stage / afstudeerplaats / bbl (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Tijdens je afstudeerstage krijg je de kans om diep in de wereld van AI te duiken en bij te dragen aan innovatieve oplossingen. Je onderzoekt en ontwikkelt AI-modellen die onze dienstverlening slimmer en efficiënter maken. Denk aan het optimaliseren van een AI-gestuurde inbox binnen ons eigen ontwikkelde platform, waarmee klanten snel en overzichtelijk hun data kunnen analyseren.\n       Daarnaast experimenteer je met generatieve AI om klantvragen sneller en gemakkelijker te beantwoorden en waardevolle inzichten te genereren. Je implementeert en test nieuwe algoritmen die data-analyse versnellen en verbeteren, zodat onze klanten beter en sneller de juiste (strategische) beslissingen kunnen nemen.\n       Je werkt nauw samen met onze data-experts en softwareontwikkelaars om AI-oplossingen naadloos te integreren in onze systemen. Jouw frisse blik en technische kennis dragen bij aan de verdere ontwikkeling van ons platform. Tot slot presenteer je je bevindingen en aanbevelingen aan het team, zodat we samen de impact van AI binnen SubAdvies kunnen vergroten.",
        "Datum gevonden": "2025-03-14",
        "Beroepsgroep": "Overige beroepen",
        "Beroepsklasse": "Overig",
        "Contracttype": "Stage / Afstudeerplaats",
        "Parttime / fulltime": "Parttime (≤ 32 uur)",
        "Branche": "Zakelijke dienstverlening",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 3,
        "full_text": "Stage AI & Automation Engineer\n\nTijdens je afstudeerstage krijg je de kans om diep in de wereld van AI te duiken en bij te dragen aan innovatieve oplossingen. Je onderzoekt en ontwikkelt AI-modellen die onze dienstverlening slimmer en efficiënter maken. Denk aan het optimaliseren van een AI-gestuurde inbox binnen ons eigen ontwikkelde platform, waarmee klanten snel en overzichtelijk hun data kunnen analyseren.\n       Daarnaast experimenteer je met generatieve AI om klantvragen sneller en gemakkelijker te beantwoorden en waardevolle inzichten te genereren. Je implementeert en test nieuwe algoritmen die data-analyse versnellen en verbeteren, zodat onze klanten beter en sneller de juiste (strategische) beslissingen kunnen nemen.\n       Je werkt nauw samen met onze data-experts en softwareontwikkelaars om AI-oplossingen naadloos te integreren in onze systemen. Jouw frisse blik en technische kennis dragen bij aan de verdere ontwikkeling van ons platform. Tot slot presenteer je je bevindingen en aanbevelingen aan het team, zodat we samen de impact van AI binnen SubAdvies kunnen vergroten."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "confidence_score": 4,
            "rationale": "The job description emphasizes developing and optimizing AI models, specifically mentioning generative AI for customer interaction and insight generation. It also highlights integrating AI solutions into existing platforms and working with LLM frameworks, aligning well with the GenAI Engineer profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "phrase": "onderzoekt en ontwikkelt AI-modellen die onze dienstverlening slimmer en efficiënter maken",
                    "category": "TASK3: Modeling",
                    "justification": "This phrase directly refers to the research and development of AI models, which is the core of the Modeling task."
                },
                {
                    "phrase": "optimaliseren van een AI-gestuurde inbox binnen ons eigen ontwikkelde platform",
                    "category": "TASK4: Software Development",
                    "justification": "Optimizing an AI-driven inbox within a platform implies building or enhancing user-facing software components where AI is integrated."
                },
                {
                    "phrase": "waarmee klanten snel en overzichtelijk hun data kunnen analyseren",
                    "category": "TASK4: Software Development",
                    "justification": "This describes a user-facing functionality of the platform, indicating software development for customer use."
                },
                {
                    "phrase": "experimenteer je met generatieve AI om klantvragen sneller en gemakkelijker te beantwoorden en waardevolle inzichten te genereren",
                    "category": "TASK3: Modeling",
                    "justification": "This explicitly mentions experimenting with generative AI for specific tasks like answering customer queries and generating insights, which falls under model development and application."
                },
                {
                    "phrase": "implementeert en test nieuwe algoritmen die data-analyse versnellen en verbeteren",
                    "category": "TASK3: Modeling",
                    "justification": "Implementing and testing new algorithms for data analysis is a direct description of modeling activities."
                },
                {
                    "phrase": "zodat onze klanten beter en sneller de juiste (strategische) beslissingen kunnen nemen",
                    "category": "TASK1: Business Understanding",
                    "justification": "This phrase connects the technical work to business outcomes and strategic decision-making for clients."
                },
                {
                    "phrase": "Je werkt nauw samen met onze data-experts en softwareontwikkelaars om AI-oplossingen naadloos te integreren in onze systemen",
                    "category": "TASK4: Software Development",
                    "justification": "Integrating AI solutions into systems involves software development and engineering practices."
                },
                {
                    "phrase": "Jouw frisse blik en technische kennis dragen bij aan de verdere ontwikkeling van ons platform",
                    "category": "TASK4: Software Development",
                    "justification": "Contributing to the further development of a platform implies software development efforts."
                },
                {
                    "phrase": "presenteer je bevindingen en aanbevelingen aan het team",
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "Presenting findings and recommendations is a form of communication and collaboration with the team."
                },
                {
                    "phrase": "samen de impact van AI binnen SubAdvies kunnen vergroten",
                    "category": "TASK1: Business Understanding",
                    "justification": "This highlights the business goal of increasing AI's impact within the company."
                }
            ],
            "technologies": [
                {
                    "phrase": "AI-gestuurde inbox",
                    "category": "TECH3: LLM / Generative Models",
                    "justification": "An AI-driven inbox likely utilizes generative AI or LLMs for processing and responding to inputs."
                },
                {
                    "phrase": "generatieve AI",
                    "category": "TECH3: LLM / Generative Models",
                    "justification": "Explicit mention of generative AI."
                },
                {
                    "phrase": "algoritmen",
                    "category": "TECH10: Data Modeling",
                    "justification": "Algorithms are fundamental to machine learning models."
                }
            ],
            "soft_skills": [
                {
                    "phrase": "onderzoekt en ontwikkelt AI-modellen",
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "Researching and developing models implies a need for continuous learning and adaptation in a fast-evolving field."
                },
                {
                    "phrase": "experimenteer je met generatieve AI",
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "Experimentation with new technologies like generative AI demonstrates a commitment to learning and adaptability."
                },
                {
                    "phrase": "implementeert en test nieuwe algoritmen",
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "justification": "Implementing and testing new algorithms to improve data analysis suggests a problem-solving and pragmatic approach."
                },
                {
                    "phrase": "Je werkt nauw samen met onze data-experts en softwareontwikkelaars",
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "Working closely with other experts and developers indicates strong collaboration skills."
                },
                {
                    "phrase": "Jouw frisse blik en technische kennis",
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "A 'fresh perspective' and technical knowledge suggest an innovative mindset and potential for ownership."
                },
                {
                    "phrase": "presenteer je bevindingen en aanbevelingen aan het team",
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "Presenting findings and recommendations is a key aspect of communication and collaboration."
                }
            ]
        }
    }
}