{
    "job_id": 938,
    "job_details": {
        "job_id": 938,
        "Organisatienaam": "Microsoft B.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior Telemetry Data Engineer",
        "Standplaats": null,
        "Vacaturelink (origineel)": "dejobs.org",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Are you passionate about cloud computing? Do you get excited about taking a hands-on approach to transforming Microsoft's most critical business through investigation, data analysis, and automation? If so, come and help us build the most reliable & efficient datacenter infrastructure on the planet. The CO+I Critical Environment Systems Intelligence (CESI) team is responsible for designing and delivering solutions to support global datacenter operations and to improve availability. CESI is helping to drive CO+I's transition to a customer centric, data driven, observability based, live service culture. As a Data Engineer, you will be a key player in this transition.   \n\n   As a Senior Data Engineer on the CO+I Critical Environment Service Intelligence (CESI) team, you partner and collaborate on the design and delivery of automated solutions to monitor, detect, and alert on data center critical environment mechanical and electrical resources. You will collaborate with other CO+I teams to contribute and benefit from their work to ensure that we are constantly improving across the fleet. You will work with massive amounts of data with low latency requirements across cutting edge technologies, with the potential for significant impact to both internal partners and external customers.\n\n   In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day., As a Senior Technical Program Manager in DC Critical Environments, you will:\n     * Drive a program that covers end-to-endmonitoring, and processing of critical environment (CE) infrastructure telemetry for all leased sites, to bring those sites on par with owneddatacenter sites.\n     * Design and implement telemetry data ingestion and data processing systems for leased sites.\n     * Prototype, pilot, and deploy multi-signal anomaly detection and prevention systemsleveraging machine learning and statistical analysis for DC leased sites\n     * Define and drive an operationalization plan for the telemetry pipeline for leased sites.\n     * Ensure interoperability of detection methods, systems, and workflows by defining conceptual, logical, and physical data models.\n     * Understand the signals coming from the EPMS and BAS systems for leased sites.\n     * Ensure high percent coverage and mapping of leased site signals including thermal, power, and other environmental conditions and data.\n     * Define a set of reusable primitives for mapping logical and physical topology of data centers leased sites.\n     * Ensure there is a high-frequency, high-volume, low-latency streaming and micro-batching capable pipeline to process DC CE telemetry from leased sites.\n     * Architect a staging model to ensure the onboarding of leased sites CE telemetry (thermal, power, and other environmental subjects)., About Us: We are committed to maintaining the highest standards of operational excellence in our data centers. Join us in our mission to enhance our telemetry capabilities and ensure the reliability and efficiency of our critical environments.",
        "Datum gevonden": "2024-12-19",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Handel",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 12,
        "full_text": "Senior Telemetry Data Engineer\n\nAre you passionate about cloud computing? Do you get excited about taking a hands-on approach to transforming Microsoft's most critical business through investigation, data analysis, and automation? If so, come and help us build the most reliable & efficient datacenter infrastructure on the planet. The CO+I Critical Environment Systems Intelligence (CESI) team is responsible for designing and delivering solutions to support global datacenter operations and to improve availability. CESI is helping to drive CO+I's transition to a customer centric, data driven, observability based, live service culture. As a Data Engineer, you will be a key player in this transition.   \n\n   As a Senior Data Engineer on the CO+I Critical Environment Service Intelligence (CESI) team, you partner and collaborate on the design and delivery of automated solutions to monitor, detect, and alert on data center critical environment mechanical and electrical resources. You will collaborate with other CO+I teams to contribute and benefit from their work to ensure that we are constantly improving across the fleet. You will work with massive amounts of data with low latency requirements across cutting edge technologies, with the potential for significant impact to both internal partners and external customers.\n\n   In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day., As a Senior Technical Program Manager in DC Critical Environments, you will:\n     * Drive a program that covers end-to-endmonitoring, and processing of critical environment (CE) infrastructure telemetry for all leased sites, to bring those sites on par with owneddatacenter sites.\n     * Design and implement telemetry data ingestion and data processing systems for leased sites.\n     * Prototype, pilot, and deploy multi-signal anomaly detection and prevention systemsleveraging machine learning and statistical analysis for DC leased sites\n     * Define and drive an operationalization plan for the telemetry pipeline for leased sites.\n     * Ensure interoperability of detection methods, systems, and workflows by defining conceptual, logical, and physical data models.\n     * Understand the signals coming from the EPMS and BAS systems for leased sites.\n     * Ensure high percent coverage and mapping of leased site signals including thermal, power, and other environmental conditions and data.\n     * Define a set of reusable primitives for mapping logical and physical topology of data centers leased sites.\n     * Ensure there is a high-frequency, high-volume, low-latency streaming and micro-batching capable pipeline to process DC CE telemetry from leased sites.\n     * Architect a staging model to ensure the onboarding of leased sites CE telemetry (thermal, power, and other environmental subjects)., About Us: We are committed to maintaining the highest standards of operational excellence in our data centers. Join us in our mission to enhance our telemetry capabilities and ensure the reliability and efficiency of our critical environments."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description heavily emphasizes data engineering tasks, including designing and implementing telemetry data ingestion and processing systems, working with massive amounts of data with low latency requirements, and building high-frequency, high-volume, low-latency streaming pipelines. It also mentions prototyping, piloting, and deploying anomaly detection and prevention systems leveraging machine learning and statistical analysis. While it involves software development for data pipelines and systems, the core focus is on data processing, modeling for anomaly detection, and operationalizing these systems, aligning with the 'ML Engineer' profile's emphasis on data-driven predictive models and MLOps."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The role involves designing and implementing telemetry data ingestion and data processing systems, working with massive amounts of data with low latency requirements, and ensuring a high-frequency, high-volume, low-latency streaming and micro-batching capable pipeline.",
                    "phrase": "Design and implement telemetry data ingestion and data processing systems"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The role requires ensuring high percent coverage and mapping of leased site signals including thermal, power, and other environmental conditions and data.",
                    "phrase": "Ensure high percent coverage and mapping of leased site signals including thermal, power, and other environmental conditions and data"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The role involves defining a set of reusable primitives for mapping logical and physical topology of data centers leased sites.",
                    "phrase": "Define a set of reusable primitives for mapping logical and physical topology of data centers leased sites"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The role requires architecting a staging model to ensure the onboarding of leased sites CE telemetry.",
                    "phrase": "Architect a staging model to ensure the onboarding of leased sites CE telemetry"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The role involves prototyping, piloting, and deploying multi-signal anomaly detection and prevention systems leveraging machine learning and statistical analysis.",
                    "phrase": "Prototype, pilot, and deploy multi-signal anomaly detection and prevention systems leveraging machine learning and statistical analysis"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role requires driving a program that covers end-to-end monitoring, and processing of critical environment (CE) infrastructure telemetry.",
                    "phrase": "Drive a program that covers end-to-end monitoring, and processing of critical environment (CE) infrastructure telemetry"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The role requires defining and driving an operationalization plan for the telemetry pipeline for leased sites.",
                    "phrase": "Define and drive an operationalization plan for the telemetry pipeline for leased sites"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role is described as transforming Microsoft's critical business through investigation, data analysis, and automation, and improving availability of global datacenter operations.",
                    "phrase": "Transforming Microsoft's most critical business through investigation, data analysis, and automation"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role aims to improve availability of global datacenter operations and drive CO+I's transition to a customer centric, data driven, observability based, live service culture.",
                    "phrase": "Improve availability of global datacenter operations and to improve availability"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "partner and collaborate on the design and delivery of automated solutions"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Collaborate with other CO+I teams"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "investigation, data analysis, and automation"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "taking a hands-on approach"
                }
            ],
            "technologies": [
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "data analysis"
                },
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "data models"
                }
            ]
        }
    }
}