{
    "job_id": 1095,
    "job_details": {
        "job_id": 1095,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD",
        "Standplaats": "Rotterdam",
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Are you a forward-thinking developer eager to harness the power of GenAI to redefine business standards and enhance productivity? Are you bored of solving the same customer support tickets or resolving the same bugs over and over again?, * Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality",
        "Datum gevonden": "2024-08-01",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Cultuur / Recreatie",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD\n\nAre you a forward-thinking developer eager to harness the power of GenAI to redefine business standards and enhance productivity? Are you bored of solving the same customer support tickets or resolving the same bugs over and over again?, * Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "confidence_score": 5,
            "rationale": "The job description heavily emphasizes building and improving autonomous support platforms using LLMs, integrating state-of-the-art AI technologies like GPT-4 Vision, and enhancing AI solutions across infrastructures like AWS. This aligns directly with the core responsibilities and typical projects of a GenAI Engineer focused on language, vision, and interaction specialists."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task_name": "Modeling",
                    "phrases": [
                        "Create and improve autonomous support platforms using LLMs",
                        "Test and integrate state-of-the-art AI technologies, like GPT-4 Vision",
                        "Evaluate and enhance the performance and integration of AI solutions"
                    ],
                    "justification": "These phrases directly relate to the development, integration, and enhancement of AI models, specifically LLMs and vision models, which is the core of the Modeling task."
                },
                {
                    "task_name": "Software Development",
                    "phrases": [
                        "Create and improve autonomous support platforms",
                        "development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets",
                        "creating an assistant able to guide customers through an upgrade process",
                        "providing support and guidance for internal teams on how to best utilize these technologies within their workflows",
                        "ensures support is available for end-users experiencing issues"
                    ],
                    "justification": "These phrases describe the practical application of AI technologies into functional platforms and systems, including development, maintenance, and user support, which falls under Software Development."
                },
                {
                    "task_name": "Operations Engineering (MLOps)",
                    "phrases": [
                        "troubleshooting, maintaining, and updating tools based on user feedback and support tickets",
                        "Evaluate and enhance the performance and integration of AI solutions across different infrastructures",
                        "ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction"
                    ],
                    "justification": "The emphasis on troubleshooting, maintaining, updating, evaluating performance, and ensuring high service quality in production environments points to Operations Engineering (MLOps) responsibilities."
                },
                {
                    "task_name": "Business Understanding",
                    "phrases": [
                        "harness the power of GenAI to redefine business standards and enhance productivity",
                        "Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
                    ],
                    "justification": "These phrases highlight the alignment of AI initiatives with business goals such as redefining standards, enhancing productivity, improving client support, and boosting innovation capacity."
                }
            ],
            "technologies": [
                {
                    "tech_name": "GPT-4 Vision",
                    "category": "TECH3: LLM / Generative Models"
                },
                {
                    "tech_name": "Amazon CodeWhisperer",
                    "category": "TECH2: Cloud Platforms & Services"
                },
                {
                    "tech_name": "AWS",
                    "category": "TECH2: Cloud Platforms & Services"
                },
                {
                    "tech_name": "LLMs",
                    "category": "TECH3: LLM / Generative Models"
                }
            ],
            "soft_skills": [
                {
                    "skill_name": "Learning & Adaptability",
                    "phrases": [
                        "forward-thinking developer eager to harness the power of GenAI"
                    ],
                    "justification": "The phrase 'forward-thinking developer eager to harness the power of GenAI' suggests a proactive approach to learning and adopting new AI technologies."
                },
                {
                    "skill_name": "Problem Solving & Pragmatism",
                    "phrases": [
                        "bored of solving the same customer support tickets or resolving the same bugs over and over again",
                        "troubleshooting, maintaining, and updating tools based on user feedback and support tickets",
                        "ensures support is available for end-users experiencing issues"
                    ],
                    "justification": "The mention of being bored with repetitive tasks and the focus on troubleshooting, maintenance, and ensuring end-user support indicate a problem-solving orientation and a pragmatic approach to improving systems."
                },
                {
                    "skill_name": "Communication & Collaboration",
                    "phrases": [
                        "providing support and guidance for internal teams on how to best utilize these technologies within their workflows"
                    ],
                    "justification": "Providing support and guidance to internal teams implies a need for clear communication and collaboration to ensure effective technology adoption."
                },
                {
                    "skill_name": "Innovation & Ownership",
                    "phrases": [
                        "redefine business standards",
                        "significantly boosting the company's innovation capacity"
                    ],
                    "justification": "The phrases 'redefine business standards' and 'boosting the company's innovation capacity' suggest a role that requires initiative, ownership, and a drive for innovation."
                }
            ]
        }
    }
}