{
    "job_id": 910,
    "job_details": {
        "job_id": 910,
        "Organisatienaam": "GitHub",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior Solutions Engineer",
        "Standplaats": null,
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Solutions architect (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "About GitHub: As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code.\n   Locations: In this role you can work from Remote, Netherlands\n   Overview:\n\n   GitHub helps companies and organizations succeed by allowing them to build better software, together. We're looking for experienced Solutions Engineers to provide technical sales support for our rapidly-growing customer base in the Nordics and beyond.\n\n   Our Senior Solutions Engineers are responsible for the technical relationships with customers and prospects, working as trusted advisors to remove technical objections and creatively address pain points in a customer's SDLC. They will work internally with sales, product development, and industry experts to identify solutions that meet customers' business needs and drive digital transformation initiatives. They advocate for customer interests and align our offerings to meet customer goals effectively, and proactively maintain broad knowledge of GitHub's product landscape and solutions.\n\n   We're extremely passionate about the quality of our work. If you're always curious to find new solutions, ambitious and dedicated to solving customers problems, you might be a fit for this role!\n\n   Responsibilities:\n\n   Technology Strategy Formulation\n     * Lead the Technical Sales Process: Own all technical aspects of the sales cycle, from discovery to qualification to proof-of-concept design/execution, and ensure a smooth transition to post-sales teams.\n     * Identify Customer Requirements: Synthesize customer business and technical needs, align them with GitHub solutions, and support digital transformation goals through innovative product features and best practices.\n\n   Sales Partnership\n     * Collaborate on Strategy: Build joint strategies with enterprise sales, customer success, Field CTO, and product teams, leveraging deep industry insights to drive product adoption and enhance customer experience.\n\n   Trusted Advisor\n     * Be a strategic advisor: Act as a technical advocate and advisor, guiding customers through complex technical scenarios, including migrations from existing tools. Establish relationships with key decision-makers, offer strategic advice on secure software development practices, and communicate the benefits of embedding DevSecOps and AI throughout the customer's technology landscape.\n     * Showcase our products: Conduct (live) demos of GitHub's products, integrating broader industry trends (e.g., AI, DevSecOps) and tools into tailored customer scenarios.\n\n   Customer and Industry Insights\n     * Industry and Product Knowledge: Maintain an up-to-date understanding of GitHub's product landscape, emerging trends in developer tools (e.g., Generative AI), and customer-specific challenges. Provide coaching and insights to internal teams based on industry expertise.\n     * Proactive Customer Advocate Gather and share customer feedback internally to advocate for their needs and influence GitHub's product roadmap. Address customer pain points by leveraging a strong understanding of GitHub's extensible platform and integrations.\n\n   Customer Enablement\n     * Drive Customer Readiness: Leverage technical resources and enablement programs to accelerate customer adoption and integration of GitHub's solutions during the pre-sales process and communicating customer's technical goals to guide post-sales teams to successful outcomes.\n\n   Marketing\n     * Support Industry Events and Marketing: Contribute to the creation of technical content for marketing initiatives, and actively participate as a speaker at industry events and conferences, showcasing GitHub's capabilities and sharing best practices with the broader community.",
        "Datum gevonden": "2024-12-17",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 12,
        "full_text": "Senior Solutions Engineer\n\nAbout GitHub: As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code.\n   Locations: In this role you can work from Remote, Netherlands\n   Overview:\n\n   GitHub helps companies and organizations succeed by allowing them to build better software, together. We're looking for experienced Solutions Engineers to provide technical sales support for our rapidly-growing customer base in the Nordics and beyond.\n\n   Our Senior Solutions Engineers are responsible for the technical relationships with customers and prospects, working as trusted advisors to remove technical objections and creatively address pain points in a customer's SDLC. They will work internally with sales, product development, and industry experts to identify solutions that meet customers' business needs and drive digital transformation initiatives. They advocate for customer interests and align our offerings to meet customer goals effectively, and proactively maintain broad knowledge of GitHub's product landscape and solutions.\n\n   We're extremely passionate about the quality of our work. If you're always curious to find new solutions, ambitious and dedicated to solving customers problems, you might be a fit for this role!\n\n   Responsibilities:\n\n   Technology Strategy Formulation\n     * Lead the Technical Sales Process: Own all technical aspects of the sales cycle, from discovery to qualification to proof-of-concept design/execution, and ensure a smooth transition to post-sales teams.\n     * Identify Customer Requirements: Synthesize customer business and technical needs, align them with GitHub solutions, and support digital transformation goals through innovative product features and best practices.\n\n   Sales Partnership\n     * Collaborate on Strategy: Build joint strategies with enterprise sales, customer success, Field CTO, and product teams, leveraging deep industry insights to drive product adoption and enhance customer experience.\n\n   Trusted Advisor\n     * Be a strategic advisor: Act as a technical advocate and advisor, guiding customers through complex technical scenarios, including migrations from existing tools. Establish relationships with key decision-makers, offer strategic advice on secure software development practices, and communicate the benefits of embedding DevSecOps and AI throughout the customer's technology landscape.\n     * Showcase our products: Conduct (live) demos of GitHub's products, integrating broader industry trends (e.g., AI, DevSecOps) and tools into tailored customer scenarios.\n\n   Customer and Industry Insights\n     * Industry and Product Knowledge: Maintain an up-to-date understanding of GitHub's product landscape, emerging trends in developer tools (e.g., Generative AI), and customer-specific challenges. Provide coaching and insights to internal teams based on industry expertise.\n     * Proactive Customer Advocate Gather and share customer feedback internally to advocate for their needs and influence GitHub's product roadmap. Address customer pain points by leveraging a strong understanding of GitHub's extensible platform and integrations.\n\n   Customer Enablement\n     * Drive Customer Readiness: Leverage technical resources and enablement programs to accelerate customer adoption and integration of GitHub's solutions during the pre-sales process and communicating customer's technical goals to guide post-sales teams to successful outcomes.\n\n   Marketing\n     * Support Industry Events and Marketing: Contribute to the creation of technical content for marketing initiatives, and actively participate as a speaker at industry events and conferences, showcasing GitHub's capabilities and sharing best practices with the broader community."
    },
    "analysis": {
        "job_profile_classification": {
            "profile": "Ambiguous / Not Relevant",
            "confidence_score": 2,
            "rationale": "The role focuses heavily on technical sales support, customer advisory, and understanding customer needs in relation to GitHub's platform. While it mentions AI and DevSecOps as areas of customer interest, it does not involve direct development, modeling, or engineering of AI systems. The core responsibilities are sales-oriented rather than hands-on AI development."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task_category": "TASK1: Business Understanding",
                    "phrases": [
                        {
                            "phrase": "provide technical sales support for our rapidly-growing customer base",
                            "justification": "This phrase indicates the role's primary function is to support sales efforts by providing technical expertise, which requires understanding business needs and how technical solutions can meet them."
                        },
                        {
                            "phrase": "responsible for the technical relationships with customers and prospects",
                            "justification": "Building and maintaining technical relationships with customers is a business-oriented task that requires understanding their strategic and operational goals."
                        },
                        {
                            "phrase": "creatively address pain points in a customer's SDLC",
                            "justification": "Identifying and solving customer pain points within their Software Development Lifecycle (SDLC) requires a deep understanding of their business processes and challenges."
                        },
                        {
                            "phrase": "work internally with sales, product development, and industry experts to identify solutions that meet customers' business needs",
                            "justification": "This explicitly states the need to understand customer business needs and align technical solutions accordingly."
                        },
                        {
                            "phrase": "drive digital transformation initiatives",
                            "justification": "Digital transformation is a business strategy, and the role is tasked with supporting it through technical solutions."
                        },
                        {
                            "phrase": "advocate for customer interests and align our offerings to meet customer goals effectively",
                            "justification": "Aligning product offerings with customer goals and advocating for their interests are core business-focused responsibilities."
                        },
                        {
                            "phrase": "Lead the Technical Sales Process",
                            "justification": "Owning the technical aspects of the sales cycle requires understanding business objectives and translating them into technical proposals."
                        },
                        {
                            "phrase": "Synthesize customer business and technical needs, align them with GitHub solutions",
                            "justification": "This directly points to understanding business needs and mapping them to technical solutions."
                        },
                        {
                            "phrase": "support digital transformation goals",
                            "justification": "This reinforces the role's connection to overarching business strategies."
                        },
                        {
                            "phrase": "Build joint strategies with enterprise sales, customer success, Field CTO, and product teams",
                            "justification": "Developing strategies with various business and technical teams requires understanding business objectives and market positioning."
                        },
                        {
                            "phrase": "drive product adoption and enhance customer experience",
                            "justification": "Product adoption and customer experience are business outcomes that the role aims to influence."
                        },
                        {
                            "phrase": "Maintain an up-to-date understanding of GitHub's product landscape, emerging trends in developer tools (e.g., Generative AI), and customer-specific challenges.",
                            "justification": "Understanding market trends and customer challenges is crucial for providing business-relevant technical advice."
                        },
                        {
                            "phrase": "Provide coaching and insights to internal teams based on industry expertise.",
                            "justification": "Leveraging industry expertise to inform internal teams is a business-oriented function."
                        },
                        {
                            "phrase": "Gather and share customer feedback internally to advocate for their needs and influence GitHub's product roadmap.",
                            "justification": "This involves understanding customer business needs and influencing product strategy based on market feedback."
                        },
                        {
                            "phrase": "Address customer pain points by leveraging a strong understanding of GitHub's extensible platform and integrations.",
                            "justification": "Solving customer pain points requires understanding their business context and how the platform can address it."
                        },
                        {
                            "phrase": "Drive Customer Readiness: Leverage technical resources and enablement programs to accelerate customer adoption and integration of GitHub's solutions",
                            "justification": "Accelerating customer adoption and integration is a business objective focused on customer success."
                        },
                        {
                            "phrase": "communicating customer's technical goals to guide post-sales teams to successful outcomes.",
                            "justification": "Ensuring successful outcomes for customers is a business-focused responsibility."
                        },
                        {
                            "phrase": "Support Industry Events and Marketing: Contribute to the creation of technical content for marketing initiatives",
                            "justification": "Creating content for marketing initiatives directly supports business development and outreach."
                        },
                        {
                            "phrase": "actively participate as a speaker at industry events and conferences, showcasing GitHub's capabilities and sharing best practices with the broader community.",
                            "justification": "Representing the company at events and sharing best practices contributes to brand awareness and market positioning."
                        }
                    ]
                },
                {
                    "task_category": "TASK4: Software Development",
                    "phrases": [
                        {
                            "phrase": "address pain points in a customer's SDLC",
                            "justification": "The Software Development Lifecycle (SDLC) is a core area of software development, and the role involves understanding and advising on it."
                        },
                        {
                            "phrase": "Showcase our products: Conduct (live) demos of GitHub's products",
                            "justification": "Demonstrating products involves understanding their technical functionality and how they are used in software development."
                        },
                        {
                            "phrase": "integrating broader industry trends (e.g., AI, DevSecOps) and tools into tailored customer scenarios.",
                            "justification": "Integrating trends and tools into scenarios implies understanding how they function within a software development context."
                        },
                        {
                            "phrase": "address customer pain points by leveraging a strong understanding of GitHub's extensible platform and integrations.",
                            "justification": "Understanding a platform's extensibility and integrations relates to its software architecture and development capabilities."
                        },
                        {
                            "phrase": "accelerate customer adoption and integration of GitHub's solutions",
                            "justification": "Customer integration implies understanding how GitHub's solutions fit into their existing software development workflows."
                        }
                    ]
                }
            ],
            "technologies": [
                {
                    "technology": "GitHub",
                    "category": "TECH2: Cloud Platforms & Services"
                },
                {
                    "technology": "AI",
                    "category": "TECH3: LLM / Generative Models"
                },
                {
                    "technology": "DevSecOps",
                    "category": "TECH6: MLOps & Data Pipelines"
                }
            ],
            "soft_skills": [
                {
                    "skill": "technical sales support",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "trusted advisors",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "remove technical objections",
                    "category": "SKILL3: Problem Solving & Pragmatism"
                },
                {
                    "skill": "creatively address pain points",
                    "category": "SKILL3: Problem Solving & Pragmatism"
                },
                {
                    "skill": "work internally with sales, product development, and industry experts",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "advocate for customer interests",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "always curious to find new solutions",
                    "category": "SKILL2: Learning & Adaptability"
                },
                {
                    "skill": "ambitious and dedicated to solving customers problems",
                    "category": "SKILL5: Innovation & Ownership"
                },
                {
                    "skill": "Lead the Technical Sales Process",
                    "category": "SKILL5: Innovation & Ownership"
                },
                {
                    "skill": "Own all technical aspects of the sales cycle",
                    "category": "SKILL5: Innovation & Ownership"
                },
                {
                    "skill": "Collaborate on Strategy",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "Be a strategic advisor",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "guiding customers through complex technical scenarios",
                    "category": "SKILL3: Problem Solving & Pragmatism"
                },
                {
                    "skill": "Establish relationships with key decision-makers",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "Showcase our products",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "Conduct (live) demos",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "Maintain an up-to-date understanding",
                    "category": "SKILL2: Learning & Adaptability"
                },
                {
                    "skill": "Provide coaching and insights",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "Gather and share customer feedback",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "influence GitHub's product roadmap",
                    "category": "SKILL5: Innovation & Ownership"
                },
                {
                    "skill": "Address customer pain points",
                    "category": "SKILL3: Problem Solving & Pragmatism"
                },
                {
                    "skill": "Drive Customer Readiness",
                    "category": "SKILL5: Innovation & Ownership"
                },
                {
                    "skill": "accelerate customer adoption and integration",
                    "category": "SKILL5: Innovation & Ownership"
                },
                {
                    "skill": "communicating customer's technical goals",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "Support Industry Events and Marketing",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "Contribute to the creation of technical content",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "actively participate as a speaker",
                    "category": "SKILL1: Communication & Collaboration"
                }
            ]
        }
    }
}