{
    "job_id": 1094,
    "job_details": {
        "job_id": 1094,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD",
        "Standplaats": "Breda",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Are you a forward-thinking developer eager to harness the power of GenAI to redefine business standards and enhance productivity? Are you bored of solving the same customer support tickets or resolving the same bugs over and over again?, * Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality",
        "Datum gevonden": "2024-08-01",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD\n\nAre you a forward-thinking developer eager to harness the power of GenAI to redefine business standards and enhance productivity? Are you bored of solving the same customer support tickets or resolving the same bugs over and over again?, * Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, fine-tuning, and deployment of applications built on large language models (LLMs) and generative AI technologies. Specific responsibilities include creating autonomous support platforms using LLMs, integrating state-of-the-art AI like GPT-4 Vision, and enhancing AI solutions across infrastructures like AWS. This aligns directly with the core responsibilities and evidence profile of a GenAI Engineer, particularly in building user-facing systems and leveraging generative models."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Create and improve autonomous support platforms using LLMs' directly relates to building and adapting models (LLMs) for specific tasks.",
                    "phrase": "Create and improve autonomous support platforms using LLMs"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description mentions 'development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets' and 'creating an assistant able to guide customers through an upgrade process', which are core software development activities for user-facing applications.",
                    "phrase": "development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'creating an assistant able to guide customers through an upgrade process' describes the development of a specific user-facing application feature.",
                    "phrase": "creating an assistant able to guide customers through an upgrade process"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Test and integrate state-of-the-art AI technologies, like GPT-4 Vision' implies working with and integrating advanced AI models.",
                    "phrase": "Test and integrate state-of-the-art AI technologies, like GPT-4 Vision"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'providing support and guidance for internal teams on how to best utilize these technologies within their workflows' indicates understanding business needs and aligning technology use with them.",
                    "phrase": "providing support and guidance for internal teams on how to best utilize these technologies within their workflows"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'Evaluate and enhance the performance and integration of AI solutions across different infrastructures' points to operational aspects of AI solutions.",
                    "phrase": "Evaluate and enhance the performance and integration of AI solutions across different infrastructures"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction' relates to the development and maintenance of reliable user-facing services.",
                    "phrase": "ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality' highlights understanding business goals and impact.",
                    "phrase": "Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "providing support and guidance for internal teams"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "troubleshooting, maintaining, and updating tools based on user feedback and support tickets"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "harness the power of GenAI to redefine business standards"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "redefine business standards and enhance productivity"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "LLMs"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "GPT-4 Vision"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "Amazon CodeWhisperer"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "AWS"
                }
            ]
        }
    }
}