{
    "job_id": 275,
    "job_details": {
        "job_id": 275,
        "Organisatienaam": "Inpact Solutions",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI/ Machine Learning Engineer",
        "Standplaats": "Hoofddorp",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": "gijs@inpact.recruitee.com",
        "Beroep": "Machine learning engineer (m/v/x)",
        "Opleidingsniveau": "WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als AI/ML Engineer bij Inpact ben je onderdeel van een ambitieus Feature Team dat gespecialiseerd is in het bouwen van innovatieve AI-oplossingen voor de verzekeringssector. Samen met collega-experts werk je aan geavanceerde technologieën zoals Natural Language Processing (NLP), Machine Learning (ML) en Deep Learning (DL). Dagelijks werkt het feature team aan Inpact.AI, om verzekeringsprofessionals te helpen om snel en effectief grote hoeveelheden data te verwerken, waaronder polissen, claims, rapporten, e-mails, PDF's, afbeeldingen en andere vormen van digitale informatie.\n\n   In jouw rol ontwerp, ontwikkel en implementeer je ook nieuwe baanbrekende AI-modellen en oplossingen-zoals Large Language Models (LLM's) in combinatie met Retrieval-Augmented Generation (RAG). Je werkt nauw samen met jouw team aan het optimaliseren van prestaties, verhogen van schaalbaarheid en het realiseren van tastbare resultaten die impact hebben.",
        "Datum gevonden": "2025-03-29",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "ICT",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 3,
        "full_text": "AI/ Machine Learning Engineer\n\nAls AI/ML Engineer bij Inpact ben je onderdeel van een ambitieus Feature Team dat gespecialiseerd is in het bouwen van innovatieve AI-oplossingen voor de verzekeringssector. Samen met collega-experts werk je aan geavanceerde technologieën zoals Natural Language Processing (NLP), Machine Learning (ML) en Deep Learning (DL). Dagelijks werkt het feature team aan Inpact.AI, om verzekeringsprofessionals te helpen om snel en effectief grote hoeveelheden data te verwerken, waaronder polissen, claims, rapporten, e-mails, PDF's, afbeeldingen en andere vormen van digitale informatie.\n\n   In jouw rol ontwerp, ontwikkel en implementeer je ook nieuwe baanbrekende AI-modellen en oplossingen-zoals Large Language Models (LLM's) in combinatie met Retrieval-Augmented Generation (RAG). Je werkt nauw samen met jouw team aan het optimaliseren van prestaties, verhogen van schaalbaarheid en het realiseren van tastbare resultaten die impact hebben."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development and implementation of AI solutions using Large Language Models (LLMs) combined with Retrieval-Augmented Generation (RAG). It also mentions Natural Language Processing (NLP) and Deep Learning (DL), aligning with the core responsibilities of a GenAI Engineer focused on generative models and user-facing applications. While 'Machine Learning Engineer' is mentioned, the specific focus on LLMs and RAG points more strongly towards the GenAI Engineer profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The description explicitly mentions designing, developing, and implementing new AI models and solutions, including Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG). This directly relates to the core process of creating and adapting machine learning models, particularly generative ones.",
                    "phrase": "ontwerp, ontwikkel en implementeer je ook nieuwe baanbrekende AI-modellen en oplossingen-zoals Large Language Models (LLM's) in combinatie met Retrieval-Augmented Generation (RAG)"
                },
                {
                    "category": "TASK4",
                    "justification": "The role involves building innovative AI solutions for the insurance sector and working on Inpact.AI, which helps insurance professionals process large amounts of data. This implies developing and integrating AI features into a system or application, which falls under traditional software engineering tasks.",
                    "phrase": "bouwen van innovatieve AI-oplossingen voor de verzekeringssector"
                },
                {
                    "category": "TASK4",
                    "justification": "The description states the feature team works daily on Inpact.AI to help insurance professionals process large amounts of data, including policies, claims, reports, emails, PDFs, images, and other digital information. This indicates the development of software that interacts with and processes various data types.",
                    "phrase": "om verzekeringsprofessionals te helpen om snel en effectief grote hoeveelheden data te verwerken, waaronder polissen, claims, rapporten, e-mails, PDF's, afbeeldingen en andere vormen van digitale informatie."
                },
                {
                    "category": "TASK3",
                    "justification": "The mention of Natural Language Processing (NLP), Machine Learning (ML), and Deep Learning (DL) indicates a focus on advanced modeling techniques.",
                    "phrase": "Natural Language Processing (NLP), Machine Learning (ML) en Deep Learning (DL)"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'optimaliseren van prestaties, verhogen van schaalbaarheid en het realiseren van tastbare resultaten die impact hebben' implies the need to ensure the developed AI solutions are performant, scalable, and deliver tangible results in a production environment, which is a key aspect of MLOps.",
                    "phrase": "optimaliseren van prestaties, verhogen van schaalbaarheid en het realiseren van tastbare resultaten die impact hebben"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "Samen met collega-experts werk je aan geavanceerde technologieën"
                },
                {
                    "category": "SKILL1",
                    "phrase": "Je werkt nauw samen met jouw team"
                },
                {
                    "category": "SKILL2",
                    "phrase": "ambitieus Feature Team dat gespecialiseerd is in het bouwen van innovatieve AI-oplossingen"
                },
                {
                    "category": "SKILL5",
                    "phrase": "bouwen van innovatieve AI-oplossingen"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "Large Language Models (LLM's)"
                },
                {
                    "category": "TECH4",
                    "phrase": "Retrieval-Augmented Generation (RAG)"
                },
                {
                    "category": "TECH3",
                    "phrase": "Natural Language Processing (NLP)"
                },
                {
                    "category": "TECH10",
                    "phrase": "Machine Learning (ML)"
                },
                {
                    "category": "TECH10",
                    "phrase": "Deep Learning (DL)"
                }
            ]
        }
    }
}