{
    "job_id": 303,
    "job_details": {
        "job_id": 303,
        "Organisatienaam": "Outlier",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Big Data Engineer voor AI-training",
        "Standplaats": "Almere",
        "Vacaturelink (origineel)": "find.jobs",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data architect (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Outlier helpt 's werelds meest innovatieve bedrijven bij het verbeteren van hun AI-modellen door menselijke feedback te leveren. Ben jij een ervaren software-engineer die zijn of haar expertise in codering wil inzetten om AI-modellen te trainen?\n       Wij werken samen met organisaties om grote taalkundige AI-modellen te trainen en helpen geavanceerde generatieve AI-modellen betere code te schrijven. De projecten bevatten meestal afgebakende, zeer gevarieerde problemen die interactie vereisen met deze modellen terwijl ze leren coderen. Er is geen eerdere ervaring met AI vereist.\n\nOutlier is op zoek naar getalenteerde programmeurs om te helpen bij het trainen van generatieve AI-modellen.\n       Deze freelance-opdracht kan volledig op afstand worden uitgevoerd en biedt flexibele werkuren, zodat je kunt werken wanneer het jou het beste uitkomt.\n       Jouw mogelijke bijdragen:\n          + Het maken en beantwoorden van vragen met betrekking tot informatica om AI-modellen te helpen trainen.\n          + Het evalueren en rangschikken van code die door AI-modellen wordt gegenereerd.",
        "Datum gevonden": "2025-02-12",
        "Beroepsgroep": "Database Specialists",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Big Data Engineer voor AI-training\n\nOutlier helpt 's werelds meest innovatieve bedrijven bij het verbeteren van hun AI-modellen door menselijke feedback te leveren. Ben jij een ervaren software-engineer die zijn of haar expertise in codering wil inzetten om AI-modellen te trainen?\n       Wij werken samen met organisaties om grote taalkundige AI-modellen te trainen en helpen geavanceerde generatieve AI-modellen betere code te schrijven. De projecten bevatten meestal afgebakende, zeer gevarieerde problemen die interactie vereisen met deze modellen terwijl ze leren coderen. Er is geen eerdere ervaring met AI vereist.\n\nOutlier is op zoek naar getalenteerde programmeurs om te helpen bij het trainen van generatieve AI-modellen.\n       Deze freelance-opdracht kan volledig op afstand worden uitgevoerd en biedt flexibele werkuren, zodat je kunt werken wanneer het jou het beste uitkomt.\n       Jouw mogelijke bijdragen:\n          + Het maken en beantwoorden van vragen met betrekking tot informatica om AI-modellen te helpen trainen.\n          + Het evalueren en rangschikken van code die door AI-modellen wordt gegenereerd."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on assisting in the training of AI models by providing human feedback, evaluating generated code, and answering computer science-related questions. While it mentions generative AI models and training them, it does not involve the core responsibilities of developing, fine-tuning, or deploying these models from an engineering perspective. The role is more about human-in-the-loop feedback for training rather than building or engineering AI systems. It lacks the depth in modeling, software development, or MLOps typically associated with ML or GenAI Engineer roles, leaning more towards a support or data annotation function for AI training."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'helpen bij het trainen van generatieve AI-modellen' and 'AI-modellen te helpen trainen' directly relates to the process of creating or adapting machine learning models, even if the role is focused on providing feedback for training rather than direct model building.",
                    "phrase": "helpen bij het trainen van generatieve AI-modellen"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'evalueren en rangschikken van code die door AI-modellen wordt gegenereerd' involves assessing the output of models, which is a form of interaction and feedback loop crucial for model improvement and training.",
                    "phrase": "evalueren en rangschikken van code die door AI-modellen wordt gegenereerd"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Het maken en beantwoorden van vragen met betrekking tot informatica om AI-modellen te helpen trainen' describes generating data or feedback (questions and answers) that directly contributes to the training process of AI models.",
                    "phrase": "Het maken en beantwoorden van vragen met betrekking tot informatica om AI-modellen te helpen trainen"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'helpt 's werelds meest innovatieve bedrijven bij het verbeteren van hun AI-modellen' indicates an understanding of how the work contributes to the business goal of improving AI models for clients.",
                    "phrase": "helpt 's werelds meest innovatieve bedrijven bij het verbeteren van hun AI-modellen"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2",
                    "phrase": "Er is geen eerdere ervaring met AI vereist."
                },
                {
                    "category": "SKILL5",
                    "phrase": "freelance-opdracht"
                },
                {
                    "category": "SKILL2",
                    "phrase": "flexibele werkuren"
                }
            ],
            "technologies": []
        }
    }
}