{
    "job_id": 268,
    "job_details": {
        "job_id": 268,
        "Organisatienaam": "ING Bank N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Data Engineer CDD",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We are looking for a Data Engineer to join us in Amsterdam. In this role, you will be responsible for designing, building, and optimizing complex data pipelines to process transactional and other data. Y ou will collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture to support the next generation of products and data initiatives.\n       We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills. We hire people based on an evaluation of their potential and support them throughout their time in Amsterdam. Come join us!\n       The Team\n       Within ING, there is ING Analytics (INGA) - a major driving force in its digital transformation of the bank.\n       By creating measurable value for ING and its customers through world-class analytics products and services, INGA helps ING to become a leader in data-driven decision - making. Among others, INGA delivers call & speech analytics, generative AI in risk summarization, insights into portfolio performance, advanced ESG data insights (commercial purposes), data analytics platforms (cloud and on-premises), and many more.\n       A working day in the life of a Data Engineer\n       A typical day for a data engineer starts with coffee, catching up with colleagues, and drafting a plan for the coming day. After the standup, you will start exploring the data to solve business problems, building and maintaining the production-ready infrastructure, and building the data pipelines that clean, transform, and aggregate data from disparate sources. Being an advocate for best practices in data engineering is important while working on such tasks.\n       After lunch, you organized a knowledge-sharing session to explain data security, compliance, and privacy standards to the rest of the data engineering team. Finally, to wrap up the day, you collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning.\n       Roles and responsibilities",
        "Datum gevonden": "2025-02-13",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Financieel / Verzekeringen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Data Engineer CDD\n\nWe are looking for a Data Engineer to join us in Amsterdam. In this role, you will be responsible for designing, building, and optimizing complex data pipelines to process transactional and other data. Y ou will collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture to support the next generation of products and data initiatives.\n       We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills. We hire people based on an evaluation of their potential and support them throughout their time in Amsterdam. Come join us!\n       The Team\n       Within ING, there is ING Analytics (INGA) - a major driving force in its digital transformation of the bank.\n       By creating measurable value for ING and its customers through world-class analytics products and services, INGA helps ING to become a leader in data-driven decision - making. Among others, INGA delivers call & speech analytics, generative AI in risk summarization, insights into portfolio performance, advanced ESG data insights (commercial purposes), data analytics platforms (cloud and on-premises), and many more.\n       A working day in the life of a Data Engineer\n       A typical day for a data engineer starts with coffee, catching up with colleagues, and drafting a plan for the coming day. After the standup, you will start exploring the data to solve business problems, building and maintaining the production-ready infrastructure, and building the data pipelines that clean, transform, and aggregate data from disparate sources. Being an advocate for best practices in data engineering is important while working on such tasks.\n       After lunch, you organized a knowledge-sharing session to explain data security, compliance, and privacy standards to the rest of the data engineering team. Finally, to wrap up the day, you collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning.\n       Roles and responsibilities"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses heavily on traditional data engineering tasks such as designing, building, and optimizing data pipelines, data processing, and data architecture. While it mentions collaboration with data scientists and the use of data analytics platforms, and even a brief mention of 'generative AI in risk summarization', the core responsibilities and daily tasks described do not align with the specialized skills of an ML Engineer or GenAI Engineer. The role is primarily about data infrastructure and processing, not model development or deployment of generative AI applications. The mention of 'generative AI' is in the context of a product delivered by the broader team, not a direct responsibility of this role. Therefore, it falls under the 'Ambiguous' category as it's a technical role but not specifically an AI/ML engineering role as defined in the coding book."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'designing, building, and optimizing complex data pipelines to process transactional and other data' directly describes core data engineering activities.",
                    "phrase": "designing, building, and optimizing complex data pipelines to process transactional and other data"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'developing and maintaining data solutions and INGA's data architecture' points to the responsibility of managing and evolving the data infrastructure.",
                    "phrase": "developing and maintaining data solutions and INGA's data architecture"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'building and maintaining the production-ready infrastructure' is a key aspect of data engineering, ensuring systems are robust and operational.",
                    "phrase": "building and maintaining the production-ready infrastructure"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'building the data pipelines that clean, transform, and aggregate data from disparate sources' details the ETL/ELT processes fundamental to data engineering.",
                    "phrase": "building the data pipelines that clean, transform, and aggregate data from disparate sources"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'Being an advocate for best practices in data engineering' highlights the importance of adhering to industry standards and quality in data operations.",
                    "phrase": "Being an advocate for best practices in data engineering"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning' shows involvement in supporting ML workflows through data preparation.",
                    "phrase": "collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'exploring the data to solve business problems' indicates an understanding of how data analysis contributes to resolving business challenges.",
                    "phrase": "exploring the data to solve business problems"
                },
                {
                    "category": "SKILL4: Ethical & Legal Responsibility",
                    "justification": "The phrase 'explain data security, compliance, and privacy standards' directly relates to awareness and responsibility for ethical and legal aspects of data handling.",
                    "phrase": "explain data security, compliance, and privacy standards"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "The phrase 'committed to developing themselves and learning new skills' explicitly states a focus on continuous learning and adaptability.",
                    "phrase": "committed to developing themselves and learning new skills"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The phrase 'collaborate closely with data scientists and analysts' indicates the need for teamwork and communication across different technical roles.",
                    "phrase": "collaborate closely with data scientists and analysts"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "committed to developing themselves and learning new skills"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborate closely with data scientists and analysts"
                },
                {
                    "category": "SKILL4: Ethical & Legal Responsibility",
                    "phrase": "data security, compliance, and privacy standards"
                }
            ],
            "technologies": []
        }
    }
}