{
    "job_id": 288,
    "job_details": {
        "job_id": 288,
        "Organisatienaam": "Maxflex",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "AI Engineer werkstudent",
        "Standplaats": "Arnhem",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": "+31243603050",
        "E-mail": null,
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Volg jij een HBO/WO-studie in een data AI- gerelateerde richting en wil je meewerken aan innovatieve oplossingen binnen een sportieve werkomgeving? Als AI Engineer werkstudent maak je deel uit van een AI-innovatie team en draag je direct bij aan vernieuwing in de sportsector. Klaar om jouw kennis in te zetten en mee te bouwen aan een sportiever Nederland? Neem dan contact met ons op!\n\n    Het bedrijf\n\n    *De sportorganisatie is een overkoepelende organisatie voor de georganiseerde sport in Nederland en heeft als missie om Nederland tegen 2032 het sportiefste land ter wereld te maken. Dit doen ze door het ondersteunen van sportbonden, het begeleiden van topsportprogramma's, het uitvoeren van sportonderzoek en het versterken van de maatschappelijke waarde van sport. Samen met diverse partners zet de organisatie zich in om de impact van sport te vergroten.In deze functie kom je te werken op de afdeling Informatie Management. Deze afdeling speelt een cruciale rol in het ondersteunen van diverse afdelingen, waaronder Topsport (inclusief TeamNL), Breedtesport en het Centrum Veilige Sport Nederland. Hier worden innovatieve oplossingen ontwikkeld en diensten geleverd om de ambities van de organisatie te realiseren. *\n\nAls AI Engineer werkstudent kom je te werken binnen de afdeling Informatie Management, waar je onderdeel wordt van het nieuw op te richten AI-innovatie team. Dit team heeft als doel om AI-toepassingen te ontwikkelen en uiteindelijk te implementeren, zodat deze aan het einde van het jaar breed binnen de organisatie worden gebruikt. Hiermee willen ze de productiviteit en kwaliteit van de werkorganisatie naar een hoger niveau tillen en een nieuwe standaard zetten in de sportsector.In eerste instantie zullen je werkzaamheden een sterk innovatief karakter hebben. Je zult problemen en verbeteringen identificeren om vervolgens de juiste AI tools te kiezen als onderdeel van de oplossing. Dit betekent puzzelen, experimenteren en vernieuwend bezig zijn om oplossingen te creëren die direct impact hebben op de werknemers en processen binnen het bedrijf. Verder houd je je bezig met het",
        "Datum gevonden": "2025-02-12",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Parttime / Fulltime",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "AI Engineer werkstudent\n\nVolg jij een HBO/WO-studie in een data AI- gerelateerde richting en wil je meewerken aan innovatieve oplossingen binnen een sportieve werkomgeving? Als AI Engineer werkstudent maak je deel uit van een AI-innovatie team en draag je direct bij aan vernieuwing in de sportsector. Klaar om jouw kennis in te zetten en mee te bouwen aan een sportiever Nederland? Neem dan contact met ons op!\n\n    Het bedrijf\n\n    *De sportorganisatie is een overkoepelende organisatie voor de georganiseerde sport in Nederland en heeft als missie om Nederland tegen 2032 het sportiefste land ter wereld te maken. Dit doen ze door het ondersteunen van sportbonden, het begeleiden van topsportprogramma's, het uitvoeren van sportonderzoek en het versterken van de maatschappelijke waarde van sport. Samen met diverse partners zet de organisatie zich in om de impact van sport te vergroten.In deze functie kom je te werken op de afdeling Informatie Management. Deze afdeling speelt een cruciale rol in het ondersteunen van diverse afdelingen, waaronder Topsport (inclusief TeamNL), Breedtesport en het Centrum Veilige Sport Nederland. Hier worden innovatieve oplossingen ontwikkeld en diensten geleverd om de ambities van de organisatie te realiseren. *\n\nAls AI Engineer werkstudent kom je te werken binnen de afdeling Informatie Management, waar je onderdeel wordt van het nieuw op te richten AI-innovatie team. Dit team heeft als doel om AI-toepassingen te ontwikkelen en uiteindelijk te implementeren, zodat deze aan het einde van het jaar breed binnen de organisatie worden gebruikt. Hiermee willen ze de productiviteit en kwaliteit van de werkorganisatie naar een hoger niveau tillen en een nieuwe standaard zetten in de sportsector.In eerste instantie zullen je werkzaamheden een sterk innovatief karakter hebben. Je zult problemen en verbeteringen identificeren om vervolgens de juiste AI tools te kiezen als onderdeel van de oplossing. Dit betekent puzzelen, experimenteren en vernieuwend bezig zijn om oplossingen te creëren die direct impact hebben op de werknemers en processen binnen het bedrijf. Verder houd je je bezig met het"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description is for a student/intern role ('werkstudent') and focuses on identifying problems and choosing AI tools as part of a solution, rather than deep development or engineering of AI models or systems. It lacks specific technical details about the AI models or the engineering tasks involved, making it difficult to classify as a dedicated ML Engineer or GenAI Engineer. The emphasis is more on the application and exploration of AI tools within a business context."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role is situated within a sports organization aiming to make the Netherlands the sportiest country in the world, and the AI Engineer will contribute to this mission by developing innovative solutions. The description mentions supporting various departments and realizing organizational ambitions.",
                    "phrase": "ondersteunen van diverse afdelingen, waaronder Topsport (inclusief TeamNL), Breedtesport en het Centrum Veilige Sport Nederland. Hier worden innovatieve oplossingen ontwikkeld en diensten geleverd om de ambities van de organisatie te realiseren."
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role is described as contributing to the organization's mission of making the Netherlands the sportiest country in the world by 2032.",
                    "phrase": "missie om Nederland tegen 2032 het sportiefste land ter wereld te maken."
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The role involves developing AI applications and identifying the right AI tools as part of a solution, which implies some level of model selection or adaptation, even if not deep development.",
                    "phrase": "AI-toepassingen te ontwikkelen"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The description mentions choosing the right AI tools as part of a solution, which can involve selecting appropriate models or techniques.",
                    "phrase": "juiste AI tools te kiezen als onderdeel van de oplossing"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role aims to develop and implement AI applications that will be used broadly within the organization, suggesting the need for some level of software integration or development to make these applications functional.",
                    "phrase": "AI-toepassingen te ontwikkelen en uiteindelijk te implementeren"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves building solutions that have a direct impact on employees and processes, implying the creation or integration of software components.",
                    "phrase": "creëren van oplossingen die direct impact hebben op de werknemers en processen binnen het bedrijf."
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The goal is for the AI applications to be used broadly within the organization by the end of the year, implying a need for deployment and maintenance considerations.",
                    "phrase": "aan het einde van het jaar breed binnen de organisatie worden gebruikt."
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "HBO/WO-studie in een data AI- gerelateerde richting"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Klaar om jouw kennis in te zetten"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "meewerken aan innovatieve oplossingen"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "AI-innovatie team"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "sterk innovatief karakter"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "problemen en verbeteringen identificeren"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "puzzelen, experimenteren en vernieuwend bezig zijn"
                }
            ],
            "technologies": []
        }
    }
}