{
    "job_id": 270,
    "job_details": {
        "job_id": 270,
        "Organisatienaam": "ING Bank N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Lead Senior Data Engineer",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data architect (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We are looking for a Data Engineer and Tech Lead to join us in Amsterdam. As an engineer, you will be responsible for designing, building, and optimizing complex data pipelines to process transactional and other data. You will collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture to support the next generation of products and data initiatives. As a tech lead, collaborate with product manager on the product roadmap, translate requirements into feasible technical solutions, ensure that the team follows (engineering) best practices, lead tech & architectural decisions, and establish the team's culture and way-of-working.\n\n   We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills. We hire people based on an evaluation of their potential and support them throughout their time in Amsterdam. Come join us!",
        "Datum gevonden": "2025-02-13",
        "Beroepsgroep": "Database Specialists",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Financieel / Verzekeringen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Lead Senior Data Engineer\n\nWe are looking for a Data Engineer and Tech Lead to join us in Amsterdam. As an engineer, you will be responsible for designing, building, and optimizing complex data pipelines to process transactional and other data. You will collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture to support the next generation of products and data initiatives. As a tech lead, collaborate with product manager on the product roadmap, translate requirements into feasible technical solutions, ensure that the team follows (engineering) best practices, lead tech & architectural decisions, and establish the team's culture and way-of-working.\n\n   We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills. We hire people based on an evaluation of their potential and support them throughout their time in Amsterdam. Come join us!"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses heavily on data engineering tasks, pipeline optimization, and data architecture. While it mentions collaboration with data scientists and supporting data initiatives, there is no explicit mention of building, fine-tuning, or deploying generative AI models, LLMs, or diffusion models. The core responsibilities and technologies described align more with a traditional data engineering role rather than a GenAI Engineer. The mention of 'next generation of products and data initiatives' is too vague to infer a GenAI focus. Therefore, it falls under the 'Ambiguous' category as it's a technical role but not specifically an AI Engineer role as defined in the coding book, and it doesn't fit the 'ML Engineer' profile either due to the lack of focus on predictive modeling."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'designing, building, and optimizing complex data pipelines to process transactional and other data' directly describes core data engineering responsibilities.",
                    "phrase": "designing, building, and optimizing complex data pipelines to process transactional and other data"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'developing and maintaining data solutions and INGA's data architecture' indicates responsibilities related to data infrastructure and solutions.",
                    "phrase": "developing and maintaining data solutions and INGA's data architecture"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'collaborate with product manager on the product roadmap, translate requirements into feasible technical solutions' shows an understanding of business needs and translating them into technical plans.",
                    "phrase": "collaborate with product manager on the product roadmap, translate requirements into feasible technical solutions"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'ensure that the team follows (engineering) best practices, lead tech & architectural decisions, and establish the team's culture and way-of-working' implies a role in guiding software development practices and architecture.",
                    "phrase": "ensure that the team follows (engineering) best practices, lead tech & architectural decisions, and establish the team's culture and way-of-working"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "The phrase 'committed to developing themselves and learning new skills' directly points to a soft skill of continuous learning.",
                    "phrase": "committed to developing themselves and learning new skills"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborate closely with data scientists and analysts"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborate with product manager"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "curious and empathetic individuals who are committed to developing themselves and learning new skills"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "translate requirements into feasible technical solutions"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "lead tech & architectural decisions"
                }
            ],
            "technologies": []
        }
    }
}