{
    "job_id": 268,
    "job_details": {
        "job_id": 268,
        "Organisatienaam": "ING Bank N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Data Engineer CDD",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We are looking for a Data Engineer to join us in Amsterdam. In this role, you will be responsible for designing, building, and optimizing complex data pipelines to process transactional and other data. Y ou will collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture to support the next generation of products and data initiatives.\n       We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills. We hire people based on an evaluation of their potential and support them throughout their time in Amsterdam. Come join us!\n       The Team\n       Within ING, there is ING Analytics (INGA) - a major driving force in its digital transformation of the bank.\n       By creating measurable value for ING and its customers through world-class analytics products and services, INGA helps ING to become a leader in data-driven decision - making. Among others, INGA delivers call & speech analytics, generative AI in risk summarization, insights into portfolio performance, advanced ESG data insights (commercial purposes), data analytics platforms (cloud and on-premises), and many more.\n       A working day in the life of a Data Engineer\n       A typical day for a data engineer starts with coffee, catching up with colleagues, and drafting a plan for the coming day. After the standup, you will start exploring the data to solve business problems, building and maintaining the production-ready infrastructure, and building the data pipelines that clean, transform, and aggregate data from disparate sources. Being an advocate for best practices in data engineering is important while working on such tasks.\n       After lunch, you organized a knowledge-sharing session to explain data security, compliance, and privacy standards to the rest of the data engineering team. Finally, to wrap up the day, you collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning.\n       Roles and responsibilities",
        "Datum gevonden": "2025-02-13",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Financieel / Verzekeringen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Data Engineer CDD\n\nWe are looking for a Data Engineer to join us in Amsterdam. In this role, you will be responsible for designing, building, and optimizing complex data pipelines to process transactional and other data. Y ou will collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture to support the next generation of products and data initiatives.\n       We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills. We hire people based on an evaluation of their potential and support them throughout their time in Amsterdam. Come join us!\n       The Team\n       Within ING, there is ING Analytics (INGA) - a major driving force in its digital transformation of the bank.\n       By creating measurable value for ING and its customers through world-class analytics products and services, INGA helps ING to become a leader in data-driven decision - making. Among others, INGA delivers call & speech analytics, generative AI in risk summarization, insights into portfolio performance, advanced ESG data insights (commercial purposes), data analytics platforms (cloud and on-premises), and many more.\n       A working day in the life of a Data Engineer\n       A typical day for a data engineer starts with coffee, catching up with colleagues, and drafting a plan for the coming day. After the standup, you will start exploring the data to solve business problems, building and maintaining the production-ready infrastructure, and building the data pipelines that clean, transform, and aggregate data from disparate sources. Being an advocate for best practices in data engineering is important while working on such tasks.\n       After lunch, you organized a knowledge-sharing session to explain data security, compliance, and privacy standards to the rest of the data engineering team. Finally, to wrap up the day, you collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning.\n       Roles and responsibilities"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous / Not Relevant",
            "confidence_score": 2,
            "rationale": "The job description focuses heavily on traditional data engineering tasks such as building and optimizing data pipelines, data processing, and data architecture. While it mentions collaboration with data scientists and the use of generative AI in risk summarization, these are presented as outcomes supported by the data engineering work, not as the primary focus of the role itself. The core responsibilities and daily activities described do not align with the specialized tasks of an ML Engineer or GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "phrase": "designing, building, and optimizing complex data pipelines to process transactional and other data",
                    "category": "TASK2: Data Engineering",
                    "justification": "This phrase directly describes the core activities of building and maintaining data infrastructure and processing data, which falls under Data Engineering."
                },
                {
                    "phrase": "collaborate closely with data scientists and analysts in developing and maintaining data solutions and INGA's data architecture",
                    "category": "TASK1: Business Understanding",
                    "justification": "This indicates collaboration with business-facing roles (data scientists, analysts) to support product and data initiatives, implying an understanding of how data supports business goals."
                },
                {
                    "phrase": "developing and maintaining data solutions and INGA's data architecture",
                    "category": "TASK2: Data Engineering",
                    "justification": "This phrase refers to the creation and upkeep of data infrastructure and solutions, a key aspect of Data Engineering."
                },
                {
                    "phrase": "support the next generation of products and data initiatives",
                    "category": "TASK1: Business Understanding",
                    "justification": "This highlights the role's contribution to broader product development and strategic data efforts, indicating alignment with business objectives."
                },
                {
                    "phrase": "exploring the data to solve business problems",
                    "category": "TASK1: Business Understanding",
                    "justification": "This phrase emphasizes using data analysis to address and resolve issues that impact the business."
                },
                {
                    "phrase": "building and maintaining the production-ready infrastructure",
                    "category": "TASK2: Data Engineering",
                    "justification": "This describes the construction and upkeep of the necessary systems for data processing and storage in a production environment."
                },
                {
                    "phrase": "building the data pipelines that clean, transform, and aggregate data from disparate sources",
                    "category": "TASK2: Data Engineering",
                    "justification": "This details the fundamental processes of data ingestion, cleaning, and preparation, which are central to Data Engineering."
                },
                {
                    "phrase": "Being an advocate for best practices in data engineering",
                    "category": "TASK2: Data Engineering",
                    "justification": "This emphasizes the importance of adhering to and promoting established methods and standards within the field of data engineering."
                },
                {
                    "phrase": "explain data security, compliance, and privacy standards",
                    "category": "TASK1: Business Understanding",
                    "justification": "This involves understanding and communicating critical business-related policies and regulations concerning data handling."
                },
                {
                    "phrase": "collaborated with the data science and analysts' teams to develop data models and pipelines for research, reporting, and machine learning",
                    "category": "TASK2: Data Engineering",
                    "justification": "This describes the creation of data models and pipelines, which are foundational elements of data engineering, even when supporting ML initiatives."
                },
                {
                    "phrase": "develop data models and pipelines for research, reporting, and machine learning",
                    "category": "TASK3: Modeling",
                    "justification": "While the primary focus is on building pipelines, the development of 'data models' for ML can touch upon modeling aspects, though it's secondary to pipeline construction in this context."
                }
            ],
            "technologies": [
                {
                    "name": "generative AI",
                    "category": "TECH3: LLM / Generative Models",
                    "justification": "Mentioned as a capability within ING Analytics, indicating awareness and potential interaction with generative AI technologies."
                }
            ],
            "soft_skills": [
                {
                    "phrase": "curious and empathetic individuals",
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "justification": "Curiosity implies a drive to explore and understand, which is crucial for problem-solving. Empathy can relate to understanding user or stakeholder needs."
                },
                {
                    "phrase": "committed to developing themselves and learning new skills",
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "This directly states a commitment to continuous learning and skill development, a hallmark of adaptability in a tech field."
                },
                {
                    "phrase": "support them throughout their time in Amsterdam",
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "While phrased as employer support, it implies a culture that fosters growth and potentially ownership of one's development path."
                },
                {
                    "phrase": "collaborate closely with data scientists and analysts",
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "This explicitly mentions working together with other teams, highlighting the need for collaboration."
                },
                {
                    "phrase": "exploring the data to solve business problems",
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "justification": "This describes the process of identifying and resolving issues using data, which is a core problem-solving activity."
                },
                {
                    "phrase": "Being an advocate for best practices",
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "Advocating for best practices suggests taking initiative and ownership of quality and standards within the team."
                },
                {
                    "phrase": "organized a knowledge-sharing session",
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "Organizing and conducting a knowledge-sharing session demonstrates communication and collaborative efforts to disseminate information."
                },
                {
                    "phrase": "explain data security, compliance, and privacy standards",
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "This involves communicating complex information to the team, requiring strong communication skills."
                },
                {
                    "phrase": "collaborated with the data science and analysts' teams",
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "This explicitly states collaboration with other teams, emphasizing teamwork."
                }
            ]
        }
    }
}