{
    "job_id": 1247,
    "job_details": {
        "job_id": 1247,
        "Organisatienaam": "StarApple",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "Data-driven Software Engineer (Recruitment)",
        "Standplaats": "Voorburg",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als Data-Driven Recruitment Software Engineer speel je een cruciale rol in het ontwikkelen en implementeren van geavanceerde software-oplossingen die gebruik maken van AI en machine learning. Je werkt aan het verbeteren van onze recruitmentprocessen en draagt bij aan de verdere ontwikkeling van de GenAI Assistant, een tool die recruitment consultants en business consultants ondersteunt bij hun werkzaamheden.\n\n* Ontwikkeling van Algoritmen: Ontwerpen, ontwikkelen en implementeren van geavanceerde algoritmes voor het automatiseren van het matching proces tussen kandidaten en vacatures.\n   * Data-integratie: Integreren van verschillende databronnen (vacatures, bedrijfsinformatie, kandidaatprofielen) in een centraal systeem om de match-kans te maximaliseren.\n   * Middleware Beheer: Beheren en optimaliseren van middleware en platformoplossingen zoals SA Carerix, HeadFirst Carerix, Sterksen Carerix, Jobfeed, en andere.\n   * Tool Implementatie: Implementeren en beheren van tools zoals de Cold Callbot en AI-gegenereerde leads-lijsten voor business consultants.\n   * Data Analyse: Analyseren van data om win- en faalkansen te evalueren en verbeteringen door te voeren om de succesratio te verhogen.\n   * Samenwerking: Effectief samenwerken met sales- en accountmanagementteams om leads te voorzien van relevante informatie en slagingskansen.\n\nDe GenAI Assistant is een baanbrekende tool die in 2023 is geïntroduceerd en momenteel wordt verbeterd voor bredere integratie binnen de HeadFirst Group. Het ondersteunt recruitment consultants bij het verbeteren van hun outreach en candidate-matching procedures, en business consultants bij het optimaliseren van hun cold-calling strategieën. De tool biedt AI-gegenereerde leads en transcribeert VOIP calls, waardoor consultants efficiënter kunnen werken en hun plaatsingssucces kunnen verhogen.",
        "Datum gevonden": "2024-07-06",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 7,
        "full_text": "Data-driven Software Engineer (Recruitment)\n\nAls Data-Driven Recruitment Software Engineer speel je een cruciale rol in het ontwikkelen en implementeren van geavanceerde software-oplossingen die gebruik maken van AI en machine learning. Je werkt aan het verbeteren van onze recruitmentprocessen en draagt bij aan de verdere ontwikkeling van de GenAI Assistant, een tool die recruitment consultants en business consultants ondersteunt bij hun werkzaamheden.\n\n* Ontwikkeling van Algoritmen: Ontwerpen, ontwikkelen en implementeren van geavanceerde algoritmes voor het automatiseren van het matching proces tussen kandidaten en vacatures.\n   * Data-integratie: Integreren van verschillende databronnen (vacatures, bedrijfsinformatie, kandidaatprofielen) in een centraal systeem om de match-kans te maximaliseren.\n   * Middleware Beheer: Beheren en optimaliseren van middleware en platformoplossingen zoals SA Carerix, HeadFirst Carerix, Sterksen Carerix, Jobfeed, en andere.\n   * Tool Implementatie: Implementeren en beheren van tools zoals de Cold Callbot en AI-gegenereerde leads-lijsten voor business consultants.\n   * Data Analyse: Analyseren van data om win- en faalkansen te evalueren en verbeteringen door te voeren om de succesratio te verhogen.\n   * Samenwerking: Effectief samenwerken met sales- en accountmanagementteams om leads te voorzien van relevante informatie en slagingskansen.\n\nDe GenAI Assistant is een baanbrekende tool die in 2023 is geïntroduceerd en momenteel wordt verbeterd voor bredere integratie binnen de HeadFirst Group. Het ondersteunt recruitment consultants bij het verbeteren van hun outreach en candidate-matching procedures, en business consultants bij het optimaliseren van hun cold-calling strategieën. De tool biedt AI-gegenereerde leads en transcribeert VOIP calls, waardoor consultants efficiënter kunnen werken en hun plaatsingssucces kunnen verhogen."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development and implementation of AI and machine learning solutions specifically for recruitment processes. It highlights the improvement of a 'GenAI Assistant' tool that supports recruitment and business consultants, involving advanced algorithms for candidate-vacancy matching, integration of diverse data sources, and the implementation of AI-generated leads and call transcription. The core responsibilities align with building and maintaining production-grade user-facing software systems powered by generative AI, such as the GenAI Assistant, and involve tasks like prompt engineering (implied by improving outreach and matching) and developing complex agents (implied by the assistant's functionality). While there's data integration and analysis, the primary focus is on leveraging generative AI to enhance user-facing tools and processes, fitting the GenAI Engineer profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Ontwikkeling van Algoritmen: Ontwerpen, ontwikkelen en implementeren van geavanceerde algoritmes voor het automatiseren van het matching proces tussen kandidaten en vacatures' directly refers to the creation and implementation of algorithms for a specific task, which is a core aspect of modeling.",
                    "phrase": "Ontwerpen, ontwikkelen en implementeren van geavanceerde algoritmes voor het automatiseren van het matching proces tussen kandidaten en vacatures"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'Data-integratie: Integreren van verschillende databronnen (vacatures, bedrijfsinformatie, kandidaatprofielen) in een centraal systeem om de match-kans te maximaliseren' describes the process of bringing together and managing data from various sources, which is a key data engineering task.",
                    "phrase": "Integreren van verschillende databronnen (vacatures, bedrijfsinformatie, kandidaatprofielen) in een centraal systeem om de match-kans te maximaliseren"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'Middleware Beheer: Beheren en optimaliseren van middleware en platformoplossingen zoals SA Carerix, HeadFirst Carerix, Sterksen Carerix, Jobfeed, en andere' involves managing and optimizing existing software platforms and middleware, which falls under software development and integration.",
                    "phrase": "Beheren en optimaliseren van middleware en platformoplossingen zoals SA Carerix, HeadFirst Carerix, Sterksen Carerix, Jobfeed, en andere"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'Tool Implementatie: Implementeren en beheren van tools zoals de Cold Callbot en AI-gegenereerde leads-lijsten voor business consultants' involves deploying and managing specific tools, which is a software development and operational task.",
                    "phrase": "Implementeren en beheren van tools zoals de Cold Callbot en AI-gegenereerde leads-lijsten voor business consultants"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'Data Analyse: Analyseren van data om win- en faalkansen te evalueren en verbeteringen door te voeren om de succesratio te verhogen' involves examining data to derive insights and drive improvements, which is a crucial part of data engineering and analysis.",
                    "phrase": "Analyseren van data om win- en faalkansen te evalueren en verbeteringen door te voeren om de succesratio te verhogen"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'Samenwerking: Effectief samenwerken met sales- en accountmanagementteams om leads te voorzien van relevante informatie en slagingskansen' highlights the need to understand business needs and collaborate with business teams to achieve business goals.",
                    "phrase": "Effectief samenwerken met sales- en accountmanagementteams om leads te voorzien van relevante informatie en slagingskansen"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description of the GenAI Assistant as a 'baanbrekende tool die in 2023 is geïntroduceerd en momenteel wordt verbeterd voor bredere integratie' and its function to 'ondersteunt recruitment consultants bij het verbeteren van hun outreach en candidate-matching procedures, en business consultants bij het optimaliseren van hun cold-calling strategieën' points to the development and enhancement of user-facing software systems.",
                    "phrase": "verbeterd voor bredere integratie binnen de HeadFirst Group. Het ondersteunt recruitment consultants bij het verbeteren van hun outreach en candidate-matching procedures, en business consultants bij het optimaliseren van hun cold-calling strategieën."
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The mention of 'AI-gegenereerde leads' and 'transcribeert VOIP calls' implies the use and potential development of generative AI models for content creation and processing.",
                    "phrase": "AI-gegenereerde leads en transcribeert VOIP calls"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Samenwerking: Effectief samenwerken met sales- en accountmanagementteams"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "verbeteringen door te voeren om de succesratio te verhogen"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "GenAI Assistant is een baanbrekende tool die in 2023 is geïntroduceerd en momenteel wordt verbeterd"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "GenAI Assistant"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "Cold Callbot"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "AI"
                }
            ]
        }
    }
}