{
    "job_id": 1261,
    "job_details": {
        "job_id": 1261,
        "Organisatienaam": "Uber",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior Software Engineer - ML Threat Detection",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "themuse.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": "accommodations@uber.com",
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "You will drive the development and operations of security services and frameworks to support user-facing products and platforms across Uber. You are passionate and pragmatic technologists who are able to design scalable systems while delivering high-quality code. The security landscape is constantly evolving, and with the adoption of ML/GenAI backed by extensive heterogeneous data, security threats are inevitably broadened. With your deep and comprehensive expertise across major technology stacks, you will architect, implement and scale industry-leading security solutions for the entire company. You will collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind.\n\n   What you will do\n\n     * Developing Security Solutions: designing, developing, and implementing software solutions to enhance the security posture of the organization.\n     * Threat Analysis and Detection: Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation.\n     * Code Review and Testing\n     * Research: Researching new techniques and tools to enhance the organization's cyber defense capabilities.\n     * Collaboration and Communication: Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity.",
        "Datum gevonden": "2024-06-15",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Media / Communicatie",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 6,
        "full_text": "Senior Software Engineer - ML Threat Detection\n\nYou will drive the development and operations of security services and frameworks to support user-facing products and platforms across Uber. You are passionate and pragmatic technologists who are able to design scalable systems while delivering high-quality code. The security landscape is constantly evolving, and with the adoption of ML/GenAI backed by extensive heterogeneous data, security threats are inevitably broadened. With your deep and comprehensive expertise across major technology stacks, you will architect, implement and scale industry-leading security solutions for the entire company. You will collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind.\n\n   What you will do\n\n     * Developing Security Solutions: designing, developing, and implementing software solutions to enhance the security posture of the organization.\n     * Threat Analysis and Detection: Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation.\n     * Code Review and Testing\n     * Research: Researching new techniques and tools to enhance the organization's cyber defense capabilities.\n     * Collaboration and Communication: Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description emphasizes developing and operating security services and frameworks, architecting and scaling security solutions, and leveraging ML/GenAI for threat detection. While it mentions GenAI, the core focus is on building predictive models for threat detection and security posture enhancement, aligning with the 'ML Engineer' profile's emphasis on data-driven algorithms for prediction and anomaly detection, and productionizing these systems. The role involves algorithm development, data preprocessing, model training/evaluation, and MLOps, which are central to an ML Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'drive the development and operations of security services and frameworks to support user-facing products and platforms' and 'architect, implement and scale industry-leading security solutions' directly relates to building and deploying software systems.",
                    "phrase": "drive the development and operations of security services and frameworks to support user-facing products and platforms"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'design scalable systems while delivering high-quality code' is a core aspect of software engineering.",
                    "phrase": "design scalable systems while delivering high-quality code"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The mention of 'adoption of ML/GenAI backed by extensive heterogeneous data' and 'security threats are inevitably broadened' implies the use of ML/GenAI models for threat detection and analysis.",
                    "phrase": "adoption of ML/GenAI backed by extensive heterogeneous data"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'architect, implement and scale industry-leading security solutions' in the context of ML/GenAI for security implies building and deploying predictive models for threat detection.",
                    "phrase": "architect, implement and scale industry-leading security solutions"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The bullet point 'Threat Analysis and Detection: Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation' directly points to the application of models for predictive analysis and anomaly detection.",
                    "phrase": "Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The bullet point 'Developing Security Solutions: designing, developing, and implementing software solutions to enhance the security posture of the organization' is a clear indicator of software development tasks.",
                    "phrase": "designing, developing, and implementing software solutions to enhance the security posture of the organization"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'drive the development and operations of security services' indicates a responsibility for the operational aspects of deployed services, which aligns with MLOps.",
                    "phrase": "drive the development and operations of security services"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'ensure that the technologies and systems that Uber depends on are built with security-by-design in mind' shows an understanding of how technical solutions align with broader organizational security goals.",
                    "phrase": "ensure that the technologies and systems that Uber depends on are built with security-by-design in mind"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'backed by extensive heterogeneous data' implies the need to handle and process large amounts of diverse data, which is a core part of data engineering.",
                    "phrase": "backed by extensive heterogeneous data"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The bullet point 'Code Review and Testing' is a standard software development practice.",
                    "phrase": "Code Review and Testing"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The bullet point 'Researching new techniques and tools to enhance the organization's cyber defense capabilities' implies exploring and potentially implementing new modeling approaches for security.",
                    "phrase": "Researching new techniques and tools to enhance the organization's cyber defense capabilities"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The bullet point 'Collaboration and Communication: Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity' directly describes collaboration and communication skills.",
                    "phrase": "Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "passionate and pragmatic technologists"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "drive the development and operations"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Collaborate with security leaders and with the broader engineering organization"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Working closely with cross-functional teams"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "The security landscape is constantly evolving"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "architect, implement and scale industry-leading security solutions"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "ML/GenAI"
                },
                {
                    "category": "TECH10: Data Modeling",
                    "phrase": "ML"
                }
            ]
        }
    }
}