{
    "job_id": 1089,
    "job_details": {
        "job_id": 1089,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD",
        "Standplaats": "Den Haag",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Are you a forward-thinking developer eager to harness the power of GenAI to redefine business standards and enhance productivity? Are you bored of solving the same customer support tickets or resolving the same bugs over and over again?, * Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality",
        "Datum gevonden": "2024-08-09",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD\n\nAre you a forward-thinking developer eager to harness the power of GenAI to redefine business standards and enhance productivity? Are you bored of solving the same customer support tickets or resolving the same bugs over and over again?, * Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, fine-tuning, and deployment of applications built on large language models (LLMs) and generative AI technologies. Specific responsibilities include creating autonomous support platforms using LLMs, testing and integrating state-of-the-art AI like GPT-4 Vision, and enhancing AI solutions across infrastructures like AWS. These align directly with the core responsibilities and evidence profile of a GenAI Engineer, particularly in building user-facing systems and leveraging generative models."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Create and improve autonomous support platforms using LLMs' directly relates to building and adapting models for specific tasks.",
                    "phrase": "Create and improve autonomous support platforms using LLMs"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'troubleshooting, maintaining, and updating tools based on user feedback and support tickets' and 'creating an assistant able to guide customers through an upgrade process' points to building and maintaining user-facing applications and their components.",
                    "phrase": "troubleshooting, maintaining, and updating tools based on user feedback and support tickets"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'creating an assistant able to guide customers through an upgrade process' describes the development of a user-facing application component.",
                    "phrase": "creating an assistant able to guide customers through an upgrade process"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Test and integrate state-of-the-art AI technologies, like GPT-4 Vision' involves working with and implementing advanced AI models.",
                    "phrase": "Test and integrate state-of-the-art AI technologies, like GPT-4 Vision"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'providing support and guidance for internal teams on how to best utilize these technologies within their workflows' indicates understanding business context and aligning technical solutions.",
                    "phrase": "providing support and guidance for internal teams on how to best utilize these technologies within their workflows"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS' involves operational aspects of AI solutions.",
                    "phrase": "Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction' relates to the development and maintenance of user-facing services.",
                    "phrase": "ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality' highlights understanding business needs and strategic goals.",
                    "phrase": "Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "providing support and guidance for internal teams"
                },
                {
                    "category": "SKILL3",
                    "phrase": "troubleshooting"
                },
                {
                    "category": "SKILL5",
                    "phrase": "redefine business standards"
                },
                {
                    "category": "SKILL2",
                    "phrase": "forward-thinking developer"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "GPT-4 Vision"
                },
                {
                    "category": "TECH2",
                    "phrase": "AWS"
                },
                {
                    "category": "TECH2",
                    "phrase": "Amazon CodeWhisperer"
                }
            ]
        }
    }
}