{
    "job_id": 356,
    "job_details": {
        "job_id": 356,
        "Organisatienaam": "Spheer",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Lead Full Stack Developer",
        "Standplaats": "Groningen",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": "Dominique Cirkel",
        "Telefoonnummer": "+31651645246",
        "E-mail": "DominiqueCirkel@spheer.ai",
        "Beroep": "Full stack developer (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "In je rol stuur je een klein team van back- en front-end developers aan, en ontwikkel je zelf mee. Je bent verantwoordelijk voor de architectuur en ontwikkeling van zowel de backend en frontend van onze webapplicatie Carto. De frontend wordt momenteel grotendeels ontwikkeld door een partnerbedrijf. Je werkt nauw met hen samen en plant en coördineert het gezamenlijke ontwikkelwerk. Je werkt ook samen met Spheers AI-specialisten en backend developers, om te zorgen dat onze AI zo goed mogelijk ontsloten wordt via Carto aan gebruikers.\n     * Je bent verantwoordelijk voor het bepalen van de technische richting en architectuur van Carto, waarbij je rekening houdt met performance, security, cloud compute kosten en de wensen van onze gebruikers.\n     * Je ontwikkelt en implementeert de backend-functionaliteit van nieuwe features in Python en frontend-functionaliteit in TypeScript.\n     * Je schrijft gestructureerde, herbruikbare en efficiënte code en bewaakt de codekwaliteit via reviews.\n     * Je stelt technische specificaties en user stories op in samenwerking met het team voor zowel de backend als de frontend.\n     * Je plant het werk voor het full-stack team, inclusief partners waarmee we samenwerken aan Carto.\n     * Je denkt mee met Spheers founders over de technische roadmap en toekomst van Carto voor meer jaren.\n     * Je begeleidt junioren in hun technische ontwikkeling, onder andere door pair-programming.",
        "Datum gevonden": "2025-03-25",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 3,
        "full_text": "Lead Full Stack Developer\n\nIn je rol stuur je een klein team van back- en front-end developers aan, en ontwikkel je zelf mee. Je bent verantwoordelijk voor de architectuur en ontwikkeling van zowel de backend en frontend van onze webapplicatie Carto. De frontend wordt momenteel grotendeels ontwikkeld door een partnerbedrijf. Je werkt nauw met hen samen en plant en coördineert het gezamenlijke ontwikkelwerk. Je werkt ook samen met Spheers AI-specialisten en backend developers, om te zorgen dat onze AI zo goed mogelijk ontsloten wordt via Carto aan gebruikers.\n     * Je bent verantwoordelijk voor het bepalen van de technische richting en architectuur van Carto, waarbij je rekening houdt met performance, security, cloud compute kosten en de wensen van onze gebruikers.\n     * Je ontwikkelt en implementeert de backend-functionaliteit van nieuwe features in Python en frontend-functionaliteit in TypeScript.\n     * Je schrijft gestructureerde, herbruikbare en efficiënte code en bewaakt de codekwaliteit via reviews.\n     * Je stelt technische specificaties en user stories op in samenwerking met het team voor zowel de backend als de frontend.\n     * Je plant het werk voor het full-stack team, inclusief partners waarmee we samenwerken aan Carto.\n     * Je denkt mee met Spheers founders over de technische roadmap en toekomst van Carto voor meer jaren.\n     * Je begeleidt junioren in hun technische ontwikkeling, onder andere door pair-programming."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses heavily on traditional full-stack development, team leadership, and project management. While it mentions collaboration with AI specialists and enabling AI access through the application, it does not describe core responsibilities related to building, fine-tuning, or deploying AI models themselves. The primary focus is on software architecture, development, and team coordination for a web application, not on AI-specific engineering tasks."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description explicitly mentions developing backend and frontend functionality, writing code, ensuring code quality, and developing new features for a web application.",
                    "phrase": "ontwikkel je zelf mee"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves defining the architecture and development of both backend and frontend for a web application.",
                    "phrase": "architectuur en ontwikkeling van zowel de backend en frontend van onze webapplicatie Carto"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The candidate will be responsible for developing backend functionality using Python and frontend functionality using TypeScript.",
                    "phrase": "ontwikkelt en implementeert de backend-functionaliteit van nieuwe features in Python en frontend-functionaliteit in TypeScript"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The job involves writing structured, reusable, and efficient code and maintaining code quality through reviews.",
                    "phrase": "schrijft gestructureerde, herbruikbare en efficiënte code en bewaakt de codekwaliteit via reviews"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role requires determining the technical direction and architecture, considering performance, security, cloud compute costs, and user needs.",
                    "phrase": "verantwoordelijk voor het bepalen van de technische richting en architectuur van Carto, waarbij je rekening houdt met performance, security, cloud compute kosten en de wensen van onze gebruikers"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The candidate will contribute to the technical roadmap and future vision of the application.",
                    "phrase": "denkt mee met Spheers founders over de technische roadmap en toekomst van Carto voor meer jaren"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves creating technical specifications and user stories for both backend and frontend.",
                    "phrase": "stelt technische specificaties en user stories op in samenwerking met het team voor zowel de backend als de frontend"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The role involves planning the work for the full-stack team, including external partners, which touches on project coordination and delivery.",
                    "phrase": "plant het werk voor het full-stack team, inclusief partners waarmee we samenwerken aan Carto"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The job requires close collaboration with a partner company and AI specialists, planning and coordinating joint development work.",
                    "phrase": "Je werkt nauw met hen samen en plant en coördineert het gezamenlijke ontwikkelwerk. Je werkt ook samen met Spheers AI-specialisten en backend developers"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "justification": "The role involves guiding junior developers through pair programming, indicating a focus on practical problem-solving and knowledge transfer.",
                    "phrase": "begeleidt junioren in hun technische ontwikkeling, onder andere door pair-programming"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "Leading a small team of developers and being responsible for architecture and development implies taking ownership of the product's technical direction.",
                    "phrase": "stuur je een klein team van back- en front-end developers aan, en ontwikkel je zelf mee. Je bent verantwoordelijk voor de architectuur en ontwikkeling"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Je werkt nauw met hen samen en plant en coördineert het gezamenlijke ontwikkelwerk. Je werkt ook samen met Spheers AI-specialisten en backend developers"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "begeleidt junioren in hun technische ontwikkeling, onder andere door pair-programming"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "stuur je een klein team van back- en front-end developers aan, en ontwikkel je zelf mee. Je bent verantwoordelijk voor de architectuur en ontwikkeling"
                }
            ],
            "technologies": [
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "Python"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "TypeScript"
                }
            ]
        }
    }
}