{
    "job_id": 1072,
    "job_details": {
        "job_id": 1072,
        "Organisatienaam": "Building Blocks",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI engineer",
        "Standplaats": "Tilburg",
        "Vacaturelink (origineel)": "building-blocks.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We connect @ CM.com\n            CM.com is a global and fast-growing technology company that is publicly listed. You might have already used our products by receiving texts or WhatsApp messages, buying tickets for events or festivals, or chatting with our AI-powered chatbot for support. Our goal is to help our customers provide the best possible experience to their end-users.\n            Although our work may be highly technical, we understand the importance of the people who work here. Our team is made up of ambitious, caring, and entrepreneurial individuals who work together every day to overcome any challenge. Our company philosophy has remained the same since we first began in 1999: \"Do what you love, do what you're good at, and contribute.\"\n            What you will do\n            As a junior AI engineer, you'll be joining our Generative AI team. This is a multidisciplinary team consisting of senior back-end engineers, front-end engineers, devops engineers, and data scientists. In this rapidly growing team, you'll be working on expanding CM.com's innovative AI platform. Building solutions that affect customers directly through the customer-facing products built by the team, but also providing services to other product teams within CM.com to facilitate their ability to adopt AI into their products and services.\n            You'll be expected to provide meaningful contributions to our back-end stack consisting primarily of Python, but you'll also gain familiarity and work with AI concepts like embeddings, vector databases, Natural Language Processing, and state-of-the-art Large Language Models. Working with services and models available in the market like OpenAI, but also working on integrating CM.com's own language models, and the services around those models.\n            All of this in an environment where scalability, maintainability, and adaptability are the top priority, in a landscape that's shifting on a weekly basis. In the current market, new state-of-the-art research has been happening consistently since the dawn of Generative AI, so as priorities shift constantly, you'll be expected to adapt, contribute and innovate together with your colleagues., In this role you have the benefit to join the Young Professional Program. As a YPP-participant, you'll engage in monthly training sessions designed to improve your skills and capabilities, both professionally and in soft skills. This traineeship program provides you the opportunity to collaborate with a diverse group of talented individuals from all departments at CM.com, stimulating invaluable networking opportunities within the organization.\n            Join the Young Professional Program and start a journey of personal and professional growth. Don't miss out on this chance and kickstart your career with this traineeship!\n            Benefits of working @CM.com\n            As a new Club Member at CM.com, you will join a global, inspirational, high-tech, and highly dynamic environment. To help you connect with your new colleagues, we organize a 3-day Global Onboarding program at our headquarters in Breda. This program offers a deep dive into the culture of CM.com and is filled with informative, practical, and fun activities. An exciting program will be waiting for you!\n               o Healthy lunch for everyone, every day;\n               o We've got shuttle mobility cards and company cars to ensure all our employees can get around easily;\n               o Pension plan of 8% of your monthly salary;\n               o 25 holidays per year and the option to purchase an additional 10 days annually;\n               o Employee Share Purchase Program that offers a discount on purchasing company shares;\n               o We offer internal and external training courses like Udemy and the CM Academy to help you develop professionally;\n               o To promote knowledge sharing, we organize different types of Meet-Ups with external speakers;\n               o Many fantastic social events: Weekly drinks in our CM bar, board game nights, karaoke party, quarterly events, vitality week, ski trip, wine tasting, and more. We have a wide range of activities to suit everyone's interests.\n            We are open, humble, and welcoming to everyone, regardless of age, culture, background, gender, or religion. Everyone gets to hang out backstage and enjoy the VIP deck, together!\n            If you're ready to join the Club, don't hesitate to apply now!\n            or",
        "Datum gevonden": "2024-06-17",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Zakelijke dienstverlening",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 6,
        "full_text": "AI engineer\n\nWe connect @ CM.com\n            CM.com is a global and fast-growing technology company that is publicly listed. You might have already used our products by receiving texts or WhatsApp messages, buying tickets for events or festivals, or chatting with our AI-powered chatbot for support. Our goal is to help our customers provide the best possible experience to their end-users.\n            Although our work may be highly technical, we understand the importance of the people who work here. Our team is made up of ambitious, caring, and entrepreneurial individuals who work together every day to overcome any challenge. Our company philosophy has remained the same since we first began in 1999: \"Do what you love, do what you're good at, and contribute.\"\n            What you will do\n            As a junior AI engineer, you'll be joining our Generative AI team. This is a multidisciplinary team consisting of senior back-end engineers, front-end engineers, devops engineers, and data scientists. In this rapidly growing team, you'll be working on expanding CM.com's innovative AI platform. Building solutions that affect customers directly through the customer-facing products built by the team, but also providing services to other product teams within CM.com to facilitate their ability to adopt AI into their products and services.\n            You'll be expected to provide meaningful contributions to our back-end stack consisting primarily of Python, but you'll also gain familiarity and work with AI concepts like embeddings, vector databases, Natural Language Processing, and state-of-the-art Large Language Models. Working with services and models available in the market like OpenAI, but also working on integrating CM.com's own language models, and the services around those models.\n            All of this in an environment where scalability, maintainability, and adaptability are the top priority, in a landscape that's shifting on a weekly basis. In the current market, new state-of-the-art research has been happening consistently since the dawn of Generative AI, so as priorities shift constantly, you'll be expected to adapt, contribute and innovate together with your colleagues., In this role you have the benefit to join the Young Professional Program. As a YPP-participant, you'll engage in monthly training sessions designed to improve your skills and capabilities, both professionally and in soft skills. This traineeship program provides you the opportunity to collaborate with a diverse group of talented individuals from all departments at CM.com, stimulating invaluable networking opportunities within the organization.\n            Join the Young Professional Program and start a journey of personal and professional growth. Don't miss out on this chance and kickstart your career with this traineeship!\n            Benefits of working @CM.com\n            As a new Club Member at CM.com, you will join a global, inspirational, high-tech, and highly dynamic environment. To help you connect with your new colleagues, we organize a 3-day Global Onboarding program at our headquarters in Breda. This program offers a deep dive into the culture of CM.com and is filled with informative, practical, and fun activities. An exciting program will be waiting for you!\n               o Healthy lunch for everyone, every day;\n               o We've got shuttle mobility cards and company cars to ensure all our employees can get around easily;\n               o Pension plan of 8% of your monthly salary;\n               o 25 holidays per year and the option to purchase an additional 10 days annually;\n               o Employee Share Purchase Program that offers a discount on purchasing company shares;\n               o We offer internal and external training courses like Udemy and the CM Academy to help you develop professionally;\n               o To promote knowledge sharing, we organize different types of Meet-Ups with external speakers;\n               o Many fantastic social events: Weekly drinks in our CM bar, board game nights, karaoke party, quarterly events, vitality week, ski trip, wine tasting, and more. We have a wide range of activities to suit everyone's interests.\n            We are open, humble, and welcoming to everyone, regardless of age, culture, background, gender, or religion. Everyone gets to hang out backstage and enjoy the VIP deck, together!\n            If you're ready to join the Club, don't hesitate to apply now!\n            or"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes working with Generative AI, including Large Language Models (LLMs), embeddings, vector databases, and Natural Language Processing. It mentions integrating market services like OpenAI and CM.com's own language models, aligning with the core responsibilities of a GenAI Engineer. The role involves building solutions that affect customers directly and providing services to other product teams, indicating a focus on developing and deploying AI-powered applications. The mention of Python as the primary backend stack, along with the need to adapt to a rapidly shifting landscape of state-of-the-art research, further supports this classification."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The job description explicitly mentions working with AI concepts like embeddings, vector databases, Natural Language Processing, and state-of-the-art Large Language Models. It also refers to integrating CM.com's own language models and services around them, which directly relates to the core process of creating, training, or adapting generative AI models.",
                    "phrase": "embeddings, vector databases, Natural Language Processing, and state-of-the-art Large Language Models"
                },
                {
                    "category": "TASK3",
                    "justification": "The role involves working with services and models available in the market like OpenAI, which are examples of using pre-trained generative models.",
                    "phrase": "OpenAI"
                },
                {
                    "category": "TASK3",
                    "justification": "The description mentions integrating CM.com's own language models, which falls under the adaptation and development of generative models.",
                    "phrase": "integrating CM.com's own language models"
                },
                {
                    "category": "TASK4",
                    "justification": "The role involves contributing to the back-end stack, primarily using Python, and building solutions that affect customers directly through customer-facing products. This indicates traditional software engineering tasks to integrate AI features into applications.",
                    "phrase": "back-end stack consisting primarily of Python"
                },
                {
                    "category": "TASK4",
                    "justification": "The job involves building solutions that affect customers directly through customer-facing products built by the team, which is a core aspect of software development for AI applications.",
                    "phrase": "Building solutions that affect customers directly through the customer-facing products"
                },
                {
                    "category": "TASK4",
                    "justification": "Providing services to other product teams within CM.com to facilitate their ability to adopt AI into their products and services implies developing and maintaining backend services that support AI functionalities.",
                    "phrase": "providing services to other product teams within CM.com to facilitate their ability to adopt AI into their products and services"
                },
                {
                    "category": "TASK5",
                    "justification": "The mention of 'scalability, maintainability, and adaptability are the top priority' in a rapidly shifting landscape of AI research and development points towards the operational aspects of deploying and maintaining AI systems.",
                    "phrase": "scalability, maintainability, and adaptability are the top priority"
                },
                {
                    "category": "TASK5",
                    "justification": "The job is in a 'rapidly growing team' and operates in a landscape that's 'shifting on a weekly basis' with 'new state-of-the-art research happening consistently', requiring adaptation and contribution, which are key aspects of MLOps in a dynamic environment.",
                    "phrase": "rapidly growing team... landscape that's shifting on a weekly basis... adapt, contribute and innovate"
                },
                {
                    "category": "TASK1",
                    "justification": "The company's goal is to 'help our customers provide the best possible experience to their end-users', and the role involves building solutions that directly impact this, indicating an understanding of business objectives.",
                    "phrase": "help our customers provide the best possible experience to their end-users"
                },
                {
                    "category": "TASK1",
                    "justification": "The description mentions 'expanding CM.com's innovative AI platform', which implies aligning technical work with the company's strategic innovation goals.",
                    "phrase": "expanding CM.com's innovative AI platform"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL5",
                    "phrase": "entrepreneurial individuals"
                },
                {
                    "category": "SKILL2",
                    "phrase": "adapt to new technologies"
                },
                {
                    "category": "SKILL2",
                    "phrase": "adapt, contribute and innovate"
                },
                {
                    "category": "SKILL1",
                    "phrase": "work together every day"
                },
                {
                    "category": "SKILL1",
                    "phrase": "collaborate with a diverse group of talented individuals"
                },
                {
                    "category": "SKILL5",
                    "phrase": "contribute"
                },
                {
                    "category": "SKILL5",
                    "phrase": "innovate"
                }
            ],
            "technologies": [
                {
                    "category": "TECH1",
                    "phrase": "Python"
                },
                {
                    "category": "TECH3",
                    "phrase": "OpenAI"
                },
                {
                    "category": "TECH5",
                    "phrase": "vector databases"
                },
                {
                    "category": "TECH4",
                    "phrase": "embeddings"
                },
                {
                    "category": "TECH2",
                    "phrase": "Large Language Models"
                }
            ]
        }
    }
}