{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Ontwikkelen en optimaliseren van implementaties van taalmodellen",
                "justification": "The phrase directly refers to the development and optimization of language models, which is a core aspect of modeling."
            },
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Implementeren van betrouwbare en efficiënte data pipelines voor de verzameling, opslag, verwerking en analyse van grote hoeveelheden data",
                "justification": "This describes the foundational tasks of building and managing data pipelines for data collection, storage, processing, and analysis."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Samenwerken met Digital Product Teams om technische oplossingen te ontwerpen die gebruikmaken van onze standaard bouwblokken voor de implementatie van nieuwe digitale producten",
                "justification": "This highlights the collaborative effort to design and implement technical solutions for digital products, indicating software development."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "combineer je diepgaande technische expertise met een innovatieve mindset om onze data-infrastructuur te ondersteunen via het gebruik van taalmodellen",
                "justification": "This phrase indicates the need to understand how technical solutions support the overall data infrastructure and business objectives."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "continu verbeteren van de datakwaliteit en verwerkingsefficiëntie door het implementeren van moderne datatechnologieën en best practices",
                "justification": "Implementing modern data technologies and best practices to improve efficiency points towards software development and system improvement."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "taalmodellen"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Je werkt samen met zowel Technische Platform Teams als Digital Product Teams"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Bieden van technische ondersteuning en kennisdeling binnen de organisatie"
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "innovatieve mindset"
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 3,
        "rationale": "The job description emphasizes the development and optimization of 'taalmodellen' (language models) and the implementation of solutions using them. While data engineering tasks are present, the core focus on language model implementation and integration into digital products aligns more closely with the GenAI Engineer profile."
    }
}