{
    "job_id": 552,
    "job_details": {
        "job_id": 552,
        "Organisatienaam": "Rochdale",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Data engineer",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "intermediair.nl",
        "Contactpersoon": "Chris Horst",
        "Telefoonnummer": null,
        "E-mail": "chorst@rochdale.nl",
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Rochdale zet zich in voor sterke buurten, waar inwoners meer kansen hebben. We bouwen, verduurzamen en maken kwetsbare buurten sterker. Jij kunt hier een mooie bijdrage aan leveren vanuit jouw rol als data engineer. Je bent verantwoordelijk voor de ETL-processen waardoor de organisatie elke dag de beschikking heeft over actuele informatie. Je bent op de hoogte van de laatste technologische ontwikkelingen, zoals op het gebied van GenAI en bent in staat deze te vertalen naar bruikbare toepassingen voor onze (eind)gebruikers. Daarnaast focus jij je op onze Lakehouse constructie in de Microsoft Azure omgeving en zorgt voor de doorontwikkeling ervan. Python en SQL zijn bekende termen voor jou en ook het toepassen van CI/CD methodologieën zijn jou niet onbekend.\n\n   De afdeling waar je komt te werken is het Data Competence Center (DCC) binnen de afdeling Digitalisering & Informatievoorziening en bestaat uit twee data-specialisten en een datamanager. Het DCC maakt gebruik van de modernste Microsoft Azure tooling waaronder PowerBI, Azure DevOps, Data Lake en Synapse Analytics. Het DCC werkt volgens de scrum methodiek en ontwikkelt met behulp van DevOps. De afdeling Digitalisering & Informatievoorziening heeft zich de afgelopen jaren meer en meer ontwikkeld naar een regie-organisatie, die enerzijds de (veranderende) behoefte vanuit de business ophaalt en ordent en anderzijds de dienstverlening door externe IT-dienstverleners regisseert, zodat deze aansluit op de behoefte van de business. Wij zoeken een collega die warm loopt als engineer voor het neerzetten, onderhouden en verder optimaliseren van ons data-infrastructuur.\n\n   Jouw werkdag\n   Eerst een kop koffie halen op 5, waar de barista van de espressobar voor je klaar staat. Dan start de dag met een standup met het DCC-team. De uitdagingen voor het team zijn groot: hoe gaan we in gesprek met onze collega's om duidelijk te krijgen welke behoefte aan (stuur)informatie er is en hoe kunnen we dit vormgeven met onze data en technieken. Met als perspectief uiteraard hoe deze stuurinformatie bijdraagt aan onze strategische doelen en het verschil gaat maken voor de collega's en onze huurders. Jij als data engineer adviseert over nieuwe technologische toepassingen en ontwikkelingen en neemt het team mee in het optimaliseren van de bestaande technieken en processen. Naast adviseren ga je ook aan de slag met het daadwerkelijk uitwerken en implementeren van deze nieuwe initiatieven en ontwikkelingen.\n\n   Als data engineer ben je gesprekspartner voor het team DCC en de D&I afdeling, je doet analyses en komt met voorstellen. Samenwerken met collega's en meedoen in projecten is vanzelfsprekend. Je brengt hier je kennis en expertise over technologische mogelijkheden in. Ook is er tijd nodig om de data-architectuur en -structuur op orde te brengen en houden. We conformeren ons aan standaarden en we bewaken de datakwaliteit; kortom binnen het DCC werken we 'netjes'.",
        "Datum gevonden": "2024-05-16",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Tijdelijk contract",
        "Parttime / fulltime": "Parttime / Fulltime",
        "Branche": "Handel",
        "Organisatiegrootte": "500-999",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 5,
        "full_text": "Data engineer\n\nRochdale zet zich in voor sterke buurten, waar inwoners meer kansen hebben. We bouwen, verduurzamen en maken kwetsbare buurten sterker. Jij kunt hier een mooie bijdrage aan leveren vanuit jouw rol als data engineer. Je bent verantwoordelijk voor de ETL-processen waardoor de organisatie elke dag de beschikking heeft over actuele informatie. Je bent op de hoogte van de laatste technologische ontwikkelingen, zoals op het gebied van GenAI en bent in staat deze te vertalen naar bruikbare toepassingen voor onze (eind)gebruikers. Daarnaast focus jij je op onze Lakehouse constructie in de Microsoft Azure omgeving en zorgt voor de doorontwikkeling ervan. Python en SQL zijn bekende termen voor jou en ook het toepassen van CI/CD methodologieën zijn jou niet onbekend.\n\n   De afdeling waar je komt te werken is het Data Competence Center (DCC) binnen de afdeling Digitalisering & Informatievoorziening en bestaat uit twee data-specialisten en een datamanager. Het DCC maakt gebruik van de modernste Microsoft Azure tooling waaronder PowerBI, Azure DevOps, Data Lake en Synapse Analytics. Het DCC werkt volgens de scrum methodiek en ontwikkelt met behulp van DevOps. De afdeling Digitalisering & Informatievoorziening heeft zich de afgelopen jaren meer en meer ontwikkeld naar een regie-organisatie, die enerzijds de (veranderende) behoefte vanuit de business ophaalt en ordent en anderzijds de dienstverlening door externe IT-dienstverleners regisseert, zodat deze aansluit op de behoefte van de business. Wij zoeken een collega die warm loopt als engineer voor het neerzetten, onderhouden en verder optimaliseren van ons data-infrastructuur.\n\n   Jouw werkdag\n   Eerst een kop koffie halen op 5, waar de barista van de espressobar voor je klaar staat. Dan start de dag met een standup met het DCC-team. De uitdagingen voor het team zijn groot: hoe gaan we in gesprek met onze collega's om duidelijk te krijgen welke behoefte aan (stuur)informatie er is en hoe kunnen we dit vormgeven met onze data en technieken. Met als perspectief uiteraard hoe deze stuurinformatie bijdraagt aan onze strategische doelen en het verschil gaat maken voor de collega's en onze huurders. Jij als data engineer adviseert over nieuwe technologische toepassingen en ontwikkelingen en neemt het team mee in het optimaliseren van de bestaande technieken en processen. Naast adviseren ga je ook aan de slag met het daadwerkelijk uitwerken en implementeren van deze nieuwe initiatieven en ontwikkelingen.\n\n   Als data engineer ben je gesprekspartner voor het team DCC en de D&I afdeling, je doet analyses en komt met voorstellen. Samenwerken met collega's en meedoen in projecten is vanzelfsprekend. Je brengt hier je kennis en expertise over technologische mogelijkheden in. Ook is er tijd nodig om de data-architectuur en -structuur op orde te brengen en houden. We conformeren ons aan standaarden en we bewaken de datakwaliteit; kortom binnen het DCC werken we 'netjes'."
    },
    "analysis": {
        "job_profile": "Ambiguous / Not Relevant",
        "confidence_score": 2,
        "rationale": "The job title and description primarily focus on traditional data engineering tasks like ETL, data infrastructure, and data architecture within a Microsoft Azure environment. While GenAI is mentioned as a technology to be aware of and translate into applications, it is not the core focus or a primary responsibility. The role emphasizes data pipelines and infrastructure over building or fine-tuning generative models.",
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK2: Data Engineering",
                    "phrases": [
                        "verantwoordelijk voor de ETL-processen",
                        "beschikking heeft over actuele informatie",
                        "focus jij je op onze Lakehouse constructie in de Microsoft Azure omgeving en zorgt voor de doorontwikkeling ervan",
                        "neerzetten, onderhouden en verder optimaliseren van ons data-infrastructuur",
                        "data-architectuur en -structuur op orde te brengen en houden"
                    ],
                    "justification": "These phrases directly relate to building, maintaining, and optimizing data pipelines, infrastructure, and architecture, which are core to data engineering."
                },
                {
                    "category": "TASK1: Business Understanding",
                    "phrases": [
                        "Rochdale zet zich in voor sterke buurten, waar inwoners meer kansen hebben.",
                        "We bouwen, verduurzamen en maken kwetsbare buurten sterker.",
                        "hoe deze stuurinformatie bijdraagt aan onze strategische doelen en het verschil gaat maken voor de collega's en onze huurders.",
                        "de (veranderende) behoefte vanuit de business ophaalt en ordent"
                    ],
                    "justification": "These phrases indicate an understanding of the organization's mission, strategic goals, and the need to align data initiatives with business requirements and user needs."
                },
                {
                    "category": "TASK4: Software Development",
                    "phrases": [
                        "Python en SQL zijn bekende termen voor jou",
                        "toepassen van CI/CD methodologieën zijn jou niet onbekend",
                        "ontwikkelt met behulp van DevOps"
                    ],
                    "justification": "Mention of programming languages (Python, SQL) and development methodologies (CI/CD, DevOps) points to software development practices, though primarily in the context of data infrastructure and pipelines."
                },
                {
                    "category": "TASK3: Modeling",
                    "phrases": [
                        "op het gebied van GenAI en bent in staat deze te vertalen naar bruikbare toepassingen voor onze (eind)gebruikers."
                    ],
                    "justification": "The mention of GenAI and translating it into applications suggests some involvement in modeling, but it's framed as an awareness and application rather than core model development or fine-tuning."
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "phrases": [
                        "toepassen van CI/CD methodologieën zijn jou niet onbekend",
                        "ontwikkelt met behulp van DevOps"
                    ],
                    "justification": "CI/CD and DevOps are mentioned in the context of development practices, which are foundational to MLOps, but the description doesn't detail specific MLOps responsibilities for AI models."
                }
            ],
            "technologies": [
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "name": "Microsoft Azure"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "name": "PowerBI"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "name": "Azure DevOps"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "name": "Data Lake"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "name": "Synapse Analytics"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "name": "Python"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "name": "SQL"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrases": [
                        "gesprekspartner voor het team DCC en de de D&I afdeling",
                        "Samenwerken met collega's en meedoen in projecten is vanzelfsprekend.",
                        "hoe we in gesprek met onze collega's om duidelijk te krijgen welke behoefte aan (stuur)informatie er is"
                    ]
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrases": [
                        "De uitdagingen voor het team zijn groot: hoe gaan we in gesprek met onze collega's om duidelijk te krijgen welke behoefte aan (stuur)informatie er is en hoe kunnen we dit vormgeven met onze data en technieken.",
                        "adviseert over nieuwe technologische toepassingen en ontwikkelingen en neemt het team mee in het optimaliseren van de bestaande technieken en processen."
                    ]
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrases": [
                        "Je bent op de hoogte van de laatste technologische ontwikkelingen, zoals op het gebied van GenAI",
                        "adviseert over nieuwe technologische toepassingen en ontwikkelingen"
                    ]
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrases": [
                        "neemt het team mee in het optimaliseren van de bestaande technieken en processen.",
                        "aan de slag met het daadwerkelijk uitwerken en implementeren van deze nieuwe initiatieven en ontwikkelingen."
                    ]
                }
            ]
        }
    }
}