{
    "job_id": 1237,
    "job_details": {
        "job_id": 1237,
        "Organisatienaam": "SIG",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Software Improvement Group Exam Developer",
        "Standplaats": "Den Haag",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Consultant ICT (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "As an Exam Developer, you coordinate all the activities related to developing new exams, translating existing exams to several different languages, updating the exams to current standards during maintenance, and implementing exam products in the various systems. In addition, you review the quality of the exams through item and test analysis. You work on all exams that form part of EXIN's certification portfolio.\n   Importantly, you will collaborate closely with the Exam Developers to integrate generative AI solutions into our processes. You can translate internal guidelines into machine learning algorithms while maintaining legal, qualitative and ethical compliance in the outcomes. You stay up to date with the latest research and developments in the field of AI and machine learning., * Coordinating work with subject matter experts and cooperating with third parties in creating, localizing, implementing and maintaining exam products\n     * Ensuring that deliverables are in line with high-quality standards, are within budget, and delivered on time\n     * (Co)developing and improving exam products in line with guidelines for educational measurement\n     * Testing exam products (exams and corresponding materials) for the other team members\n     * Independently writing and maintaining machine learning algorithms complying with standards, best practices and company policies\n     * Supporting our Customer Success Center by preparing responses to customer questions on the content of the exams\n     * Detecting (using test analysis) and resolving issues related to the exam products, and performing root cause analyses to take corrective actions\n     * Keeping your knowledge in the domain up-to-date\n     * Representing EXIN through attending (online) events",
        "Datum gevonden": "2024-08-04",
        "Beroepsgroep": "Consultants en specialisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Handel",
        "Organisatiegrootte": "200-499",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "Software Improvement Group Exam Developer\n\nAs an Exam Developer, you coordinate all the activities related to developing new exams, translating existing exams to several different languages, updating the exams to current standards during maintenance, and implementing exam products in the various systems. In addition, you review the quality of the exams through item and test analysis. You work on all exams that form part of EXIN's certification portfolio.\n   Importantly, you will collaborate closely with the Exam Developers to integrate generative AI solutions into our processes. You can translate internal guidelines into machine learning algorithms while maintaining legal, qualitative and ethical compliance in the outcomes. You stay up to date with the latest research and developments in the field of AI and machine learning., * Coordinating work with subject matter experts and cooperating with third parties in creating, localizing, implementing and maintaining exam products\n     * Ensuring that deliverables are in line with high-quality standards, are within budget, and delivered on time\n     * (Co)developing and improving exam products in line with guidelines for educational measurement\n     * Testing exam products (exams and corresponding materials) for the other team members\n     * Independently writing and maintaining machine learning algorithms complying with standards, best practices and company policies\n     * Supporting our Customer Success Center by preparing responses to customer questions on the content of the exams\n     * Detecting (using test analysis) and resolving issues related to the exam products, and performing root cause analyses to take corrective actions\n     * Keeping your knowledge in the domain up-to-date\n     * Representing EXIN through attending (online) events"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on exam development, localization, and maintenance, with a secondary mention of integrating generative AI solutions. While it mentions translating guidelines into machine learning algorithms and staying updated on AI/ML research, the core responsibilities and tasks are centered around educational content development and quality assurance rather than the core engineering of AI models or systems. The role appears to be more about applying AI tools to existing processes rather than building AI systems, fitting the 'Ambiguous' profile as it primarily focuses on the use of AI tools to enhance productivity within an educational context."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1",
                    "justification": "The role involves coordinating activities related to exam development, localization, and maintenance, which requires understanding the business context of certification and educational standards.",
                    "phrase": "coordinate all the activities related to developing new exams, translating existing exams to several different languages, updating the exams to current standards during maintenance, and implementing exam products in the various systems."
                },
                {
                    "category": "TASK1",
                    "justification": "The role requires understanding and applying guidelines for educational measurement, which is a business-specific requirement.",
                    "phrase": "(Co)developing and improving exam products in line with guidelines for educational measurement"
                },
                {
                    "category": "TASK3",
                    "justification": "The role explicitly mentions writing and maintaining machine learning algorithms, indicating a direct involvement in model development.",
                    "phrase": "Independently writing and maintaining machine learning algorithms complying with standards, best practices and company policies"
                },
                {
                    "category": "TASK4",
                    "justification": "The role involves implementing exam products in various systems and potentially integrating AI solutions into these systems, suggesting software development aspects.",
                    "phrase": "implementing exam products in the various systems"
                },
                {
                    "category": "TASK4",
                    "justification": "The role mentions collaborating closely with Exam Developers to integrate generative AI solutions into processes, which implies building or integrating software components.",
                    "phrase": "collaborate closely with the Exam Developers to integrate generative AI solutions into our processes."
                },
                {
                    "category": "TASK5",
                    "justification": "The role mentions translating internal guidelines into machine learning algorithms while maintaining legal, qualitative and ethical compliance in the outcomes, which touches upon operational aspects of AI development and deployment.",
                    "phrase": "translate internal guidelines into machine learning algorithms while maintaining legal, qualitative and ethical compliance in the outcomes."
                },
                {
                    "category": "TASK2",
                    "justification": "The role involves reviewing the quality of exams through item and test analysis, which can be considered a form of data analysis on exam performance.",
                    "phrase": "review the quality of the exams through item and test analysis."
                },
                {
                    "category": "TASK2",
                    "justification": "Detecting and resolving issues related to exam products using test analysis and performing root cause analyses are data-driven problem-solving activities.",
                    "phrase": "Detecting (using test analysis) and resolving issues related to the exam products, and performing root cause analyses to take corrective actions"
                },
                {
                    "category": "SKILL2",
                    "justification": "The phrase 'stay up to date with the latest research and developments in the field of AI and machine learning' directly indicates a need for continuous learning and adaptability.",
                    "phrase": "stay up to date with the latest research and developments in the field of AI and machine learning."
                },
                {
                    "category": "SKILL4",
                    "justification": "The phrase 'maintaining legal, qualitative and ethical compliance in the outcomes' points to a responsibility for ethical and legal considerations in the developed algorithms.",
                    "phrase": "maintaining legal, qualitative and ethical compliance in the outcomes"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "cooperate with third parties"
                },
                {
                    "category": "SKILL1",
                    "phrase": "Supporting our Customer Success Center by preparing responses to customer questions"
                },
                {
                    "category": "SKILL2",
                    "phrase": "Keeping your knowledge in the domain up-to-date"
                },
                {
                    "category": "SKILL3",
                    "phrase": "review the quality of the exams through item and test analysis."
                },
                {
                    "category": "SKILL3",
                    "phrase": "Detecting (using test analysis) and resolving issues related to the exam products, and performing root cause analyses to take corrective actions"
                },
                {
                    "category": "SKILL4",
                    "phrase": "maintaining legal, qualitative and ethical compliance in the outcomes"
                },
                {
                    "category": "SKILL5",
                    "phrase": "Independently writing and maintaining machine learning algorithms"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "generative AI solutions"
                },
                {
                    "category": "TECH10",
                    "phrase": "machine learning algorithms"
                }
            ]
        }
    }
}