{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Work in conjunction with the sales team as a key technical advisor and advocate for DoiT while mapping value to the prospect's needs.",
                "justification": "This phrase describes understanding the prospect's needs and aligning technical solutions with business value, which falls under Business Understanding."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Implement strategies to improve trial win rates, beat the competition, and develop stronger technical buyer relationships.",
                "justification": "Focuses on business outcomes (win rates, competition) and relationships, indicating a need for business context and strategic thinking."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Understand and implement technical sales strategies based on competitive selling strategy",
                "justification": "Directly relates to understanding and applying business strategies in a sales context."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Understand and manage complex technical sales processes in a complex IT environment with multiple departments and stakeholders.",
                "justification": "Highlights the need to navigate complex business environments and manage sales processes."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Partner with Product Marketing on effective strategies to manage and deliver demonstrations, maintain demo environments, and respond to RFPs.",
                "justification": "Involves collaboration with marketing on strategies and response to business requests (RFPs)."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Ensure timely entry of data into internal business support solutions.",
                "justification": "Relates to managing business data and processes within internal systems."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Contribute to systems and tools to provide key business information and metrics to highlight performance and effectiveness.",
                "justification": "Focuses on providing business insights and performance metrics."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Contribute to, and employ, best practices in the execution of demos and trials as a subject matter expert on our SaaS packages and functionality.",
                "justification": "While it involves expertise on SaaS packages, the primary action is execution of demos and trials, which is a task within a sales engineering/presales context, not core software development."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Develop and deliver engaging demonstrations in collaboration with our Sales, Marketing and Training Teams to both business and technical users.",
                "justification": "Focuses on creating and delivering demonstrations, a key part of a presales engineering role rather than core software development."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "maintain demo environments",
                "justification": "Maintaining environments for demonstrations is a task related to supporting sales activities, not core software development."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Present to prospects, customers and partners, at external events, conferences, seminars, etc.",
                "justification": "This is a communication and presentation task, not a software development task."
            }
        ],
        "technologies": [],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Work in conjunction with the sales team as a key technical advisor and advocate"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "develop stronger technical buyer relationships"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Develop and deliver engaging demonstrations in collaboration with our Sales, Marketing and Training Teams"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Present to prospects, customers and partners, at external events, conferences, seminars, etc."
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "Understand and manage complex technical sales processes in a complex IT environment with multiple departments and stakeholders."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "as a key technical advisor and advocate for DoiT"
            }
        ]
    },
    "classification": {
        "profile": "Ambiguous / Not Relevant",
        "confidence": 5,
        "rationale": "This job description focuses heavily on sales support, technical advising, and customer engagement within a sales context. It lacks any mention of AI, machine learning, generative models, or related technical development tasks, placing it outside the scope of an AI Engineer role."
    }
}