{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Onderzoek of het functiewaarderingsproces kan worden ondersteund door AI.",
                "justification": "The phrase indicates an investigation into how AI can support a business process (functiewaarderingsproces - job evaluation process)."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Formuleer een onderbouwde functiewaardering aangeeft conform de regels van de FUWADEF methode.",
                "justification": "This phrase directly describes the task of generating a reasoned job evaluation based on a specific method (FUWADEF), which implies the application of a model or system to interpret rules and input."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "de Formatieadviseur een functiebeschrijving in ChatGPT/LLM kan plaatsen en de AI tool een onderbouwde functiewaardering aangeeft",
                "justification": "This describes the core interaction with a generative AI model (ChatGPT/LLM) to produce a specific output (job evaluation), highlighting the use of generative AI capabilities."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "In het kader van de Change zal de inhuur van een prompt engineer Regelbeheersing optimaliseren en sneller afhandelen.",
                "justification": "This phrase discusses optimizing and expediting rule management within a change context, showing a focus on business process improvement."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "de stap om van verschillende bronnen de beslissingen te identificeren mogelijk is.",
                "justification": "Identifying decisions from various sources suggests a process that could involve model interpretation or data extraction for decision-making support."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "De voorwaarden waaraan moet worden voldaan t.a.v. de beslissing uit de bronnen kan worden gehaald.",
                "justification": "Extracting conditions related to decisions from sources implies a process of analyzing and applying rules or logic, which is a form of modeling."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "De resultaten in het RuleSpeak formaat opgesteld kunnen worden.",
                "justification": "Generating results in a specific format (RuleSpeak) implies a structured output derived from processing information, aligning with modeling activities."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "ChatGPT"
            },
            {
                "category_id": "TECH3",
                "tool_name": "LLM"
            },
            {
                "category_id": "TECH4",
                "tool_name": "Prompt Engineer"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "de AI-specialist/Prompt Engineer ons in kunnen ondersteunen/ontlasten."
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "Onderzoek of het functiewaarderingsproces kan worden ondersteund door AI."
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "de stap om van verschillende bronnen de beslissingen te identificeren mogelijk is."
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "The job description heavily emphasizes the use of LLMs (ChatGPT/LLM) and prompt engineering to automate a specific business process (job evaluation). The core task involves leveraging generative AI to interpret rules and generate structured outputs, aligning directly with the definition of a GenAI Engineer."
    }
}