{
    "job_id": 147,
    "job_details": {
        "job_id": 147,
        "Organisatienaam": "ABN AMRO Bank N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Business Developer",
        "Standplaats": "Amersfoort",
        "Vacaturelink (origineel)": "abnamro.com",
        "Contactpersoon": "Justus Damman, Emma Meuter",
        "Telefoonnummer": "+31621894323",
        "E-mail": "justus.damman@florius.nl",
        "Beroep": "Business development manager (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als Business Developer Digital / business analist binnen Florius/Moneyou werk je samen met je team aan digitale oplossingen voor (onafhankelijk) hypotheekadviseurs en klanten. Denk hierbij aan Florius.nl, mijnFlorius/mijnMoneyou en de extranetten voor adviseurs van ABN AMRO, Forius en Moneyou. Je team bestaat uit 1 of 2 Digital collega's en 5 a 8 developers vanuit IT. Samen werken jullie aan innovatieve toepassingen voor Florius, Moneyou en ABN AMRO (intermediaire distributie hypotheken).\n\nBinnen Florius/Moneyou wordt gewerkt met vanuit een overall backlog, waarbij het werk door 1 van de circa 10 business / IT teams wordt opgepakt. Het team is verantwoordelijk voor de verdere invulling en realisatie van het product. Je werkt mee aan de roadmaps voor MijnFlorius/MijnMoneyou, maar ook onderdelen van de extranetten of toepassingen zoals de chatbot, de Florius apps, digitaal ondertekenen, online identificeren etc.. Het team houdt die verantwoordelijkheid ook na oplevering (\"You build it, you run it\"). Je bepaalt samen met de Team Product Owner (Digital collega) en het team jullie eigen backlog. Complexe vraagstukken (functionaliteit voor klanten en adviseurs zoals wettelijke aanpassingen in de aanvraagmodules, inloggen voor adviseurs en klanten, extra aflossen via iDeal, indienen en wijzigingen van hypotheekverzoeken) vind je uitdagend om samen met je team op te lossen. Om je werk goed te doen, moet je je zelf regelmatig verdiepen in de materie, zodat de beste oplossing\n   voor adviseur of klant kan worden gemaakt. Maar ook storingen komen direct bij het team terecht, dus moeten in worden gepast. Dit doe je in een moderne IT omgeving.\n\nWerkomgeving\n\n   Florius/Moneyou kent circa 200 directe collega's en Digital 20 a 25. Naast Digital kent Florius een Customer Experience afdeling (MarCom), Channel Management (beleid), Advies & Service (klantcontact), Intermediaire Verkoop (relatiemanagement), Customer Due Diligence en Moneyou. Je zit dus midden in de hypotheken business en je werkt zeer intensief samen met de IT-collega's die de (veelal Digital) zaken maken. Je werkt dagelijks in het agile team en samen ben je van idee tot en met realisatie en gebruik verantwoordelijk. Met je team breng je dit van \"een idee\" naar werkende functionaliteit waar adviseurs en klanten dagelijks gebruik van maken. Een deel van de werkzaamheden bevat het vertalen van wet- en regelgeving naar concrete stories die developers kunnen oppakken.\n   Je werkt binnen ABN AMRO en dus alle mogelijkheden om je als professional te ontwikkelen en daarnaast binnen Florius/Moneyou met alle mogelijkheden om je ideeën te realiseren met je team\n\nHet succes van onze organisatie staat of valt met de kwaliteit van onze mensen en de ideeen die zij hebben. Echt verrassende inzichten en innovatieve oplossingen voor onze klanten ontstaan door een samenspel van culturen, kennis en ervaring. Daarom is diversiteit voor onze organisatie ontzettend belangrijk. Om ervoor te zorgen dat alle collega's binnen ABN AMRO hun kwaliteiten kunnen ontplooien, stimuleren we een inclusieve cultuur waarin iedereen zich betrokken en gewaardeerd voelt.\n\nDisclaimerexterne recruitmentbureaus\n\n   Externe recruitmentbureaus dienen een overeenkomst met ABN AMRO BANK N.V. te hebben getekend, uitgegeven door een Talent Acquisition Specialist, om cv's te mogen indienen. Acquisitie wordt daarom niet op prijs gesteld.",
        "Datum gevonden": "2025-02-08",
        "Beroepsgroep": "Managers verkoop",
        "Beroepsklasse": "Verkoop en handel",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Financieel / Verzekeringen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Business Developer\n\nAls Business Developer Digital / business analist binnen Florius/Moneyou werk je samen met je team aan digitale oplossingen voor (onafhankelijk) hypotheekadviseurs en klanten. Denk hierbij aan Florius.nl, mijnFlorius/mijnMoneyou en de extranetten voor adviseurs van ABN AMRO, Forius en Moneyou. Je team bestaat uit 1 of 2 Digital collega's en 5 a 8 developers vanuit IT. Samen werken jullie aan innovatieve toepassingen voor Florius, Moneyou en ABN AMRO (intermediaire distributie hypotheken).\n\nBinnen Florius/Moneyou wordt gewerkt met vanuit een overall backlog, waarbij het werk door 1 van de circa 10 business / IT teams wordt opgepakt. Het team is verantwoordelijk voor de verdere invulling en realisatie van het product. Je werkt mee aan de roadmaps voor MijnFlorius/MijnMoneyou, maar ook onderdelen van de extranetten of toepassingen zoals de chatbot, de Florius apps, digitaal ondertekenen, online identificeren etc.. Het team houdt die verantwoordelijkheid ook na oplevering (\"You build it, you run it\"). Je bepaalt samen met de Team Product Owner (Digital collega) en het team jullie eigen backlog. Complexe vraagstukken (functionaliteit voor klanten en adviseurs zoals wettelijke aanpassingen in de aanvraagmodules, inloggen voor adviseurs en klanten, extra aflossen via iDeal, indienen en wijzigingen van hypotheekverzoeken) vind je uitdagend om samen met je team op te lossen. Om je werk goed te doen, moet je je zelf regelmatig verdiepen in de materie, zodat de beste oplossing\n   voor adviseur of klant kan worden gemaakt. Maar ook storingen komen direct bij het team terecht, dus moeten in worden gepast. Dit doe je in een moderne IT omgeving.\n\nWerkomgeving\n\n   Florius/Moneyou kent circa 200 directe collega's en Digital 20 a 25. Naast Digital kent Florius een Customer Experience afdeling (MarCom), Channel Management (beleid), Advies & Service (klantcontact), Intermediaire Verkoop (relatiemanagement), Customer Due Diligence en Moneyou. Je zit dus midden in de hypotheken business en je werkt zeer intensief samen met de IT-collega's die de (veelal Digital) zaken maken. Je werkt dagelijks in het agile team en samen ben je van idee tot en met realisatie en gebruik verantwoordelijk. Met je team breng je dit van \"een idee\" naar werkende functionaliteit waar adviseurs en klanten dagelijks gebruik van maken. Een deel van de werkzaamheden bevat het vertalen van wet- en regelgeving naar concrete stories die developers kunnen oppakken.\n   Je werkt binnen ABN AMRO en dus alle mogelijkheden om je als professional te ontwikkelen en daarnaast binnen Florius/Moneyou met alle mogelijkheden om je ideeën te realiseren met je team\n\nHet succes van onze organisatie staat of valt met de kwaliteit van onze mensen en de ideeen die zij hebben. Echt verrassende inzichten en innovatieve oplossingen voor onze klanten ontstaan door een samenspel van culturen, kennis en ervaring. Daarom is diversiteit voor onze organisatie ontzettend belangrijk. Om ervoor te zorgen dat alle collega's binnen ABN AMRO hun kwaliteiten kunnen ontplooien, stimuleren we een inclusieve cultuur waarin iedereen zich betrokken en gewaardeerd voelt.\n\nDisclaimerexterne recruitmentbureaus\n\n   Externe recruitmentbureaus dienen een overeenkomst met ABN AMRO BANK N.V. te hebben getekend, uitgegeven door een Talent Acquisition Specialist, om cv's te mogen indienen. Acquisitie wordt daarom niet op prijs gesteld."
    },
    "analysis": {
        "profile_classification": {
            "profile": "`Ambiguous / Not Relevant`",
            "confidence_score": 2,
            "rationale": "The job description focuses on business development and analysis within the mortgage sector, with a strong emphasis on understanding business needs and translating them into functional requirements for developers. While it mentions \"digital solutions\" and \"innovative applications\" like chatbots, it lacks the core technical depth required for an ML Engineer or GenAI Engineer role, such as algorithm development, model training, or deep generative AI implementation."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task": "`TASK1: Business Understanding`",
                    "phrases": [
                        "Als Business Developer Digital / business analist binnen Florius/Moneyou werk je samen met je team aan digitale oplossingen",
                        "Je team bestaat uit 1 of 2 Digital collega's en 5 a 8 developers vanuit IT.",
                        "Samen werken jullie aan innovatieve toepassingen voor Florius, Moneyou en ABN AMRO (intermediaire distributie hypotheken).",
                        "Het team is verantwoordelijk voor de verdere invulling en realisatie van het product.",
                        "Je werkt mee aan de roadmaps voor MijnFlorius/MijnMoneyou, maar ook onderdelen van de extranetten of toepassingen zoals de chatbot, de Florius apps, digitaal ondertekenen, online identificeren etc..",
                        "Complexe vraagstukken (functionaliteit voor klanten en adviseurs zoals wettelijke aanpassingen in de aanvraagmodules, inloggen voor adviseurs en klanten, extra aflossen via iDeal, indienen en wijzigingen van hypotheekverzoeken) vind je uitdagend om samen met je team op te lossen.",
                        "Om je werk goed te doen, moet je je zelf regelmatig verdiepen in de materie, zodat de beste oplossing voor adviseur of klant kan worden gemaakt.",
                        "Je werkt dagelijks in het agile team en samen ben je van idee tot en met realisatie en gebruik verantwoordelijk.",
                        "Met je team breng je dit van \"een idee\" naar werkende functionaliteit waar adviseurs en klanten dagelijks gebruik van maken.",
                        "Een deel van de werkzaamheden bevat het vertalen van wet- en regelgeving naar concrete stories die developers kunnen oppakken."
                    ],
                    "justification": "The phrases highlight understanding business needs, translating them into product features, working with roadmaps, and solving complex functional issues for customers and advisors, all of which fall under business understanding and requirements gathering."
                },
                {
                    "task": "`TASK4: Software Development`",
                    "phrases": [
                        "je team aan digitale oplossingen",
                        "innovatieve toepassingen",
                        "onderdelen van de extranetten of toepassingen zoals de chatbot, de Florius apps, digitaal ondertekenen, online identificeren etc..",
                        "het werk door 1 van de circa 10 business / IT teams wordt opgepakt.",
                        "het team is verantwoordelijk voor de verdere invulling en realisatie van het product.",
                        "na oplevering (\"You build it, you run it\").",
                        "naar werkende functionaliteit waar adviseurs en klanten dagelijks gebruik van maken.",
                        "concrete stories die developers kunnen oppakken."
                    ],
                    "justification": "Phrases like 'digital solutions', 'innovative applications', 'extranets', 'chatbot', 'apps', 'digital signing', 'online identification', and 'working functionality' indicate involvement in the development and realization of software products, even if the role is more on the business/analyst side of defining them."
                },
                {
                    "task": "`TASK5: Operations Engineering (MLOps)`",
                    "phrases": [
                        "Het team houdt die verantwoordelijkheid ook na oplevering (\"You build it, you run it\").",
                        "Maar ook storingen komen direct bij het team terecht, dus moeten in worden gepast."
                    ],
                    "justification": "The 'You build it, you run it' principle and the responsibility for handling 'storingen' (failures/incidents) directly imply operational responsibility for the developed applications."
                }
            ],
            "technologies": [
                {
                    "technology": "chatbot",
                    "category": "TECH4: LLM Frameworks & Libraries"
                },
                {
                    "technology": "Florius apps",
                    "category": "TECH4: LLM Frameworks & Libraries"
                },
                {
                    "technology": "digitaal ondertekenen",
                    "category": "TECH4: LLM Frameworks & Libraries"
                },
                {
                    "technology": "online identificeren",
                    "category": "TECH4: LLM Frameworks & Libraries"
                }
            ],
            "soft_skills": [
                {
                    "skill": "`SKILL1: Communication & Collaboration`",
                    "phrases": [
                        "werk je samen met je team",
                        "Je team bestaat uit 1 of 2 Digital collega's en 5 a 8 developers vanuit IT.",
                        "Samen werken jullie aan",
                        "Je bepaalt samen met de Team Product Owner (Digital collega) en het team jullie eigen backlog.",
                        "Complexe vraagstukken ... vind je uitdagend om samen met je team op te lossen.",
                        "je werkt zeer intensief samen met de IT-collega's",
                        "Je werkt dagelijks in het agile team en samen ben je van idee tot en met realisatie en gebruik verantwoordelijk.",
                        "Met je team breng je dit van \"een idee\" naar werkende functionaliteit",
                        "een samenspel van culturen, kennis en ervaring."
                    ],
                    "justification": "The job description repeatedly emphasizes teamwork, collaboration with digital colleagues and developers, and joint responsibility for product realization."
                },
                {
                    "skill": "`SKILL2: Learning & Adaptability`",
                    "phrases": [
                        "Om je werk goed te doen, moet je je zelf regelmatig verdiepen in de materie",
                        "alle mogelijkheden om je als professional te ontwikkelen"
                    ],
                    "justification": "The need to 'regularly delve into the subject matter' and the mention of 'opportunities to develop as a professional' indicate a requirement for continuous learning and adaptation."
                },
                {
                    "skill": "`SKILL3: Problem Solving & Pragmatism`",
                    "phrases": [
                        "Complexe vraagstukken (functionaliteit voor klanten en adviseurs zoals wettelijke aanpassingen in de aanvraagmodules, inloggen voor adviseurs en klanten, extra aflossen via iDeal, indienen en wijzigingen van hypotheekverzoeken) vind je uitdagend om samen met je team op te lossen.",
                        "zodat de beste oplossing voor adviseur of klant kan worden gemaakt.",
                        "Maar ook storingen komen direct bij het team terecht, dus moeten in worden gepast."
                    ],
                    "justification": "The role involves tackling complex functional issues, finding the 'best solution', and addressing operational issues like 'storingen', all of which require strong problem-solving and pragmatic approaches."
                },
                {
                    "skill": "`SKILL5: Innovation & Ownership`",
                    "phrases": [
                        "aan innovatieve toepassingen",
                        "het team is verantwoordelijk voor de verdere invulling en realisatie van het product.",
                        "Het team houdt die verantwoordelijkheid ook na oplevering (\"You build it, you run it\").",
                        "Je bepaalt samen met de Team Product Owner (Digital collega) en het team jullie eigen backlog.",
                        "Met je team breng je dit van \"een idee\" naar werkende functionaliteit waar adviseurs en klanten dagelijks gebruik van maken.",
                        "Het succes van onze organisatie staat of valt met de kwaliteit van onze mensen en de ideeen die zij hebben.",
                        "Echt verrassende inzichten en innovatieve oplossingen voor onze klanten ontstaan door een samenspel van culturen, kennis en ervaring."
                    ],
                    "justification": "The emphasis on 'innovative applications', 'ownership' ('You build it, you run it'), defining their own backlog, and bringing ideas to life highlights innovation and a sense of ownership."
                }
            ]
        }
    }
}