{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Je werkt nauw samen met cross-functionele teams en stakeholders om de organisatie te voorzien van schaalbare en betrouwbare dataverwerkingssystemen.",
                "justification": "This phrase indicates collaboration with stakeholders to understand organizational needs and provide data processing systems, aligning with business objectives."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Daarnaast werk je samen met data scientisten, analisten, interne teams en stakeholders om de dataverwerkingsbehoeften te begrijpen en hierop in te spelen.",
                "justification": "This highlights understanding data processing needs from various internal teams and stakeholders, a key aspect of business understanding."
            },
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Als Data Engineer/Fullstack Developer bij deze organisatie ben je verantwoordelijk voor het ontwikkelen, implementeren en onderhouden van geavanceerde data-infrastructuur en -architectuur.",
                "justification": "Directly states responsibility for developing, implementing, and maintaining data infrastructure and architecture."
            },
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Je speelt een belangrijke rol in het opzetten van best practices en het identificeren en oplossen van problemen met betrekking tot gegevenskwaliteit, gegevensintegriteit en prestaties.",
                "justification": "Focuses on data quality, integrity, and performance, which are core concerns in data engineering."
            }
        ],
        "technologies": [],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Je werkt nauw samen met cross-functionele teams en stakeholders"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "werk je samen met data scientisten, analisten, interne teams en stakeholders"
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "het identificeren en oplossen van problemen met betrekking tot gegevenskwaliteit, gegevensintegriteit en prestaties."
            }
        ]
    },
    "classification": {
        "profile": "Ambiguous / Not Relevant",
        "confidence": 4,
        "rationale": "The job description focuses heavily on data engineering tasks like developing and maintaining data infrastructure, data quality, and integrity. While it mentions collaboration with data scientists and analysts, there's no mention of core AI/GenAI tasks such as modeling, prompt engineering, fine-tuning, or using specific GenAI technologies."
    }
}