{
    "job_id": 1055,
    "job_details": {
        "job_id": 1055,
        "Organisatienaam": "iO",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Junior / Medior AI Engineer",
        "Standplaats": "Eindhoven",
        "Vacaturelink (origineel)": "magnet.me",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als AI Engineer ben je bezig op het raakvlak van data, software engineering en AI-technologie. In die brede waaier van zaken doe jij de end-to-end ontwikkeling van software, platformen, tools en (tijdelijke) pipelines om data van A naar B te krijgen.\n\n   Een AI Engineer bij iO gaat aan de slag met diverse problemen. Van het slim inzetten of fine-tunen van Large Language Models of het toepassen van RAG-patronen, tot het bouwen van een pipeline om data bijeen te harken, te transformeren en te voeden aan een data platform. Het terugkerende patroon is dat je bestaande cloud services en APIs integreert tot een efficiënt, schaalbaar en betrouwbaar geheel.\n\n   Prompt engineering is voor jou een heerlijke 'art form', waarbij je creatief nadenkt over hoe je de beste resultaten kunt krijgen, met oog voor het voorkomen van hallucinaties of het toepassen van slimme guardrails. Je evalueert je oplossingen op een systematische manier om inzicht te krijgen in de kwaliteit van de output.\n\n   Je komt in je werk als AI Engineer in aanraking met allerlei soorten AI: van statistische modellen tot Large Language Models, van Generative AI op het vlak van afbeeldingen, video en audio tot Natural Language Processing. Het gaat in jouw job vooral om het inzetten en toepassen van bestaande (open source) modellen en services, en het maken van de infrastructuur daaromheen. Ook kleine tweaks en/of pre- en postprocessing op data naar AI-modellen horen bij je werk. Je bent perfect op de hoogte van wat de markt te bieden heeft, en waar de sterke en zwakke punten liggen van diverse AI-oplossingen.\n\n   Je werkt aan allerlei verschillende klantvraagstukken: van het automatisch analyseren van documenten tot het herkennen van gebeurtenissen in audio of videodata, en van het genereren van gave grafische output op basis van data tot het creëren of valideren van content. Daar waar AI een plek kan vinden, zet jij als engineer de totaaloplossing neer.\n\n   Het 'from the ground up' opbouwen van AI-modellen hoort niet bij de AI Engineer, maar bij de Data Scientist. Wel heb je genoeg begrip van de structuur van AI-modellen om met een Data Scientist over de inhoud te kunnen sparren.\n\n   Je werkt in een team met diverse AI-engineers en Data / BI-specialisten en werkt op basis van moderne (cloud)platformen, SaaS-services en talen als TypeScript en Python.\n   iodigital",
        "Datum gevonden": "2025-01-29",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Media / Communicatie",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 1,
        "full_text": "Junior / Medior AI Engineer\n\nAls AI Engineer ben je bezig op het raakvlak van data, software engineering en AI-technologie. In die brede waaier van zaken doe jij de end-to-end ontwikkeling van software, platformen, tools en (tijdelijke) pipelines om data van A naar B te krijgen.\n\n   Een AI Engineer bij iO gaat aan de slag met diverse problemen. Van het slim inzetten of fine-tunen van Large Language Models of het toepassen van RAG-patronen, tot het bouwen van een pipeline om data bijeen te harken, te transformeren en te voeden aan een data platform. Het terugkerende patroon is dat je bestaande cloud services en APIs integreert tot een efficiënt, schaalbaar en betrouwbaar geheel.\n\n   Prompt engineering is voor jou een heerlijke 'art form', waarbij je creatief nadenkt over hoe je de beste resultaten kunt krijgen, met oog voor het voorkomen van hallucinaties of het toepassen van slimme guardrails. Je evalueert je oplossingen op een systematische manier om inzicht te krijgen in de kwaliteit van de output.\n\n   Je komt in je werk als AI Engineer in aanraking met allerlei soorten AI: van statistische modellen tot Large Language Models, van Generative AI op het vlak van afbeeldingen, video en audio tot Natural Language Processing. Het gaat in jouw job vooral om het inzetten en toepassen van bestaande (open source) modellen en services, en het maken van de infrastructuur daaromheen. Ook kleine tweaks en/of pre- en postprocessing op data naar AI-modellen horen bij je werk. Je bent perfect op de hoogte van wat de markt te bieden heeft, en waar de sterke en zwakke punten liggen van diverse AI-oplossingen.\n\n   Je werkt aan allerlei verschillende klantvraagstukken: van het automatisch analyseren van documenten tot het herkennen van gebeurtenissen in audio of videodata, en van het genereren van gave grafische output op basis van data tot het creëren of valideren van content. Daar waar AI een plek kan vinden, zet jij als engineer de totaaloplossing neer.\n\n   Het 'from the ground up' opbouwen van AI-modellen hoort niet bij de AI Engineer, maar bij de Data Scientist. Wel heb je genoeg begrip van de structuur van AI-modellen om met een Data Scientist over de inhoud te kunnen sparren.\n\n   Je werkt in een team met diverse AI-engineers en Data / BI-specialisten en werkt op basis van moderne (cloud)platformen, SaaS-services en talen als TypeScript en Python.\n   iodigital"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, fine-tuning, and deployment of applications built on top of large language models and other generative models. It specifically mentions prompt engineering, RAG patterns, integrating cloud services and APIs for user-facing systems, and working with LLMs for various applications like document analysis, content generation, and audio/video processing. While it acknowledges understanding of statistical models, it explicitly states that building AI models from the ground up is the role of a Data Scientist, aligning with the GenAI Engineer's focus on applying and integrating existing models and services."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The description mentions 'slim inzetten of fine-tunen van Large Language Models' and 'toepassen van RAG-patronen', which are core modeling activities for generative AI.",
                    "phrase": "slim inzetten of fine-tunen van Large Language Models"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'toepassen van RAG-patronen' directly refers to a specific generative AI modeling technique.",
                    "phrase": "toepassen van RAG-patronen"
                },
                {
                    "category": "TASK2",
                    "justification": "The description states 'bouwen van een pipeline om data bijeen te harken, te transformeren en te voeden aan een data platform', which is a clear indication of data engineering tasks.",
                    "phrase": "bouwen van een pipeline om data bijeen te harken, te transformeren en te voeden aan een data platform"
                },
                {
                    "category": "TASK4",
                    "justification": "The role involves 'end-to-end ontwikkeling van software, platformen, tools' and 'bestaande cloud services en APIs integreert tot een efficiënt, schaalbaar en betrouwbaar geheel', which are core software development responsibilities for building applications.",
                    "phrase": "end-to-end ontwikkeling van software, platformen, tools"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'bestaande cloud services en APIs integreert tot een efficiënt, schaalbaar en betrouwbaar geheel' describes the integration of services and APIs into functional software systems.",
                    "phrase": "bestaande cloud services en APIs integreert tot een efficiënt, schaalbaar en betrouwbaar geheel"
                },
                {
                    "category": "TASK3",
                    "justification": "Prompt engineering is a key aspect of working with and optimizing generative models.",
                    "phrase": "Prompt engineering"
                },
                {
                    "category": "TASK3",
                    "justification": "The mention of 'voorkomen van hallucinaties of het toepassen van slimme guardrails' relates to the fine-tuning and control of generative models.",
                    "phrase": "voorkomen van hallucinaties of het toepassen van slimme guardrails"
                },
                {
                    "category": "TASK3",
                    "justification": "The systematic evaluation of solutions to understand output quality is part of the model development and refinement process.",
                    "phrase": "evalueert je oplossingen op een systematische manier om inzicht te krijgen in de kwaliteit van de output"
                },
                {
                    "category": "TASK3",
                    "justification": "The job involves working with 'statistische modellen tot Large Language Models, van Generative AI op het vlak van afbeeldingen, video en audio tot Natural Language Processing', indicating a broad scope of modeling tasks.",
                    "phrase": "statistische modellen tot Large Language Models, van Generative AI op het vlak van afbeeldingen, video en audio tot Natural Language Processing"
                },
                {
                    "category": "TASK3",
                    "justification": "The focus on 'inzetten en toepassen van bestaande (open source) modellen en services' is a core aspect of generative AI engineering.",
                    "phrase": "inzetten en toepassen van bestaande (open source) modellen en services"
                },
                {
                    "category": "TASK2",
                    "justification": "The phrase 'pre- en postprocessing op data naar AI-modellen' describes data preparation steps crucial for model input and output.",
                    "phrase": "pre- en postprocessing op data naar AI-modellen"
                },
                {
                    "category": "TASK1",
                    "justification": "Understanding 'wat de markt te bieden heeft, en waar de sterke en zwakke punten liggen van diverse AI-oplossingen' implies a need to align technical capabilities with business needs and available tools.",
                    "phrase": "perfect op de hoogte van wat de markt te bieden heeft, en waar de sterke en zwakke punten liggen van diverse AI-oplossingen"
                },
                {
                    "category": "TASK4",
                    "justification": "The description mentions 'automatisch analyseren van documenten', 'herkennen van gebeurtenissen in audio of videodata', 'genereren van gave grafische output op basis van data', and 'creëren of valideren van content', which are all application-level tasks enabled by AI.",
                    "phrase": "automatisch analyseren van documenten"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'herkennen van gebeurtenissen in audio of videodata' describes an application of AI for data analysis and processing.",
                    "phrase": "herkennen van gebeurtenissen in audio of videodata"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'genereren van gave grafische output op basis van data' points to building generative applications.",
                    "phrase": "genereren van gave grafische output op basis van data"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'creëren of valideren van content' refers to building applications that generate or verify content.",
                    "phrase": "creëren of valideren van content"
                },
                {
                    "category": "TASK4",
                    "justification": "The statement 'Daar waar AI een plek kan vinden, zet jij als engineer de totaaloplossing neer' implies building complete, end-to-end solutions that integrate AI.",
                    "phrase": "Daar waar AI een plek kan vinden, zet jij als engineer de totaaloplossing neer"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'maken van de infrastructuur daaromheen' refers to building the necessary infrastructure to support AI models and services, which aligns with MLOps principles.",
                    "phrase": "maken van de infrastructuur daaromheen"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "sparren over de inhoud"
                },
                {
                    "category": "SKILL3",
                    "phrase": "creatief nadenkt over hoe je de beste resultaten kunt krijgen"
                },
                {
                    "category": "SKILL2",
                    "phrase": "perfect op de hoogte van wat de markt te bieden heeft"
                },
                {
                    "category": "SKILL5",
                    "phrase": "end-to-end ontwikkeling"
                },
                {
                    "category": "SKILL5",
                    "phrase": "totaaloplossing neer"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "Large Language Models"
                },
                {
                    "category": "TECH4",
                    "phrase": "RAG"
                },
                {
                    "category": "TECH2",
                    "phrase": "cloud services"
                },
                {
                    "category": "TECH1",
                    "phrase": "TypeScript"
                },
                {
                    "category": "TECH1",
                    "phrase": "Python"
                },
                {
                    "category": "TECH3",
                    "phrase": "Generative AI"
                },
                {
                    "category": "TECH3",
                    "phrase": "Natural Language Processing"
                }
            ]
        }
    }
}