{
    "job_id": 163,
    "job_details": {
        "job_id": 163,
        "Organisatienaam": "All About Work",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "Lead Developer Generative AI",
        "Standplaats": "Rotterdam",
        "Vacaturelink (origineel)": "jobbird.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Lead developer (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Door de energietransitie neemt ons werk ontzettend toe. Daarom zijn we ons werk aan het verslimmen met behulp van AI, zodat we samen werk kunnen maken van een leefwereld vol nieuwe energie. Jij kan hier aan bijdrage als nieuwe Lead Developer collega. Als Lead Developer werk je in het functie team Generative AI naast het Digitale Innovatie team van Stedin. Dit team is speciaal opgericht om met volle focus de kansen en mogelijkheden van Generative AI uit te gaan nutten, want de mogelijkheden blijken eindeloos en de vraag uit het bedrijf is enorm.\n\nNa een heerlijke kop koffie (of thee) die je in gebarentaal bij onze 'gebarista' (slechthorende barista) hebt besteld, start je jouw dag met de stand up van het Generative AI team, hierin vertel je huidige stand van zaken in de ontwikkeling van de laatste features. Daarna heb je een meeting met de Product Owner en de interne stakeholders. Jullie kijken samen hoe een probleem uit het bedrijf opgelost kan worden met de nieuwste taalmodellen; iets waar de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie. Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?\n\n   Lunchen doe je in het bedrijfsrestaurant op de 18e verdieping, zo geniet je van je eigen of verse lunch en van het uitzicht over heel Rotterdam. Of je loopt even de stad in voor een wandeling. Na de lunch ga je aan de slag met het technisch uitwerken van een nieuwe feature voor StedinGPT, onze interne versie van ChatGPT.\n\n   Als afsluiter heb je nog een meeting met een architect en afdeling security. Hier heb je het over de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is het plan voor de aankomende features veilig en kunnen we dit in de toekomst beter standaardiseren? Aan het eind van je werkdag sta je in een paar stappen op station Blaak, zo ben je lekker snel weer thuis.\n\nAls onderdeel van een snel groeiend team ben jij een verantwoordelijk persoon die veelzijdige taken op zich kan nemen en duidelijk knopen kan doorhakken op technische keuzes. LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is. Naast een dosis creativiteit zorg jij ook dat gemaakte oplossingen veilig zijn en klanten echt geholpen zijn met de eindoplossing. Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis. Je bent niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie, terwijl je steeds scherp blijft op het doel en de randvoorwaarden. Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt. Wat jou verder onze nieuwe Lead Developer maakt?\n\nVanaf dag één werk je in het Generative AI team. Dit team opereert als een DevOps team binnen een groot bedrijf en bestaat uit gedreven en enthousiaste developers, die op zoek zijn samen met de Product Owner naar het toevoegen van waarde d.m.v. Generative AI. Dit snel groeiende team is in staat om snel nieuwe ideeën om te zetten in realiteit binnen de complexe context van de netbeheerder, bijvoorbeeld door het uitvoeren van kleinschalige MVP's, maar ook het naar productie brengen van Generative AI binnen het IT landschap van Stedin.",
        "Datum gevonden": "2025-02-06",
        "Beroepsgroep": "Coördinatoren IT",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Lead Developer Generative AI\n\nDoor de energietransitie neemt ons werk ontzettend toe. Daarom zijn we ons werk aan het verslimmen met behulp van AI, zodat we samen werk kunnen maken van een leefwereld vol nieuwe energie. Jij kan hier aan bijdrage als nieuwe Lead Developer collega. Als Lead Developer werk je in het functie team Generative AI naast het Digitale Innovatie team van Stedin. Dit team is speciaal opgericht om met volle focus de kansen en mogelijkheden van Generative AI uit te gaan nutten, want de mogelijkheden blijken eindeloos en de vraag uit het bedrijf is enorm.\n\nNa een heerlijke kop koffie (of thee) die je in gebarentaal bij onze 'gebarista' (slechthorende barista) hebt besteld, start je jouw dag met de stand up van het Generative AI team, hierin vertel je huidige stand van zaken in de ontwikkeling van de laatste features. Daarna heb je een meeting met de Product Owner en de interne stakeholders. Jullie kijken samen hoe een probleem uit het bedrijf opgelost kan worden met de nieuwste taalmodellen; iets waar de eindklant direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie. Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?\n\n   Lunchen doe je in het bedrijfsrestaurant op de 18e verdieping, zo geniet je van je eigen of verse lunch en van het uitzicht over heel Rotterdam. Of je loopt even de stad in voor een wandeling. Na de lunch ga je aan de slag met het technisch uitwerken van een nieuwe feature voor StedinGPT, onze interne versie van ChatGPT.\n\n   Als afsluiter heb je nog een meeting met een architect en afdeling security. Hier heb je het over de toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap; wat zijn de kaders, is het plan voor de aankomende features veilig en kunnen we dit in de toekomst beter standaardiseren? Aan het eind van je werkdag sta je in een paar stappen op station Blaak, zo ben je lekker snel weer thuis.\n\nAls onderdeel van een snel groeiend team ben jij een verantwoordelijk persoon die veelzijdige taken op zich kan nemen en duidelijk knopen kan doorhakken op technische keuzes. LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is. Naast een dosis creativiteit zorg jij ook dat gemaakte oplossingen veilig zijn en klanten echt geholpen zijn met de eindoplossing. Als we zaken beter anders aanpakken of andere technologie moeten gebruiken om tot meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis. Je bent niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie, terwijl je steeds scherp blijft op het doel en de randvoorwaarden. Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt. Wat jou verder onze nieuwe Lead Developer maakt?\n\nVanaf dag één werk je in het Generative AI team. Dit team opereert als een DevOps team binnen een groot bedrijf en bestaat uit gedreven en enthousiaste developers, die op zoek zijn samen met de Product Owner naar het toevoegen van waarde d.m.v. Generative AI. Dit snel groeiende team is in staat om snel nieuwe ideeën om te zetten in realiteit binnen de complexe context van de netbeheerder, bijvoorbeeld door het uitvoeren van kleinschalige MVP's, maar ook het naar productie brengen van Generative AI binnen het IT landschap van Stedin."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development and deployment of applications built on large language models (LLMs), specifically mentioning 'StedinGPT, onze interne versie van ChatGPT' and the use of 'taalmodellen'. It highlights core responsibilities like prompt engineering, integrating LLM solutions into business processes, and ensuring these solutions are secure and scalable. The role involves building RAG systems implicitly through the mention of solving business problems with LLMs and creating 'StedinGPT'. The emphasis on building production-grade user-facing software systems, working within a DevOps team, and the specific mention of LLM technology and its applications strongly align with the GenAI Engineer profile. While there's a mention of 'architect' and 'security', the primary focus remains on leveraging generative AI for business solutions."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The job description mentions understanding business problems ('hoe een probleem uit het bedrijf opgelost kan worden met de nieuwste taalmodellen') and aligning technical solutions with business needs to deliver value ('direct een bedrijfsproces mee kan verbeteren en echt resultaat oplevert voor in onze operatie', 'klanten echt geholpen zijn met de eindoplossing').",
                    "phrase": "hoe een probleem uit het bedrijf opgelost kan worden met de nieuwste taalmodellen"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves understanding the business context and translating it into technical requirements by discussing needs with Product Owners and stakeholders.",
                    "phrase": "Wat zijn de wensen, en kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The core of the role involves working with and developing applications based on generative AI and large language models, including fine-tuning and adapting them for specific business problems.",
                    "phrase": "technisch uitwerken van een nieuwe feature voor StedinGPT"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The job explicitly mentions working with 'taalmodellen' and understanding which solution is suitable for which problem, indicating model selection and application.",
                    "phrase": "LLM technologie is nog nieuw maar jij doorziet goed voor welk probleem welke oplossing geschikt is."
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The role involves experimenting with new ideas through Proofs of Concept (PoCs) and delivering long-term working software, which includes model development and refinement.",
                    "phrase": "niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC, maar bent ook sterk in langdurig goed werkende software af te leveren in productie"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The job requires staying updated with innovations in the LLM field, implying continuous learning and adaptation of modeling techniques.",
                    "phrase": "Ook blijf je up-to-date met vernieuwingen op LLM gebied in de markt."
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves developing features and applications using generative AI, which requires traditional software development skills to integrate these models into functional systems.",
                    "phrase": "ontwikkeling van de laatste features"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The job description mentions building and maintaining production-grade software systems, which is a core aspect of software development.",
                    "phrase": "langdurig goed werkende software af te leveren in productie"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves building applications around LLMs and ensuring they are secure and scalable, which requires robust software development practices.",
                    "phrase": "kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The job explicitly states the team operates as a 'DevOps team' and is responsible for moving Generative AI into production within the company's IT landscape.",
                    "phrase": "Dit team opereert als een DevOps team binnen een groot bedrijf"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The role involves deploying and maintaining AI models in production, ensuring they are secure and scalable, which falls under MLOps responsibilities.",
                    "phrase": "naar productie brengen van Generative AI binnen het IT landschap van Stedin"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Discussions with architects and security teams about the implementation and standardization of solutions in the IT landscape point towards operational considerations for production systems.",
                    "phrase": "toepasbaarheid van de gemaakte oplossing en hoe die terecht moet komen in het Stedin IT landschap"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "stand up van het Generative AI team"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "meeting met de Product Owner en de interne stakeholders"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "meeting met een architect en afdeling security"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "hoe een probleem uit het bedrijf opgelost kan worden met de nieuwste taalmodellen"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "kan er direct nog meer waarde gecreëerd worden op een veilige en schaalbare manier?"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "doorziet goed voor welk probleem welke oplossing geschikt is"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "naar meer succes te komen kan je ons hier ook van overtuigen vanuit je technische basis"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "scherp blijft op het doel en de randvoorwaarden"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "ben jij een verantwoordelijk persoon die veelzijdige taken op zich kan nemen"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "duidelijk knopen kan doorhakken op technische keuzes"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "naast een dosis creativiteit zorg jij ook dat gemaakte oplossingen veilig zijn"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "niet bang nieuwe ideeën uit te laten proberen in een kleinschalige PoC"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "sterk in langdurig goed werkende software af te leveren in productie"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "blijf je up-to-date met vernieuwingen op LLM gebied in de markt"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "Generative AI"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "taalmodellen"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "StedinGPT"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "ChatGPT"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "LLM technologie"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "Generative AI"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "DevOps"
                }
            ]
        }
    }
}