{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Als Full-Stack Developer werk je in een klein team aan de verdere ontwikkeling en uitbreiding van onze AI-tool.",
                "justification": "This phrase explicitly mentions working as a Full-Stack Developer on the development and expansion of an AI tool, which falls under general software development."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Concreet houdt je werk in: Ontwikkelen van nieuwe functionaliteiten voor onze AI-feedbacktool.",
                "justification": "Developing new functionalities for a tool is a core software development task."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Optimaliseren van de backend met Node.js en Python.",
                "justification": "Optimizing the backend involves software development practices for server-side logic."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Werken aan de frontend met Vue.js.",
                "justification": "Working on the frontend with a framework like Vue.js is a standard software development activity for user interfaces."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Experimenteren met AI en werken met tools zoals Tensorflow en Huggingface Transformers.",
                "justification": "Experimenting with AI and using tools like Tensorflow and Huggingface Transformers directly relates to the creation or adaptation of AI models."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH1",
                "tool_name": "Node.js"
            },
            {
                "category_id": "TECH1",
                "tool_name": "Python"
            },
            {
                "category_id": "TECH1",
                "tool_name": "Vue.js"
            },
            {
                "category_id": "TECH10",
                "tool_name": "Tensorflow"
            },
            {
                "category_id": "TECH4",
                "tool_name": "Huggingface Transformers"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "je krijgt de kans om direct bij te dragen aan een product dat impact heeft in het onderwijs."
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "Experimenteren met AI"
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 3,
        "rationale": "The role involves full-stack development with a specific focus on an AI tool. While it mentions experimenting with AI and using tools like Tensorflow and Huggingface Transformers, it leans more towards building applications around AI rather than deep model research or MLOps. The description lacks explicit mentions of core GenAI Engineer tasks like prompt engineering, RAG, or PEFT, making the classification moderate."
    }
}