{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "ontwikkelen, beheren en verbeteren van onze data- en AI-infrastructuur",
                "justification": "This phrase indicates the core responsibility of building and maintaining the technical systems that support data and AI, which falls under software development."
            },
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Data pipelines: Ontwerpen, bouwen en onderhouden van data pipelines op ons Snowflake platform, die onze Tableau-rapportages voeden via een semantische laag.",
                "justification": "This directly describes the design, construction, and maintenance of data pipelines, a key aspect of data engineering."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Generatieve AI: Overdracht en doorontwikkeling van projecten zoals de GenAI Suite en de Klus Coach (een generatieve AI-assistent voor klanten).",
                "justification": "This clearly refers to the development and refinement of generative AI applications, aligning with the modeling task."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "ondersteuning van data science-initiatieven",
                "justification": "Supporting data science initiatives often involves integrating their models and findings into larger software systems, fitting under software development."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "Linux serverbeheer: Verantwoordelijkheid voor het onderhouden van een Linux-omgeving die cruciaal is voor onze AI-infrastructuur.",
                "justification": "Managing and maintaining the server infrastructure for AI is a core component of operations engineering or MLOps."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH1",
                "tool_name": "Snowflake"
            },
            {
                "category_id": "TECH4",
                "tool_name": "GenAI"
            },
            {
                "category_id": "TECH10",
                "tool_name": "Dataiku"
            },
            {
                "category_id": "TECH1",
                "tool_name": "Linux"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Je werkt nauw samen met ons data science team, de IT-afdeling en verschillende business units"
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "The job description explicitly mentions developing and refining generative AI projects like the 'GenAI Suite' and 'Klus Coach'. It also highlights building data pipelines and supporting data science initiatives, indicating a strong focus on applying and integrating AI technologies into production systems."
    }
}