{
    "job_id": 288,
    "job_details": {
        "job_id": 288,
        "Organisatienaam": "Maxflex",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "AI Engineer werkstudent",
        "Standplaats": "Arnhem",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": "+31243603050",
        "E-mail": null,
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Volg jij een HBO/WO-studie in een data AI- gerelateerde richting en wil je meewerken aan innovatieve oplossingen binnen een sportieve werkomgeving? Als AI Engineer werkstudent maak je deel uit van een AI-innovatie team en draag je direct bij aan vernieuwing in de sportsector. Klaar om jouw kennis in te zetten en mee te bouwen aan een sportiever Nederland? Neem dan contact met ons op!\n\n    Het bedrijf\n\n    *De sportorganisatie is een overkoepelende organisatie voor de georganiseerde sport in Nederland en heeft als missie om Nederland tegen 2032 het sportiefste land ter wereld te maken. Dit doen ze door het ondersteunen van sportbonden, het begeleiden van topsportprogramma's, het uitvoeren van sportonderzoek en het versterken van de maatschappelijke waarde van sport. Samen met diverse partners zet de organisatie zich in om de impact van sport te vergroten.In deze functie kom je te werken op de afdeling Informatie Management. Deze afdeling speelt een cruciale rol in het ondersteunen van diverse afdelingen, waaronder Topsport (inclusief TeamNL), Breedtesport en het Centrum Veilige Sport Nederland. Hier worden innovatieve oplossingen ontwikkeld en diensten geleverd om de ambities van de organisatie te realiseren. *\n\nAls AI Engineer werkstudent kom je te werken binnen de afdeling Informatie Management, waar je onderdeel wordt van het nieuw op te richten AI-innovatie team. Dit team heeft als doel om AI-toepassingen te ontwikkelen en uiteindelijk te implementeren, zodat deze aan het einde van het jaar breed binnen de organisatie worden gebruikt. Hiermee willen ze de productiviteit en kwaliteit van de werkorganisatie naar een hoger niveau tillen en een nieuwe standaard zetten in de sportsector.In eerste instantie zullen je werkzaamheden een sterk innovatief karakter hebben. Je zult problemen en verbeteringen identificeren om vervolgens de juiste AI tools te kiezen als onderdeel van de oplossing. Dit betekent puzzelen, experimenteren en vernieuwend bezig zijn om oplossingen te creëren die direct impact hebben op de werknemers en processen binnen het bedrijf. Verder houd je je bezig met het",
        "Datum gevonden": "2025-02-12",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Parttime / Fulltime",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "AI Engineer werkstudent\n\nVolg jij een HBO/WO-studie in een data AI- gerelateerde richting en wil je meewerken aan innovatieve oplossingen binnen een sportieve werkomgeving? Als AI Engineer werkstudent maak je deel uit van een AI-innovatie team en draag je direct bij aan vernieuwing in de sportsector. Klaar om jouw kennis in te zetten en mee te bouwen aan een sportiever Nederland? Neem dan contact met ons op!\n\n    Het bedrijf\n\n    *De sportorganisatie is een overkoepelende organisatie voor de georganiseerde sport in Nederland en heeft als missie om Nederland tegen 2032 het sportiefste land ter wereld te maken. Dit doen ze door het ondersteunen van sportbonden, het begeleiden van topsportprogramma's, het uitvoeren van sportonderzoek en het versterken van de maatschappelijke waarde van sport. Samen met diverse partners zet de organisatie zich in om de impact van sport te vergroten.In deze functie kom je te werken op de afdeling Informatie Management. Deze afdeling speelt een cruciale rol in het ondersteunen van diverse afdelingen, waaronder Topsport (inclusief TeamNL), Breedtesport en het Centrum Veilige Sport Nederland. Hier worden innovatieve oplossingen ontwikkeld en diensten geleverd om de ambities van de organisatie te realiseren. *\n\nAls AI Engineer werkstudent kom je te werken binnen de afdeling Informatie Management, waar je onderdeel wordt van het nieuw op te richten AI-innovatie team. Dit team heeft als doel om AI-toepassingen te ontwikkelen en uiteindelijk te implementeren, zodat deze aan het einde van het jaar breed binnen de organisatie worden gebruikt. Hiermee willen ze de productiviteit en kwaliteit van de werkorganisatie naar een hoger niveau tillen en een nieuwe standaard zetten in de sportsector.In eerste instantie zullen je werkzaamheden een sterk innovatief karakter hebben. Je zult problemen en verbeteringen identificeren om vervolgens de juiste AI tools te kiezen als onderdeel van de oplossing. Dit betekent puzzelen, experimenteren en vernieuwend bezig zijn om oplossingen te creëren die direct impact hebben op de werknemers en processen binnen het bedrijf. Verder houd je je bezig met het"
    },
    "analysis": {
        "job_profile_classification": {
            "profile": "Ambiguous / Not Relevant",
            "confidence_score": 2,
            "rationale": "The job description focuses heavily on the use of AI tools for productivity enhancement and innovation within a business context, rather than the core development or engineering of AI models. It lacks specific details on core AI engineering tasks like model training, data engineering, or MLOps, making it difficult to classify as a technical AI role."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "phrases": [
                        "meewerken aan innovatieve oplossingen binnen een sportieve werkomgeving",
                        "draag je direct bij aan vernieuwing in de sportsector",
                        "Klaar om jouw kennis in te zetten en mee te bouwen aan een sportiever Nederland?",
                        "missie om Nederland tegen 2032 het sportiefste land ter wereld te maken",
                        "ondersteunen van sportbonden, het begeleiden van topsportprogramma's, het uitvoeren van sportonderzoek en het versterken van de maatschappelijke waarde van sport",
                        "Samen met diverse partners zet de organisatie zich in om de impact van sport te vergroten",
                        "ondersteunen van diverse afdelingen, waaronder Topsport (inclusief TeamNL), Breedtesport en het Centrum Veilige Sport Nederland",
                        "innovatieve oplossingen worden ontwikkeld en diensten geleverd om de ambities van de organisatie te realiseren",
                        "AI-toepassingen te ontwikkelen en uiteindelijk te implementeren, zodat deze aan het einde van het jaar breed binnen de organisatie worden gebruikt",
                        "productiviteit en kwaliteit van de werkorganisatie naar een hoger niveau tillen en een nieuwe standaard zetten in de sportsector",
                        "problemen en verbeteringen identificeren om vervolgens de juiste AI tools te kiezen als onderdeel van de oplossing",
                        "oplossingen te creëren die direct impact hebben op de werknemers en processen binnen het bedrijf"
                    ],
                    "justification": "These phrases highlight the role's connection to the organization's mission, strategic goals, and the application of AI to improve business processes and productivity within the sports sector."
                },
                {
                    "category": "TASK3: Modeling",
                    "phrases": [
                        "AI Engineer werkstudent",
                        "AI-innovatie team",
                        "AI-toepassingen te ontwikkelen",
                        "juiste AI tools te kiezen als onderdeel van de oplossing",
                        "puzzelen, experimenteren en vernieuwend bezig zijn"
                    ],
                    "justification": "While not detailing specific model types, the phrases indicate involvement in developing and selecting AI applications and tools, suggesting a modeling-related aspect, albeit at a high level."
                },
                {
                    "category": "TASK4: Software Development",
                    "phrases": [
                        "AI-toepassingen te ontwikkelen en uiteindelijk te implementeren",
                        "oplossingen te creëren"
                    ],
                    "justification": "The description mentions developing and implementing AI applications and creating solutions, which implies some level of software development, though the focus is on the application of AI rather than core software engineering."
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "technologies": [
                        "AI tools"
                    ],
                    "justification": "The phrase 'AI tools' is broad but in the context of an AI Engineer role, it often implies the use of generative models or related AI technologies."
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrases": [
                        "werkstudent",
                        "HBO/WO-studie",
                        "puzzelen, experimenteren en vernieuwend bezig zijn"
                    ],
                    "justification": "The role is for a student ('werkstudent') pursuing higher education, indicating a learning and development focus. The mention of 'puzzelen, experimenteren' also points to an adaptive and learning-oriented approach."
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrases": [
                        "problemen en verbeteringen identificeren",
                        "juiste AI tools te kiezen als onderdeel van de oplossing",
                        "oplossingen te creëren die direct impact hebben op de werknemers en processen binnen het bedrijf"
                    ],
                    "justification": "The description emphasizes identifying problems, selecting appropriate tools for solutions, and creating impactful outcomes for employees and processes, which are core aspects of problem-solving and pragmatism."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrases": [
                        "innovatieve oplossingen",
                        "AI-innovatie team",
                        "vernieuwend bezig zijn"
                    ],
                    "justification": "The repeated emphasis on 'innovative solutions', 'AI innovation team', and being 'innovative' highlights a drive for new ideas and proactive contribution."
                }
            ]
        }
    }
}