{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "frameworks voor onderzoek naar bijvoorbeeld multi-agent general purpose AI-systemen",
                "justification": "Het ontwikkelen van frameworks voor onderzoek naar AI-systemen valt onder het creëren en aanpassen van modellen."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "generatieve AI-modellen te evalueren aan de hand van cybersecurity-benchmarks",
                "justification": "Het evalueren van generatieve AI-modellen is een kernonderdeel van het werk met modellen."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Het ontwikkelen van een werkwijze op basis van coding standards en workflow-automatisering voor reproduceerbare, betrouwbare en onderhoudbare infrastructure-as-code",
                "justification": "Dit beschrijft traditionele software engineering taken gericht op het bouwen en beheren van code en infrastructuur."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "workflow-automatisering voor reproduceerbare, betrouwbare en onderhoudbare infrastructure-as-code",
                "justification": "Automatisering van workflows en infrastructure-as-code vallen onder MLOps-praktijken."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "vormgeven van het nationale en Europese toezicht op complexe AI",
                "justification": "Dit toont een begrip van de bredere zakelijke en regelgevende context waarin AI wordt toegepast."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "ondersteunen in haar rol als toezichthouder op digitale infrastructuur en AI",
                "justification": "De rol als toezichthouder impliceert een focus op zakelijke en regelgevende doelen."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "generatieve AI-modellen"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "het vermogen om snel nieuwe, state-of-the-art technologieën eigen te maken en toe te passen"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "stemt je communicatie af op je gesprekspartners, zowel binnen technische als niet technische teams"
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "neemt het initiatief om tot technische oplossingen te komen"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Kennisoverdracht naar de junior onderzoekers en engineers waar je mee samenwerkt."
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "The job description explicitly mentions working with 'generatieve AI-modellen' and developing frameworks for 'multi-agent general purpose AI-systemen'. While it includes software development and operations aspects, the core focus is on the application and evaluation of generative AI, aligning with the definition of a GenAI Engineer."
    }
}