{
    "job_id": 929,
    "job_details": {
        "job_id": 929,
        "Organisatienaam": "Indigo",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior .NET Developer",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Programmeur .net (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Do you want to create backend systems that drive groundbreaking generative AI and CGI-powered content solutions?\n       Join us as a Senior Developer, where you will be responsible for ensuring the smooth operation of our backend systems while sharing your expertise and fostering growth among team members.\n       About\n       As INDG's software branch, is an end-to-end content automation platform that generates infinite ad variations by combining CGI, rule-based generative AI, and post-production into an easy-to-use automated content generation platform that transforms master ad creatives into endless variations-empowering brands to scale content production globally without compromising on quality or brand consistency.\n       works by taking master content supplied by brands or their agencies and converting it into a deeply modular configurator. This allows marketers to create their own visual adaptations and variations effortlessly, saving millions in production costs while maintaining brand consistency.",
        "Datum gevonden": "2025-01-08",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "ICT",
        "Organisatiegrootte": "200-499",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 1,
        "full_text": "Senior .NET Developer\n\nDo you want to create backend systems that drive groundbreaking generative AI and CGI-powered content solutions?\n       Join us as a Senior Developer, where you will be responsible for ensuring the smooth operation of our backend systems while sharing your expertise and fostering growth among team members.\n       About\n       As INDG's software branch, is an end-to-end content automation platform that generates infinite ad variations by combining CGI, rule-based generative AI, and post-production into an easy-to-use automated content generation platform that transforms master ad creatives into endless variations-empowering brands to scale content production globally without compromising on quality or brand consistency.\n       works by taking master content supplied by brands or their agencies and converting it into a deeply modular configurator. This allows marketers to create their own visual adaptations and variations effortlessly, saving millions in production costs while maintaining brand consistency."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description is for a Senior .NET Developer and focuses on backend systems that support generative AI and CGI content solutions. However, the core responsibilities and required skills are centered around traditional software development (.NET) rather than the development, fine-tuning, or deployment of AI models themselves. The role appears to be supporting AI applications rather than building or engineering them, making it fall under the 'Ambiguous' category as it's not a direct AI technical role as defined in the coding book."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The job title 'Senior .NET Developer' and the description 'create backend systems' and 'ensuring the smooth operation of our backend systems' directly point to traditional software development responsibilities.",
                    "phrase": "create backend systems"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves ensuring the 'smooth operation of our backend systems', which is a core aspect of software development and maintenance.",
                    "phrase": "ensuring the smooth operation of our backend systems"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The description mentions 'content automation platform that generates infinite ad variations by combining CGI, rule-based generative AI, and post-production', indicating a need to understand the business context of content generation and scaling.",
                    "phrase": "content automation platform that generates infinite ad variations by combining CGI, rule-based generative AI, and post-production"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'empowering brands to scale content production globally without compromising on quality or brand consistency' highlights the business goals the platform aims to achieve.",
                    "phrase": "empowering brands to scale content production globally without compromising on quality or brand consistency"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The description of how the platform works ('taking master content supplied by brands or their agencies and converting it into a deeply modular configurator') and its purpose ('allows marketers to create their own visual adaptations and variations effortlessly, saving millions in production costs while maintaining brand consistency') shows an understanding of business needs and user (marketer) requirements.",
                    "phrase": "allows marketers to create their own visual adaptations and variations effortlessly, saving millions in production costs while maintaining brand consistency"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "fostering growth among team members"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Senior Developer"
                }
            ],
            "technologies": [
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": ".NET"
                }
            ]
        }
    }
}