{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "helpen organisaties identificeren waar AI van toegevoegde waarde kan zijn (en waar niet)",
                "justification": "This phrase directly relates to understanding the business context and identifying where AI can provide value."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "aan de slag met het bouwen en opschalen van deze maatwerkoplossingen (gebaseerd op ons eigen platform)",
                "justification": "This indicates building and scaling custom solutions, which falls under software development."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Het opzetten en doorontwikkelen van ons interne, composable platform. Deze bouwstenen vormen de basis van onze maatwerkapplicaties.",
                "justification": "Developing and further developing an internal platform that forms the basis of custom applications is a core software development task."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Het opzetten en opschalen van maatwerkapplicaties, gebaseerd op al bestaande (GenAI-)oplossingen en/of ons platform.",
                "justification": "This describes building and scaling custom applications based on existing solutions, which is software development."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "maatwerkapplicaties, gebaseerd op al bestaande (GenAI-)oplossingen",
                "justification": "The mention of 'GenAI-oplossingen' implies working with or building upon generative AI models, which falls under modeling."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH1",
                "tool_name": "AI"
            },
            {
                "category_id": "TECH3",
                "tool_name": "GenAI"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "transparantie en betrokkenheid belangrijk en denkt graag mee over hoe we samen successen kunnen behalen."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "krijgt graag de ruimte om te werken aan zaken die bijdragen aan de groei en ontwikkeling van Algemi."
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "opletten dat je als téam goed opereert. Dit betekent dat je elkaar goed kent, elkaar respecteert, elkaar beter maakt en samen successen viert."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "Jij geeft hier het goede voorbeeld in."
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "helpen organisaties identificeren waar AI van toegevoegde waarde kan zijn (en waar niet)"
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "The job description explicitly mentions building and scaling custom applications based on existing GenAI solutions and developing an internal platform. This, combined with the emphasis on identifying where GenAI can add value, strongly points to a GenAI Engineer role focused on application development using generative AI."
    }
}