{
    "job_id": 1234,
    "job_details": {
        "job_id": 1234,
        "Organisatienaam": "Refreshworks",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Engineer (NL)",
        "Standplaats": "Den Haag",
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als AI Engineer bij Refreshworks.ai speel je een cruciale rol in de ontwikkeling en implementatie van cutting-edge AI-oplossingen:\n\n     * Ontwikkeling van AI-modellen: ontwerp, ontwikkel, en implementeer geavanceerde voorspellende modellen en algoritmes. Je werkt aan diverse uitdagingen zoals computer vision, regressie- en classificatieproblemen, optimalisatie en natural language processing (NLP).\n     * Experimenten en Proof-of-Concepts: Ontwikkel experimenten om de technische haalbaarheid van verschillende modellen aan te tonen en om ze onderling te vergelijken.\n     * Cross-functionele samenwerking: werk samen met diverse afdelingen om AI-oplossingen naadloos te integreren binnen onze bedrijfsprocessen.\n     * Kennisdeling en presentatie: deel je bevindingen en aanbevelingen met zowel technische teams als niet-technische stakeholders. Blijf up-to-date met de laatste trends in data science en AI, en deel deze kennis binnen het bedrijf.\n\nRefreshworks werkt samen met &Work. &Work begrijpt dat het belangrijk is om te werken op een plek waar je gewaardeerd wordt, waar je je verder kunt ontwikkelen en waar je de ruimte krijgt om te groeien. Door via &Work te solliciteren, krijg je direct toegang tot hun brede netwerk van werkgevers. &Work kan je helpen bij de introductie bij Refreshworks, achtergrondinformatie verstrekken, je voorbereiden op gesprekken zodat je jezelf overtuigend kan presenteren en je bijstaan tijdens de onderhandelingen om je een mooie stap vooruit te laten zetten in je carrière.",
        "Datum gevonden": "2024-06-07",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Media / Communicatie",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 6,
        "full_text": "AI Engineer (NL)\n\nAls AI Engineer bij Refreshworks.ai speel je een cruciale rol in de ontwikkeling en implementatie van cutting-edge AI-oplossingen:\n\n     * Ontwikkeling van AI-modellen: ontwerp, ontwikkel, en implementeer geavanceerde voorspellende modellen en algoritmes. Je werkt aan diverse uitdagingen zoals computer vision, regressie- en classificatieproblemen, optimalisatie en natural language processing (NLP).\n     * Experimenten en Proof-of-Concepts: Ontwikkel experimenten om de technische haalbaarheid van verschillende modellen aan te tonen en om ze onderling te vergelijken.\n     * Cross-functionele samenwerking: werk samen met diverse afdelingen om AI-oplossingen naadloos te integreren binnen onze bedrijfsprocessen.\n     * Kennisdeling en presentatie: deel je bevindingen en aanbevelingen met zowel technische teams als niet-technische stakeholders. Blijf up-to-date met de laatste trends in data science en AI, en deel deze kennis binnen het bedrijf.\n\nRefreshworks werkt samen met &Work. &Work begrijpt dat het belangrijk is om te werken op een plek waar je gewaardeerd wordt, waar je je verder kunt ontwikkelen en waar je de ruimte krijgt om te groeien. Door via &Work te solliciteren, krijg je direct toegang tot hun brede netwerk van werkgevers. &Work kan je helpen bij de introductie bij Refreshworks, achtergrondinformatie verstrekken, je voorbereiden op gesprekken zodat je jezelf overtuigend kan presenteren en je bijstaan tijdens de onderhandelingen om je een mooie stap vooruit te laten zetten in je carrière."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description heavily emphasizes the development and implementation of 'advanced predictive models and algorithms' for tasks like 'computer vision, regression and classification problems, optimization, and natural language processing (NLP)'. It also mentions 'design, develop, and implement' models, aligning with the core responsibilities of an ML Engineer. While NLP is mentioned, the focus is on predictive modeling rather than generative AI applications. The role involves 'experiments and Proof-of-Concepts' and 'cross-functional collaboration' to integrate solutions, which are typical for an ML Engineer tasked with productionizing models."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Ontwikkeling van AI-modellen: ontwerp, ontwikkel, en implementeer geavanceerde voorspellende modellen en algoritmes' directly describes the core activity of creating and implementing models.",
                    "phrase": "Ontwikkeling van AI-modellen: ontwerp, ontwikkel, en implementeer geavanceerde voorspellende modellen en algoritmes"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The mention of specific problem types like 'computer vision, regressie- en classificatieproblemen, optimalisatie en natural language processing (NLP)' are all areas where predictive models are applied.",
                    "phrase": "computer vision, regressie- en classificatieproblemen, optimalisatie en natural language processing (NLP)"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Ontwikkel experimenten om de technische haalbaarheid van verschillende modellen aan te tonen en om ze onderling te vergelijken' describes the process of evaluating and comparing models, which is part of the modeling lifecycle.",
                    "phrase": "Ontwikkel experimenten om de technische haalbaarheid van verschillende modellen aan te tonen en om ze onderling te vergelijken"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'werk samen met diverse afdelingen om AI-oplossingen naadloos te integreren binnen onze bedrijfsprocessen' indicates the need to understand business needs and integrate technical solutions accordingly.",
                    "phrase": "werk samen met diverse afdelingen om AI-oplossingen naadloos te integreren binnen onze bedrijfsprocessen"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The phrase 'deel je bevindingen en aanbevelingen met zowel technische teams als niet-technische stakeholders' highlights the need for clear communication across different audiences.",
                    "phrase": "deel je bevindingen en aanbevelingen met zowel technische teams als niet-technische stakeholders"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "The phrase 'Blijf up-to-date met de laatste trends in data science en AI, en deel deze kennis binnen het bedrijf' emphasizes the importance of continuous learning and staying current in the field.",
                    "phrase": "Blijf up-to-date met de laatste trends in data science en AI, en deel deze kennis binnen het bedrijf"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "deel je bevindingen en aanbevelingen met zowel technische teams als niet-technische stakeholders"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Blijf up-to-date met de laatste trends in data science en AI, en deel deze kennis binnen het bedrijf"
                }
            ],
            "technologies": []
        }
    }
}