{
    "job_id": 1138,
    "job_details": {
        "job_id": 1138,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Artificial Intelligence Engineer, 2 Hour Learning (Remote) - $100,000/year USD",
        "Standplaats": "Eindhoven",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Machine learning engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "This is not a position for those who prefer to specialize in a single aspect of development. We're looking for innovative thinkers who can seamlessly integrate AI across both front-end and back-end systems, taking ownership of the entire product. Your work will directly impact thousands of students, ensuring that our tools meet their needs and set new standards for educational technology., * Develop AI-Powered Web Applications: Architect and code sophisticated web applications that integrate both front-end and back-end components, with a focus on enhancing user experience through AI.\n     * Experiment and Innovate with AI: Work with cutting-edge AI technologies, specifically large language models (LLMs) like GPT-4 or Claude, to create autonomous tools and interactive features that redefine how students learn.\n     * Drive Technical Projects: Take ownership of the entire development process, from gathering requirements to launching and iterating on products. You'll work closely with stakeholders to ensure that our solutions meet learner needs and push the boundaries of what's possible.\n     * Collaborate and Communicate: Partner with a global team of developers, designers, and educational experts. Your ability to communicate complex ideas simply and effectively will be key to your success.\n     * Continuous Improvement: Stay ahead of the curve by continually learning and applying the latest advancements in AI and web development to our platform.\n\n   What you will NOT be doing\n\n     * Narrow AI Development: You won't be working on isolated AI features that don't integrate with the overall product strategy. Your work will have a direct impact on thousands of students.\n     * Surface-Level Coding: This is not a role for those who focus only on either front-end or back-end development. You will be expected to integrate both, creating comprehensive and scalable solutions.\n     * Routine Maintenance: This role is not about maintaining legacy systems or making minor updates. You will be driving innovation and building new, cutting-edge applications.\n     * Waiting for Detailed Specifications: You won't be handed fully fleshed-out requirements. Instead, you will take high-level ideas and translate them into fully developed products, leveraging your expertise in AI and full-stack development.\n     * Working in Isolation: You won't be coding in a vacuum. Collaboration with other developers, product managers, and educational experts is key to ensuring that the solutions you build are impactful and user-centered., Develop and deliver engaging, human-centered AI applications that demonstrably accelerate learning outcomes and efficiency for thousands of K-12 students.",
        "Datum gevonden": "2024-07-26",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 7,
        "full_text": "Artificial Intelligence Engineer, 2 Hour Learning (Remote) - $100,000/year USD\n\nThis is not a position for those who prefer to specialize in a single aspect of development. We're looking for innovative thinkers who can seamlessly integrate AI across both front-end and back-end systems, taking ownership of the entire product. Your work will directly impact thousands of students, ensuring that our tools meet their needs and set new standards for educational technology., * Develop AI-Powered Web Applications: Architect and code sophisticated web applications that integrate both front-end and back-end components, with a focus on enhancing user experience through AI.\n     * Experiment and Innovate with AI: Work with cutting-edge AI technologies, specifically large language models (LLMs) like GPT-4 or Claude, to create autonomous tools and interactive features that redefine how students learn.\n     * Drive Technical Projects: Take ownership of the entire development process, from gathering requirements to launching and iterating on products. You'll work closely with stakeholders to ensure that our solutions meet learner needs and push the boundaries of what's possible.\n     * Collaborate and Communicate: Partner with a global team of developers, designers, and educational experts. Your ability to communicate complex ideas simply and effectively will be key to your success.\n     * Continuous Improvement: Stay ahead of the curve by continually learning and applying the latest advancements in AI and web development to our platform.\n\n   What you will NOT be doing\n\n     * Narrow AI Development: You won't be working on isolated AI features that don't integrate with the overall product strategy. Your work will have a direct impact on thousands of students.\n     * Surface-Level Coding: This is not a role for those who focus only on either front-end or back-end development. You will be expected to integrate both, creating comprehensive and scalable solutions.\n     * Routine Maintenance: This role is not about maintaining legacy systems or making minor updates. You will be driving innovation and building new, cutting-edge applications.\n     * Waiting for Detailed Specifications: You won't be handed fully fleshed-out requirements. Instead, you will take high-level ideas and translate them into fully developed products, leveraging your expertise in AI and full-stack development.\n     * Working in Isolation: You won't be coding in a vacuum. Collaboration with other developers, product managers, and educational experts is key to ensuring that the solutions you build are impactful and user-centered., Develop and deliver engaging, human-centered AI applications that demonstrably accelerate learning outcomes and efficiency for thousands of K-12 students."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development and deployment of AI-powered web applications using large language models (LLMs) like GPT-4 and Claude. It highlights core responsibilities such as experimenting with LLMs for autonomous tools and interactive features, building Retrieval-Augmented Generation (RAG) systems (implied by 'autonomous tools' and 'interactive features' that 'redefine how students learn'), and integrating these AI components into both front-end and back-end systems. The role also involves taking ownership of the entire product lifecycle, from requirements to iteration, and deploying production-grade user-facing software, aligning perfectly with the definition and evidence profile of a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'Architect and code sophisticated web applications that integrate both front-end and back-end components' directly describes traditional software development practices for building user-facing applications.",
                    "phrase": "Architect and code sophisticated web applications that integrate both front-end and back-end components"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Work with cutting-edge AI technologies, specifically large language models (LLMs) like GPT-4 or Claude, to create autonomous tools and interactive features' indicates direct work on developing and adapting generative AI models for specific applications.",
                    "phrase": "Work with cutting-edge AI technologies, specifically large language models (LLMs) like GPT-4 or Claude, to create autonomous tools and interactive features"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'Take ownership of the entire development process, from gathering requirements to launching and iterating on products' implies responsibility for the full lifecycle of a product, including deployment and maintenance in a production environment.",
                    "phrase": "Take ownership of the entire development process, from gathering requirements to launching and iterating on products"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'ensure that our solutions meet learner needs and push the boundaries of what's possible' shows a focus on understanding user needs and aligning technical solutions with educational goals.",
                    "phrase": "ensure that our solutions meet learner needs and push the boundaries of what's possible"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The phrase 'Partner with a global team of developers, designers, and educational experts. Your ability to communicate complex ideas simply and effectively will be key to your success' directly addresses the need for effective communication and collaboration with diverse teams.",
                    "phrase": "Partner with a global team of developers, designers, and educational experts. Your ability to communicate complex ideas simply and effectively will be key to your success"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "The phrase 'Stay ahead of the curve by continually learning and applying the latest advancements in AI and web development to our platform' highlights the importance of continuous learning and adapting to new technologies.",
                    "phrase": "Stay ahead of the curve by continually learning and applying the latest advancements in AI and web development to our platform"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "The phrase 'taking ownership of the entire product' and 'You'll be driving innovation and building new, cutting-edge applications' indicates a proactive approach and responsibility for the success of the product.",
                    "phrase": "taking ownership of the entire product"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The statement 'You won't be handed fully fleshed-out requirements. Instead, you will take high-level ideas and translate them into fully developed products, leveraging your expertise in AI and full-stack development' describes the process of building complete software solutions from conceptualization.",
                    "phrase": "take high-level ideas and translate them into fully developed products, leveraging your expertise in AI and full-stack development"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Develop and deliver engaging, human-centered AI applications that demonstrably accelerate learning outcomes and efficiency' implies the creation and deployment of AI models to achieve specific educational goals.",
                    "phrase": "Develop and deliver engaging, human-centered AI applications that demonstrably accelerate learning outcomes and efficiency"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "taking ownership of the entire product"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Collaborate and Communicate"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Continuous Improvement"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "take high-level ideas and translate them into fully developed products"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "driving innovation and building new, cutting-edge applications"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "GPT-4"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "Claude"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "LLMs"
                }
            ]
        }
    }
}