{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "helpen organisaties identificeren waar AI van toegevoegde waarde kan zijn (en waar niet)",
                "justification": "This phrase directly addresses the consultancy aspect of identifying where AI can provide value, aligning technical solutions with business needs."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "bouwen en opschalen van deze maatwerkoplossingen (gebaseerd op ons eigen platform)",
                "justification": "This indicates the development and scaling of custom solutions, which falls under software development."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Het opzetten en doorontwikkelen van ons interne, composable platform. Deze bouwstenen vormen de basis van onze maatwerkapplicaties.",
                "justification": "Describes the creation and ongoing development of a platform and its components, which is a core software development activity."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Het opzetten en opschalen van maatwerkapplicaties, gebaseerd op al bestaande (GenAI-)oplossingen en/of ons platform.",
                "justification": "This task involves setting up and scaling custom applications, directly relating to software development."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Jij zorgt ervoor dat deze precies aansluiten op de behoeften van (de eindgebruikers van) onze klanten.",
                "justification": "Ensuring applications meet client needs is a key aspect of the software development lifecycle."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "AI"
            },
            {
                "category_id": "TECH3",
                "tool_name": "GenAI"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "transparantie en betrokkenheid belangrijk en denkt graag mee over hoe we samen successen kunnen behalen."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "gaat de ruimte om te werken aan zaken die bijdragen aan de groei en ontwikkeling van Algemi."
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Jij begrijpt hoe belangrijk het is dat je als téam goed opereert. Dit betekent dat je elkaar goed kent, elkaar respecteert, elkaar beter maakt en samen successen viert. Jij geeft hier het goede voorbeeld in."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "gaaf om aan de basis te staan van een impactvolle organisatie."
            }
        ]
    },
    "classification": {
        "profile": "Ambiguous / Not Relevant",
        "confidence": 3,
        "rationale": "The job description mentions AI and GenAI but lacks specific technical tasks related to modeling or advanced GenAI development. It primarily focuses on consultancy, building and scaling custom solutions on an existing platform, and team collaboration, leaning more towards general software development and business advisory."
    }
}