{
    "job_id": 172,
    "job_details": {
        "job_id": 172,
        "Organisatienaam": "Base Cyber Security",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI DevSecOps Engineer",
        "Standplaats": "Amersfoort",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": "professionals@basecybersecurity.com",
        "Beroep": "OTN-engineer (optisch transportnetwerk) (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als AI DevSecOps Engineer speel je een essentiële rol in het waarborgen van de veiligheid en betrouwbaarheid van AI-systemen. Je werkt binnen een innovatief laboratorium dat zich richt op onderzoek en toezicht op geavanceerde AI-toepassingen. Jouw bijdrage is cruciaal bij het ontwikkelen van methoden en tools om risico's binnen AI-systemen te analyseren en te beperken.\n\n   Binnen deze functie ben je verantwoordelijk voor:\n     * Het ontwikkelen van een framework om multi-agent AI-systemen te onderzoeken.\n     * Het opzetten en configureren van een testomgeving voor het evalueren van generatieve AI-modellen op basis van cybersecurity-richtlijnen.\n     * Het implementeren van geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur.\n     * Het delen van kennis en begeleiden van junior engineers en onderzoekers.\n     * Het volgen van de nieuwste ontwikkelingen op het gebied van AI en cybersecurity en deze toepassen in het onderzoek.\n\n   Deze rol biedt de kans om een directe impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context.",
        "Datum gevonden": "2025-02-21",
        "Beroepsgroep": "Network Specialists",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Parttime (≤ 32 uur)",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "AI DevSecOps Engineer\n\nAls AI DevSecOps Engineer speel je een essentiële rol in het waarborgen van de veiligheid en betrouwbaarheid van AI-systemen. Je werkt binnen een innovatief laboratorium dat zich richt op onderzoek en toezicht op geavanceerde AI-toepassingen. Jouw bijdrage is cruciaal bij het ontwikkelen van methoden en tools om risico's binnen AI-systemen te analyseren en te beperken.\n\n   Binnen deze functie ben je verantwoordelijk voor:\n     * Het ontwikkelen van een framework om multi-agent AI-systemen te onderzoeken.\n     * Het opzetten en configureren van een testomgeving voor het evalueren van generatieve AI-modellen op basis van cybersecurity-richtlijnen.\n     * Het implementeren van geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur.\n     * Het delen van kennis en begeleiden van junior engineers en onderzoekers.\n     * Het volgen van de nieuwste ontwikkelingen op het gebied van AI en cybersecurity en deze toepassen in het onderzoek.\n\n   Deze rol biedt de kans om een directe impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description emphasizes developing methods and tools to analyze and mitigate risks within AI systems, focusing on security and reliability. It involves developing a framework for multi-agent AI systems, setting up test environments for evaluating generative AI models against cybersecurity guidelines, and implementing automated workflows and coding standards for infrastructure. While it mentions generative AI models, the core focus is on the security, testing, and operational aspects (DevSecOps) rather than building generative applications or fine-tuning models for specific generative tasks. The responsibilities align more with ensuring the robustness and safety of AI systems, which is a strong indicator for an ML Engineer role with a security focus, rather than a GenAI Engineer who primarily builds generative applications."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'evalueren van generatieve AI-modellen' directly relates to the process of assessing and validating models, which falls under the modeling category.",
                    "phrase": "evalueren van generatieve AI-modellen"
                },
                {
                    "category": "TASK4",
                    "justification": "The description mentions developing a 'framework om multi-agent AI-systemen te onderzoeken' and implementing 'geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur', which are software development activities aimed at building and maintaining systems.",
                    "phrase": "ontwikkelen van een framework om multi-agent AI-systemen te onderzoeken"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'implementeren van geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur' indicates tasks related to building and maintaining software systems and their infrastructure.",
                    "phrase": "implementeren van geautomatiseerde workflows en coding standards voor reproduceerbare en onderhoudbare infrastructuur"
                },
                {
                    "category": "TASK5",
                    "justification": "The job title 'AI DevSecOps Engineer' and the responsibilities related to ensuring 'veiligheid en betrouwbaarheid van AI-systemen', 'analyseren en beperken van risico's', and setting up 'testomgeving' and 'geautomatiseerde workflows' strongly point towards Operations Engineering, specifically in a DevSecOps context for AI.",
                    "phrase": "AI DevSecOps Engineer"
                },
                {
                    "category": "TASK5",
                    "justification": "The responsibility to 'opzetten en configureren van een testomgeving voor het evalueren van generatieve AI-modellen op basis van cybersecurity-richtlijnen' involves setting up and managing environments for testing and evaluation, which is a core part of operations engineering.",
                    "phrase": "opzetten en configureren van een testomgeving"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'implementeren van geautomatiseerde workflows' directly relates to building automated processes for deployment, testing, and maintenance, which is a key aspect of MLOps/DevOps.",
                    "phrase": "implementeren van geautomatiseerde workflows"
                },
                {
                    "category": "TASK1",
                    "justification": "The statement 'jouw bijdrage is cruciaal bij het ontwikkelen van methoden en tools om risico's binnen AI-systemen te analyseren en te beperken' and 'directe impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context' shows an understanding of the broader business and societal impact of AI systems.",
                    "phrase": "ontwikkelen van methoden en tools om risico's binnen AI-systemen te analyseren en te beperken"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context' highlights the alignment of technical work with broader societal and ethical goals.",
                    "phrase": "impact te hebben op de veiligheid en ethische implementatie van AI binnen een maatschappelijk relevante context"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "delen van kennis en begeleiden van junior engineers en onderzoekers"
                },
                {
                    "category": "SKILL2",
                    "phrase": "volgen van de nieuwste ontwikkelingen op het gebied van AI en cybersecurity en deze toepassen in het onderzoek"
                },
                {
                    "category": "SKILL3",
                    "phrase": "ontwikkelen van methoden en tools om risico's binnen AI-systemen te analyseren en te beperken"
                },
                {
                    "category": "SKILL4",
                    "phrase": "veiligheid en ethische implementatie van AI"
                },
                {
                    "category": "SKILL5",
                    "phrase": "ontwikkelen van een framework om multi-agent AI-systemen te onderzoeken"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "generatieve AI-modellen"
                },
                {
                    "category": "TECH6",
                    "phrase": "geautomatiseerde workflows"
                }
            ]
        }
    }
}