{
    "job_id": 500,
    "job_details": {
        "job_id": 500,
        "Organisatienaam": "Harvey Nash B.V.",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "Full Stack Developer",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "it-contracts.nl",
        "Contactpersoon": "Harvey Nash",
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Full stack developer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We are thrilled to announce an exciting opportunity for a Full Stack Developer to join our team at KPN, a leading internet provider. As a Full Stack Developer, you will be responsible for the innovation and development of our cutting-edge Digital Assistant.\n\n   Our team is dedicated to creating conversational experiences through web/app and voice channels based on the latest conversational technology within the KPN ecosystem. Our digital assistant provides an intuitive natural language-based experience to millions of KPN's customers and users in the consumer and business domains. We are constantly innovating new use cases and services that impact the lives of our customers.\n\n   As a Full Stack Developer, you will work with a team of experts to develop and maintain:\n     * The conversational engine, a Python (Asyncio) backend that handles the connection with the digital assistant platform and for routing live chats and callbacks.\n     * You will also be responsible for developing a React/Redux based front-end chat UI that communicates with the conversational engine, which lives on our website (kpn.com) and the mijnkpn apps.\n     * Additionally, you will work on a FastAPI based BFF that provides endpoints for the conversational platform to enrich the conversation with customer, product information and integration for specific use cases.\n\n   In addition to these tracks, you will also assist our sister teams with generating technical components within the conversational platform that they can use within their conversational content.\n\n   What else?\n\n   Our current focus is on adding integrations with KPN systems to improve the digital self-service capabilities of the digital assistant, strengthening the pivotal bridge function to our customer service department with new channels, and making the digital assistant voice-enabled. And last but not least integration of exciting generative AI capabilities into our digital assistant.\n\n   As a Full Stack Developer at KPN, you will play a leading role in shaping the direction of our technical development. You will be encouraged to make architectural decisions and convince others of your views. Our passionate team focuses on continuously optimizing quality and speed through automation.",
        "Datum gevonden": "2024-01-13",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Freelance",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 1,
        "full_text": "Full Stack Developer\n\nWe are thrilled to announce an exciting opportunity for a Full Stack Developer to join our team at KPN, a leading internet provider. As a Full Stack Developer, you will be responsible for the innovation and development of our cutting-edge Digital Assistant.\n\n   Our team is dedicated to creating conversational experiences through web/app and voice channels based on the latest conversational technology within the KPN ecosystem. Our digital assistant provides an intuitive natural language-based experience to millions of KPN's customers and users in the consumer and business domains. We are constantly innovating new use cases and services that impact the lives of our customers.\n\n   As a Full Stack Developer, you will work with a team of experts to develop and maintain:\n     * The conversational engine, a Python (Asyncio) backend that handles the connection with the digital assistant platform and for routing live chats and callbacks.\n     * You will also be responsible for developing a React/Redux based front-end chat UI that communicates with the conversational engine, which lives on our website (kpn.com) and the mijnkpn apps.\n     * Additionally, you will work on a FastAPI based BFF that provides endpoints for the conversational platform to enrich the conversation with customer, product information and integration for specific use cases.\n\n   In addition to these tracks, you will also assist our sister teams with generating technical components within the conversational platform that they can use within their conversational content.\n\n   What else?\n\n   Our current focus is on adding integrations with KPN systems to improve the digital self-service capabilities of the digital assistant, strengthening the pivotal bridge function to our customer service department with new channels, and making the digital assistant voice-enabled. And last but not least integration of exciting generative AI capabilities into our digital assistant.\n\n   As a Full Stack Developer at KPN, you will play a leading role in shaping the direction of our technical development. You will be encouraged to make architectural decisions and convince others of your views. Our passionate team focuses on continuously optimizing quality and speed through automation."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "confidence_score": 4,
            "rationale": "The role heavily emphasizes developing and integrating generative AI capabilities into a digital assistant, including working with LLMs and conversational engines. While it involves full-stack development, the core focus is on building AI-powered conversational experiences, aligning with the GenAI Engineer profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "phrase": "innovation and development of our cutting-edge Digital Assistant",
                    "category": "TASK4",
                    "justification": "This phrase indicates the development of a user-facing application, which falls under software development."
                },
                {
                    "phrase": "creating conversational experiences through web/app and voice channels based on the latest conversational technology",
                    "category": "TASK3",
                    "justification": "This describes the core function of building and deploying conversational AI, which is a key aspect of generative AI modeling."
                },
                {
                    "phrase": "provides an intuitive natural language-based experience",
                    "category": "TASK3",
                    "justification": "This directly relates to the application of natural language processing and generative models to create user experiences."
                },
                {
                    "phrase": "innovating new use cases and services that impact the lives of our customers",
                    "category": "TASK1",
                    "justification": "This highlights understanding customer needs and translating them into technical solutions, a key aspect of business understanding."
                },
                {
                    "phrase": "develop and maintain: The conversational engine, a Python (Asyncio) backend that handles the connection with the digital assistant platform and for routing live chats and callbacks.",
                    "category": "TASK4",
                    "justification": "This describes the development and maintenance of a backend service, which is a core software development task."
                },
                {
                    "phrase": "developing a React/Redux based front-end chat UI that communicates with the conversational engine",
                    "category": "TASK4",
                    "justification": "This explicitly mentions front-end UI development using specific frameworks, a clear software development task."
                },
                {
                    "phrase": "work on a FastAPI based BFF that provides endpoints for the conversational platform to enrich the conversation with customer, product information and integration for specific use cases.",
                    "category": "TASK4",
                    "justification": "This involves building backend services (BFF) with specific technologies (FastAPI) to support the conversational platform, a software development task."
                },
                {
                    "phrase": "assist our sister teams with generating technical components within the conversational platform that they can use within their conversational content.",
                    "category": "TASK4",
                    "justification": "This involves creating reusable technical components for a platform, which is a software development activity."
                },
                {
                    "phrase": "adding integrations with KPN systems to improve the digital self-service capabilities",
                    "category": "TASK2",
                    "justification": "This involves integrating with existing systems to enhance functionality, which can involve data engineering aspects for data flow and access."
                },
                {
                    "phrase": "making the digital assistant voice-enabled",
                    "category": "TASK3",
                    "justification": "This points to the development of speech-to-text or text-to-speech capabilities, which are generative AI tasks."
                },
                {
                    "phrase": "integration of exciting generative AI capabilities into our digital assistant",
                    "category": "TASK3",
                    "justification": "This is a direct mention of integrating generative AI, a core task for a GenAI Engineer."
                },
                {
                    "phrase": "play a leading role in shaping the direction of our technical development. You will be encouraged to make architectural decisions and convince others of your views.",
                    "category": "SKILL5",
                    "justification": "This indicates ownership, leadership, and influencing technical direction, aligning with innovation and ownership."
                },
                {
                    "phrase": "continuously optimizing quality and speed through automation.",
                    "category": "TASK5",
                    "justification": "This refers to automation for optimization, which is a key aspect of MLOps and operations engineering."
                }
            ],
            "technologies": [
                {
                    "phrase": "Python",
                    "category": "TECH1"
                },
                {
                    "phrase": "Asyncio",
                    "category": "TECH1"
                },
                {
                    "phrase": "React",
                    "category": "TECH4"
                },
                {
                    "phrase": "Redux",
                    "category": "TECH4"
                },
                {
                    "phrase": "FastAPI",
                    "category": "TECH4"
                },
                {
                    "phrase": "generative AI capabilities",
                    "category": "TECH3"
                }
            ],
            "soft_skills": [
                {
                    "phrase": "play a leading role in shaping the direction of our technical development. You will be encouraged to make architectural decisions and convince others of your views.",
                    "category": "SKILL5"
                },
                {
                    "phrase": "Our passionate team focuses on continuously optimizing quality and speed through automation.",
                    "category": "SKILL3"
                }
            ]
        }
    }
}