{
    "job_id": 1086,
    "job_details": {
        "job_id": 1086,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD",
        "Standplaats": "Nijmegen",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality",
        "Datum gevonden": "2024-08-09",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD\n\n* Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, fine-tuning, and deployment of applications built on large language models (LLMs) and other generative AI technologies. Key responsibilities include creating autonomous support platforms using LLMs, integrating state-of-the-art AI like GPT-4 Vision, and building systems that interact with users (e.g., customer support chatbots). The role also involves software development for these AI systems and their deployment on cloud platforms like AWS, aligning directly with the definition and evidence profile of a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Create and improve autonomous support platforms using LLMs' directly relates to building and adapting generative models for specific applications.",
                    "phrase": "Create and improve autonomous support platforms using LLMs"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description mentions 'development but also troubleshooting, maintaining, and updating tools' and 'creating an assistant able to guide customers through an upgrade process', which are core software engineering activities for user-facing applications.",
                    "phrase": "development but also troubleshooting, maintaining, and updating tools"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'creating an assistant able to guide customers through an upgrade process' describes the development of a user-facing application powered by AI.",
                    "phrase": "creating an assistant able to guide customers through an upgrade process"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Test and integrate state-of-the-art AI technologies, like GPT-4 Vision' involves working with and implementing advanced generative AI models.",
                    "phrase": "Test and integrate state-of-the-art AI technologies, like GPT-4 Vision"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'providing support and guidance for internal teams on how to best utilize these technologies within their workflows' indicates understanding how AI can benefit business operations and guiding others on its use.",
                    "phrase": "providing support and guidance for internal teams on how to best utilize these technologies within their workflows"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'Evaluate and enhance the performance and integration of AI solutions across different infrastructures' points to operational aspects of managing and improving deployed AI systems.",
                    "phrase": "Evaluate and enhance the performance and integration of AI solutions across different infrastructures"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The mention of 'ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction' relates to the software development lifecycle and user support.",
                    "phrase": "ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality' highlights the alignment of AI solutions with business goals and service improvement.",
                    "phrase": "Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "providing support and guidance for internal teams"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "troubleshooting, maintaining, and updating tools based on user feedback and support tickets"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Test and integrate state-of-the-art AI technologies"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "significantly boosting the company's innovation capacity"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "LLMs"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "GPT-4 Vision"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "AWS"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "Amazon CodeWhisperer"
                }
            ]
        }
    }
}