{
    "job_id": 1054,
    "job_details": {
        "job_id": 1054,
        "Organisatienaam": "a.s.r. verzekeringen",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Backend Developer Speech Analytics",
        "Standplaats": "Utrecht",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": "Carlijn Otten",
        "Telefoonnummer": "31653477356.0",
        "E-mail": "carlijn.otten@asr.nl",
        "Beroep": "BI specialist & business objects (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* je onderhoudt de applicatie en richt de LTB-processen in\n     * je richt de onboarding volgens de Cloud standaarden van a.s.r. in\n     * de applicatie onderhoud je door bugs te fixen en het verbeteren van de code, alerting en monitoring in Application Insights\n     * je zorgt ervoor dat nieuwe gebruikers binnen a.s.r. worden aangesloten en bouwt interfaces voor nieuwe bronnen en consumerende systemen\n     * je ontwikkelt interfaces voor het aansluiten op het DataWareHouse en nieuwe features\n\nJe komt te werken bij het Speech Analytics Team binnen het ICT bedrijfsonderdeel van a.s.r. Ons team bestaat uit een Product Owner, Scrummaster, Functioneel Beheerders en DevOps Engineers. We werken samen met interne en externe collega's. Om de verbinding met elkaar te houden, zoeken we elkaar gemiddeld twee keer per week op op ons hoofdkantoor in Utrecht. Je hebt verder een grote mate van flexibiliteit, waardoor je baas over je eigen agenda bent. Door de complexiteit binnen onze organisatie en de grote zichtbaarheid van onze tool, kan je in korte tijd veel waarde creëren én verder bijleren over AI. Enthousiast? Lees hier meer over werken in de IT bij a.s.r.",
        "Datum gevonden": "2024-11-29",
        "Beroepsgroep": "Consultants en specialisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Financieel / Verzekeringen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 11,
        "full_text": "Backend Developer Speech Analytics\n\n* je onderhoudt de applicatie en richt de LTB-processen in\n     * je richt de onboarding volgens de Cloud standaarden van a.s.r. in\n     * de applicatie onderhoud je door bugs te fixen en het verbeteren van de code, alerting en monitoring in Application Insights\n     * je zorgt ervoor dat nieuwe gebruikers binnen a.s.r. worden aangesloten en bouwt interfaces voor nieuwe bronnen en consumerende systemen\n     * je ontwikkelt interfaces voor het aansluiten op het DataWareHouse en nieuwe features\n\nJe komt te werken bij het Speech Analytics Team binnen het ICT bedrijfsonderdeel van a.s.r. Ons team bestaat uit een Product Owner, Scrummaster, Functioneel Beheerders en DevOps Engineers. We werken samen met interne en externe collega's. Om de verbinding met elkaar te houden, zoeken we elkaar gemiddeld twee keer per week op op ons hoofdkantoor in Utrecht. Je hebt verder een grote mate van flexibiliteit, waardoor je baas over je eigen agenda bent. Door de complexiteit binnen onze organisatie en de grote zichtbaarheid van onze tool, kan je in korte tijd veel waarde creëren én verder bijleren over AI. Enthousiast? Lees hier meer over werken in de IT bij a.s.r."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses heavily on backend development, application maintenance, bug fixing, and interface development for data warehousing and consuming systems. While it mentions learning about AI and working within a Speech Analytics team, it lacks specific details about developing, fine-tuning, or deploying generative models, RAG systems, or advanced prompt engineering, which are core to a GenAI Engineer role. It also doesn't emphasize predictive modeling or MLOps in the context of ML Engineer roles. The primary focus is on software development and system maintenance rather than AI model development or application."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'je onderhoudt de applicatie' (you maintain the application) and 'de applicatie onderhoud je door bugs te fixen en het verbeteren van de code' (you maintain the application by fixing bugs and improving the code) directly relate to software maintenance and improvement.",
                    "phrase": "je onderhoudt de applicatie"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'je bouwt interfaces voor nieuwe bronnen en consumerende systemen' (you build interfaces for new sources and consuming systems) and 'je ontwikkelt interfaces voor het aansluiten op het DataWareHouse en nieuwe features' (you develop interfaces for connecting to the DataWareHouse and new features) describe the development of software interfaces and connections.",
                    "phrase": "je bouwt interfaces voor nieuwe bronnen en consumerende systemen"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'je ontwikkelt interfaces voor het aansluiten op het DataWareHouse en nieuwe features' (you develop interfaces for connecting to the DataWareHouse and new features) indicates the development of software components to integrate with data systems and add functionality.",
                    "phrase": "je ontwikkelt interfaces voor het aansluiten op het DataWareHouse en nieuwe features"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'alerting en monitoring in Application Insights' (alerting and monitoring in Application Insights) refers to operational aspects of maintaining and observing application performance and health.",
                    "phrase": "alerting en monitoring in Application Insights"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'je richt de onboarding volgens de Cloud standaarden van a.s.r. in' (you set up onboarding according to a.s.r.'s Cloud standards) implies setting up and configuring systems, which can involve data-related infrastructure and processes, especially in a cloud context.",
                    "phrase": "je richt de onboarding volgens de Cloud standaarden van a.s.r. in"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'Om de verbinding met elkaar te houden, zoeken we elkaar gemiddeld twee keer per week op op ons hoofdkantoor in Utrecht' (To maintain connection with each other, we meet on average twice a week at our head office in Utrecht) describes team collaboration and operational cadence, which relates to understanding how the business operates.",
                    "phrase": "Om de verbinding met elkaar te houden, zoeken we elkaar gemiddeld twee keer per week op op ons hoofdkantoor in Utrecht"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "We werken samen met interne en externe collega's"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "kan je in korte tijd veel waarde creëren én verder bijleren over AI"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "je hebt verder een grote mate van flexibiliteit, waardoor je baas over je eigen agenda bent"
                }
            ],
            "technologies": [
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "Cloud standaarden van a.s.r."
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "Application Insights"
                }
            ]
        }
    }
}