{
    "job_id": 373,
    "job_details": {
        "job_id": 373,
        "Organisatienaam": "Witteveen+Bos N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Full stack AI developer",
        "Standplaats": "Deventer",
        "Vacaturelink (origineel)": "jobbird.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Full stack developer (m/v/x)",
        "Opleidingsniveau": "VMBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Je functieDe opkomst van AI-technologie markeert een nieuw tijdperk, waarvan wij als WitteveenBos de meerwaarde optimaal willen benutten. Om ons groeiende AI-team te versterken zoeken wij een full stack AI developer. Idealiter ben jij als een Zwitsers zakmes op het gebied van generatieve AI. Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end. En ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI. In je rol als full stack AI developer fungeer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers. Samen met de ingenieurs en adviseurs signaleer je kansen voor het inzetten van AI, breng je vragen en wensen in kaart en analyseer je processen. Deze bevindingen zet je vervolgens om in passende AI-applicaties met technieken als Retrieval Augmented Generation (RAG) en Agentic Frameworks.Product-MarktcombinatieJe wordt onderdeel van de afdeling Informatiemanagement en\n   digital support (IMDS). Deze afdeling helpt de WitteveenBos organisatie haar ambities te realiseren op het vlak van datagedreven en digitaal werken, onder meer met behulp van AI. De afdeling is gericht op het ondersteunen bij de veranderopgaven van de organisatie en op het optimaliseren van de informatievoorziening aan de gebruikers. De afdeling is daarnaast verantwoordelijk voor integraal projectmanagement binnen de bedrijfsvoering, business intelligence en data-analyse en het implementeren van het werken onder architectuur.Wat wij vragen Hbo-/wo-opleiding in ICT, informatiemanagement, AI/data science, engineering of technische bedrijfskunde. Bij voorkeur met specialisatie richting AI; de positie staat open voor mensen met geen of weinig werkervaring; proactieve, communicatieve en oplossingsgerichte persoonlijkheid; voorliefde voor pionieren; ervaring met Python en/of JavaScript voor web development; - Azure certificatie (AZ-900) is een pre.Wat wij bieden Een functie om impact",
        "Datum gevonden": "2025-03-19",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Zakelijke dienstverlening",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 3,
        "full_text": "Full stack AI developer\n\nJe functieDe opkomst van AI-technologie markeert een nieuw tijdperk, waarvan wij als WitteveenBos de meerwaarde optimaal willen benutten. Om ons groeiende AI-team te versterken zoeken wij een full stack AI developer. Idealiter ben jij als een Zwitsers zakmes op het gebied van generatieve AI. Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end. En ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI. In je rol als full stack AI developer fungeer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers. Samen met de ingenieurs en adviseurs signaleer je kansen voor het inzetten van AI, breng je vragen en wensen in kaart en analyseer je processen. Deze bevindingen zet je vervolgens om in passende AI-applicaties met technieken als Retrieval Augmented Generation (RAG) en Agentic Frameworks.Product-MarktcombinatieJe wordt onderdeel van de afdeling Informatiemanagement en\n   digital support (IMDS). Deze afdeling helpt de WitteveenBos organisatie haar ambities te realiseren op het vlak van datagedreven en digitaal werken, onder meer met behulp van AI. De afdeling is gericht op het ondersteunen bij de veranderopgaven van de organisatie en op het optimaliseren van de informatievoorziening aan de gebruikers. De afdeling is daarnaast verantwoordelijk voor integraal projectmanagement binnen de bedrijfsvoering, business intelligence en data-analyse en het implementeren van het werken onder architectuur.Wat wij vragen Hbo-/wo-opleiding in ICT, informatiemanagement, AI/data science, engineering of technische bedrijfskunde. Bij voorkeur met specialisatie richting AI; de positie staat open voor mensen met geen of weinig werkervaring; proactieve, communicatieve en oplossingsgerichte persoonlijkheid; voorliefde voor pionieren; ervaring met Python en/of JavaScript voor web development; - Azure certificatie (AZ-900) is een pre.Wat wij bieden Een functie om impact"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description emphasizes building AI applications using techniques like Retrieval Augmented Generation (RAG) and Agentic Frameworks, aligning with the core responsibilities of a GenAI Engineer. The role involves acting as a connector between domain experts and AI developers, translating business needs into AI applications, and leveraging both front-end and back-end skills for AI development. The mention of Python and JavaScript for web development, along with a focus on generative AI trends, further supports this classification."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves acting as a connector between domain experts and business lines, identifying opportunities for AI, and translating questions and wishes into AI applications.",
                    "phrase": "Idealiter ben jij als een Zwitsers zakmes op het gebied van generatieve AI. Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end. En ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI. In je rol als full stack AI developer fungeer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers. Samen met de ingenieurs en adviseurs signaleer je kansen voor het inzetten van AI, breng je vragen en wensen in kaart en analyseer je processen."
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The job explicitly mentions implementing AI applications using techniques like Retrieval Augmented Generation (RAG) and Agentic Frameworks, which are core to generative AI modeling.",
                    "phrase": "Deze bevindingen zet je vervolgens om in passende AI-applicaties met technieken als Retrieval Augmented Generation (RAG) en Agentic Frameworks."
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role requires full-stack capabilities, including front-end and back-end development, and experience with Python and/or JavaScript for web development, indicating a need for traditional software engineering skills to build AI applications.",
                    "phrase": "Als generalist beschik jij over actuele kennis en kunde van zowel front end als back end. En ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI. Ervaring met Python en/of JavaScript voor web development"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "While not explicitly detailed, the mention of Azure certification (AZ-900) suggests an understanding of cloud services and potentially deployment/operational aspects, which are part of MLOps.",
                    "phrase": "Azure certificatie (AZ-900) is een pre."
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "In je rol als full stack AI developer fungeer je als de verbinder tussen de domeinexperts uit de business lines en afdelingen enerzijds en ons team van AI developers."
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "proactieve, communicatieve en oplossingsgerichte persoonlijkheid"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "voorliefde voor pionieren"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "ben je op de hoogte van de laatste ontwikkelingen en trends op het gebied van AI"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "generatieve AI"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "Retrieval Augmented Generation (RAG)"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "Agentic Frameworks"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "Python"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "JavaScript"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "Azure"
                }
            ]
        }
    }
}