{
    "job_id": 941,
    "job_details": {
        "job_id": 941,
        "Organisatienaam": "NOS",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Machine learning engineer",
        "Standplaats": "Hilversum",
        "Vacaturelink (origineel)": "nos.homerun.co",
        "Contactpersoon": "José de Vries",
        "Telefoonnummer": null,
        "E-mail": "jose.de.vries@nos.nl",
        "Beroep": "Machine learning engineer (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "De websites en apps van NOS worden continu doorontwikkeld, en data speelt daarbij een steeds grotere rol. Door de website en apps van de NOS lopen allerlei datastromen: bijvoorbeeld waar en wanneer mensen de app gebruiken of welk type content populair is. Aan het tot stand brengen van het nieuws gaat ook een heel publicatieproces met datastromen vooraf.\n\n   Als Machine learning engineer sla jij de brug tussen de wereld van machine learning en het digitale NOS-portfolio dat elke dag miljoenen gebruikers heeft. We ontwikkelen algoritmes en data gedreven toepassingen als hulpmiddel in het journalistieke proces en voor in onze sites en apps. Dit doe je in het team Data & Lab, het team dat experimenteert met digitale innovaties en data-toepassingen en ze, wanneer gevalideerd, naar productie brengt. De kernwaarden betrouwbaarheid, journalistieke kwaliteit en privacy staan hierbij hoog in het vaandel.\n\n   De afgelopen jaren hebben we stappen gezet en de eerste data-toepassingen zijn in productie genomen. Maar er is nog veel te leren en te doen. Wil jij hieraan bijdragen? Dan is dit hét moment om in te stappen als je bij wilt dragen aan de toekomst van de NOS.\n\n     *\n     *\n     *\n     *\n     *\n     *",
        "Datum gevonden": "2024-12-10",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Parttime / Fulltime",
        "Branche": "Media / Communicatie",
        "Organisatiegrootte": "500-999",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 12,
        "full_text": "Machine learning engineer\n\nDe websites en apps van NOS worden continu doorontwikkeld, en data speelt daarbij een steeds grotere rol. Door de website en apps van de NOS lopen allerlei datastromen: bijvoorbeeld waar en wanneer mensen de app gebruiken of welk type content populair is. Aan het tot stand brengen van het nieuws gaat ook een heel publicatieproces met datastromen vooraf.\n\n   Als Machine learning engineer sla jij de brug tussen de wereld van machine learning en het digitale NOS-portfolio dat elke dag miljoenen gebruikers heeft. We ontwikkelen algoritmes en data gedreven toepassingen als hulpmiddel in het journalistieke proces en voor in onze sites en apps. Dit doe je in het team Data & Lab, het team dat experimenteert met digitale innovaties en data-toepassingen en ze, wanneer gevalideerd, naar productie brengt. De kernwaarden betrouwbaarheid, journalistieke kwaliteit en privacy staan hierbij hoog in het vaandel.\n\n   De afgelopen jaren hebben we stappen gezet en de eerste data-toepassingen zijn in productie genomen. Maar er is nog veel te leren en te doen. Wil jij hieraan bijdragen? Dan is dit hét moment om in te stappen als je bij wilt dragen aan de toekomst van de NOS.\n\n     *\n     *\n     *\n     *\n     *\n     *"
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "confidence_score": 4,
            "rationale": "The job description emphasizes developing algorithms and data-driven applications to aid the journalistic process and enhance digital products. It highlights building and deploying these applications into production, aligning with the core responsibilities of an ML Engineer focused on predictive modeling and MLOps."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "phrase": "De websites en apps van NOS worden continu doorontwikkeld, en data speelt daarbij een steeds grotere rol. Door de website en apps van de NOS lopen allerlei datastromen: bijvoorbeeld waar en wanneer mensen de app gebruiken of welk type content populair is. Aan het tot stand brengen van het nieuws gaat ook een heel publicatieproces met datastromen vooraf.",
                    "justification": "This phrase describes the context of the digital products (websites and apps) and how data is integral to their development and the news production process, indicating an understanding of the business domain."
                },
                {
                    "category": "TASK1: Business Understanding",
                    "phrase": "Als Machine learning engineer sla jij de brug tussen de wereld van machine learning en het digitale NOS-portfolio dat elke dag miljoenen gebruikers heeft.",
                    "justification": "This highlights the role's function in connecting ML capabilities with the business's digital portfolio and user base."
                },
                {
                    "category": "TASK1: Business Understanding",
                    "phrase": "De kernwaarden betrouwbaarheid, journalistieke kwaliteit en privacy staan hierbij hoog in het vaandel.",
                    "justification": "This points to an understanding of the core values and ethical considerations within the journalistic business context."
                },
                {
                    "category": "TASK3: Modeling",
                    "phrase": "We ontwikkelen algoritmes en data gedreven toepassingen als hulpmiddel in het journalistieke proces en voor in onze sites en apps.",
                    "justification": "This directly mentions the development of algorithms and data-driven applications, which is the core of modeling tasks."
                },
                {
                    "category": "TASK4: Software Development",
                    "phrase": "en voor in onze sites en apps.",
                    "justification": "This indicates that the developed applications will be integrated into existing digital products (sites and apps), implying software development for integration."
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "phrase": "Dit doe je in het team Data & Lab, het team dat experimenteert met digitale innovaties en data-toepassingen en ze, wanneer gevalideerd, naar productie brengt.",
                    "justification": "This describes the process of taking validated data applications from experimentation to production, which is a key aspect of MLOps."
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "phrase": "De afgelopen jaren hebben we stappen gezet en de eerste data-toepassingen zijn in productie genomen.",
                    "justification": "This mentions that data applications have already been put into production, implying existing MLOps practices and the need to maintain/expand them."
                }
            ],
            "technologies": [],
            "soft_skills": [
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Maar er is nog veel te leren en te doen. Wil jij hieraan bijdragen? Dan is dit hét moment om in te stappen als je bij wilt dragen aan de toekomst van de NOS.",
                    "justification": "This phrase emphasizes the ongoing learning and development opportunities and encourages joining at a pivotal moment, suggesting a need for adaptability and a willingness to learn."
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "het team dat experimenteert met digitale innovaties",
                    "justification": "The mention of experimenting with digital innovations implies a need for proactive, innovative thinking and taking ownership of new ideas."
                }
            ]
        }
    }
}