{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Data pipelines: Ontwerpen, bouwen en onderhouden van data pipelines op ons Snowflake platform, die onze Tableau-rapportages voeden via een semantische laag.",
                "justification": "The phrase explicitly mentions designing, building, and maintaining data pipelines, which is the core definition of Data Engineering."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Generatieve AI: Overdracht en doorontwikkeling van projecten zoals de GenAI Suite en de Klus Coach (een generatieve AI-assistent voor klanten).",
                "justification": "This phrase directly refers to Generative AI projects (GenAI Suite, Klus Coach) and their further development, indicating involvement in modeling or adapting generative AI systems."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "beheer van Dataiku-projecten",
                "justification": "While Dataiku can involve modeling, managing its projects often includes aspects of integrating and maintaining these projects within a broader workflow, aligning with software development principles."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "Linux serverbeheer: Verantwoordelijkheid voor het onderhouden van een Linux-omgeving die cruciaal is voor onze AI-infrastructuur.",
                "justification": "Managing server environments, especially those critical for AI infrastructure, falls under operations engineering."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Je werkt nauw samen met ons data science team, de IT-afdeling en verschillende business units om schaalbare oplossingen te leveren.",
                "justification": "This indicates collaboration with various business units to deliver solutions, implying an understanding of business needs."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH1",
                "tool_name": "Snowflake"
            },
            {
                "category_id": "TECH3",
                "tool_name": "Generatieve AI"
            },
            {
                "category_id": "TECH10",
                "tool_name": "Dataiku"
            },
            {
                "category_id": "TECH1",
                "tool_name": "Linux"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Je werkt nauw samen met ons data science team, de IT-afdeling en verschillende business units"
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "The job explicitly mentions Generative AI projects (GenAI Suite, Klus Coach) and their development. While there's a strong Data Engineering component, the focus on 'Generatieve AI' and the specific mention of developing AI assistants points towards a GenAI Engineer role."
    }
}