{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Ontwerpen en implementeren van geavanceerde machine learning en AI-oplossingen, waaronder generatieve AI-modellen.",
                "justification": "This phrase directly refers to the design and implementation of AI models, including generative AI."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Prompt engineering: Jij ontwikkelt en verfijnt prompts om AI-modellen optimaal te sturen, zodat ze precies doen wat ze moeten doen.",
                "justification": "Prompt engineering is a core task in optimizing and guiding generative AI models, fitting the modeling category."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "zodat deze effectief kunnen bijdragen aan de bedrijfsdoelen.",
                "justification": "This phrase indicates the need to align AI solutions with business objectives."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "AI-oplossingen te creëren die perfect aansluiten bij de behoeften van de business.",
                "justification": "This highlights the requirement to understand and meet business needs with AI solutions."
            },
            {
                "category_id": "TASK2",
                "category_name": "Data Engineering",
                "phrase": "Als Data Engineer AI speel je een cruciale rol in het ontwikkelen, implementeren en verbeteren van AI-gedreven oplossingen",
                "justification": "While the role title is 'Data Engineer AI', the description focuses more on the application and optimization of generative AI models through prompt engineering rather than core data pipeline development. However, the title itself implies a connection to data handling for AI."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "implementeren en verbeteren van AI-gedreven oplossingen",
                "justification": "Implementation and improvement of AI solutions often involves software development aspects to integrate them into systems."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Je onderzoekt en past de nieuwste AI-methoden toe, met een focus op het verbeteren van prompt engineering voor maximale impact.",
                "justification": "This points to the application of new AI methods and improving prompt engineering, which falls under model development and refinement."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "je werk voor iedereen begrijpelijk is.",
                "justification": "Writing and maintaining documentation is a crucial part of software development and knowledge transfer."
            }
        ],
        "technologies": [],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Samenwerken met diverse teams: Je werkt nauw samen met zowel technische als niet-technische stakeholders"
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "Je onderzoekt en past de nieuwste AI-methoden toe"
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "Innovatie: Je onderzoekt en past de nieuwste AI-methoden toe"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Documentatie: Je schrijft en onderhoudt duidelijke technische documentatie"
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "The job heavily emphasizes prompt engineering and the development of generative AI models to meet business goals. While it mentions 'Data Engineer AI', the core responsibilities align more with the GenAI Engineer profile's focus on designing, fine-tuning, and deploying applications built on generative models and advanced prompt engineering."
    }
}