{
    "job_id": 1076,
    "job_details": {
        "job_id": 1076,
        "Organisatienaam": "Circle8",
        "Type adverteerder": "Intermediair",
        "Vacaturetitel": "Junior Data Engineer",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": "Youcef Mechti",
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We staan bij UWV aan de start van een vernieuwingsslag, waarbij generatieve AI (GenAI) de sleutel vormt tot betere dienstverlening voor onze cliënten en tegelijkertijd een nieuwe wereld van mogelijkheden opent voor onze medewerkers. Het Klare Taal experiment van Studio4 is één van de vele projecten die het potentieel van GenAI laten zien. Deze stap vooruit vraagt om stevige eigen kennis in huis. We zijn nu nog te veel - of eigenlijk volledig - afhankelijk van externe kennis voor deze belangrijke en blijvende ontwikkeling. Het opbouwen van onze eigen AI- en ontwikkelkracht binnen innovatie is daarmee niet alleen een kans, maar een noodzaak voor toekomstige ontwikkeling.\n\n   Kansen\n\n   GenAI maakt het mogelijk om veel sneller te experimenteren met AI. Bij traditionele AI technologie was de time-to-market vaak maanden langer omdat modellen getrained moesten worden met grote datasets met testcases (een soort benchmark). GenAI heeft in veel gevallen geen trainingstijd, en kan dus sneller ingezet worden. Dit verklaart ook de enorme groei in AI toepassingen die we de laatste tijd zien. Daarnaast leent de techniek zich goed voor het prototypen van oplossingen voor business problemen. Bij innovatie hoort dat er snel en lean prototypes of MVPs gemaakt worden. Het afgelopen half jaar was er veel behoefte aan deze prototypes die gebruik maken van GenAI technologie. Daarnaast zal deze vraag de komende jaren niet gaan afnemen. Daarom stellen we voor om structurele tech capaciteit aan het team van Studio4 toe te voegen om te zorgen voor kennisborging.\n\n   Structurele oplossing\n\n   Een langetermijnstrategie om de capaciteit en expertise intern op te bouwen, is het aannemen van talent dat zich kan specialiseren in GenAI, data engineering en het bouwen van technische prototypes voor de Studio4 projecten. We willen hiervoor een data practice op te richten: een kleine pool aan specialisten die meewerken aan verschillende innovatie projecten. De specialisten uit de pool werken onder begeleiding van een senior technisch specialist en een innovatie manager. Geïnspireerd door succesverhalen van andere organisaties kunnen we de data practice opzetten met 2 junior profielen, die na een jaar dusdanig ingewerkt zijn dat zij de practice kunnen dragen. Dat betekent dat ze nieuwe collega's kunnen inwerken, en direct met innovatiemanagers aan projecten kunnen werken zonder tussenkomst van senior specialisten.",
        "Datum gevonden": "2024-08-03",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Arbeidsbemiddeling",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "Junior Data Engineer\n\nWe staan bij UWV aan de start van een vernieuwingsslag, waarbij generatieve AI (GenAI) de sleutel vormt tot betere dienstverlening voor onze cliënten en tegelijkertijd een nieuwe wereld van mogelijkheden opent voor onze medewerkers. Het Klare Taal experiment van Studio4 is één van de vele projecten die het potentieel van GenAI laten zien. Deze stap vooruit vraagt om stevige eigen kennis in huis. We zijn nu nog te veel - of eigenlijk volledig - afhankelijk van externe kennis voor deze belangrijke en blijvende ontwikkeling. Het opbouwen van onze eigen AI- en ontwikkelkracht binnen innovatie is daarmee niet alleen een kans, maar een noodzaak voor toekomstige ontwikkeling.\n\n   Kansen\n\n   GenAI maakt het mogelijk om veel sneller te experimenteren met AI. Bij traditionele AI technologie was de time-to-market vaak maanden langer omdat modellen getrained moesten worden met grote datasets met testcases (een soort benchmark). GenAI heeft in veel gevallen geen trainingstijd, en kan dus sneller ingezet worden. Dit verklaart ook de enorme groei in AI toepassingen die we de laatste tijd zien. Daarnaast leent de techniek zich goed voor het prototypen van oplossingen voor business problemen. Bij innovatie hoort dat er snel en lean prototypes of MVPs gemaakt worden. Het afgelopen half jaar was er veel behoefte aan deze prototypes die gebruik maken van GenAI technologie. Daarnaast zal deze vraag de komende jaren niet gaan afnemen. Daarom stellen we voor om structurele tech capaciteit aan het team van Studio4 toe te voegen om te zorgen voor kennisborging.\n\n   Structurele oplossing\n\n   Een langetermijnstrategie om de capaciteit en expertise intern op te bouwen, is het aannemen van talent dat zich kan specialiseren in GenAI, data engineering en het bouwen van technische prototypes voor de Studio4 projecten. We willen hiervoor een data practice op te richten: een kleine pool aan specialisten die meewerken aan verschillende innovatie projecten. De specialisten uit de pool werken onder begeleiding van een senior technisch specialist en een innovatie manager. Geïnspireerd door succesverhalen van andere organisaties kunnen we de data practice opzetten met 2 junior profielen, die na een jaar dusdanig ingewerkt zijn dat zij de practice kunnen dragen. Dat betekent dat ze nieuwe collega's kunnen inwerken, en direct met innovatiemanagers aan projecten kunnen werken zonder tussenkomst van senior specialisten."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses heavily on the application and prototyping of Generative AI (GenAI) for business problems and service improvement, emphasizing the need to build internal expertise in this area. While it mentions 'data engineering' and 'building technical prototypes', it lacks specific details about core ML Engineer tasks like algorithm development, model training/evaluation, or MLOps for predictive models. It also doesn't detail the core responsibilities of a GenAI Engineer such as advanced prompt engineering, RAG systems, or fine-tuning LLMs. The role is described as 'junior' and part of a 'data practice' focused on innovation projects, suggesting a broader, less specialized role that leans towards using AI tools rather than deep development or engineering of AI systems. The primary focus is on leveraging GenAI for business solutions and prototyping, which aligns with the 'Ambiguous' profile's definition of roles primarily focused on the use of AI tools to enhance productivity or business processes, rather than specialized AI development."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The description highlights the goal of improving services for clients and opening new possibilities for employees through GenAI, and mentions prototyping solutions for business problems. This indicates an understanding of how technology serves business objectives.",
                    "phrase": "betere dienstverlening voor onze cliënten en tegelijkertijd een nieuwe wereld van mogelijkheden opent voor onze medewerkers"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The text discusses the need for internal knowledge in GenAI for future development and the necessity of building internal AI and development capacity.",
                    "phrase": "Het opbouwen van onze eigen AI- en ontwikkelkracht binnen innovatie is daarmee niet alleen een kans, maar een noodzaak voor toekomstige ontwikkeling."
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The description explains how GenAI allows for faster experimentation and prototyping of solutions for business problems, contrasting it with traditional AI's longer time-to-market.",
                    "phrase": "Daarnaast leent de techniek zich goed voor het prototypen van oplossingen voor business problemen."
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The role is described as specializing in 'data engineering' as part of building internal capacity for GenAI projects.",
                    "phrase": "data engineering"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The text discusses Generative AI (GenAI) and its ability to be deployed quickly without training time in many cases, contrasting it with traditional AI that requires training with large datasets.",
                    "phrase": "GenAI maakt het mogelijk om veel sneller te experimenteren met AI. Bij traditionele AI technologie was de time-to-market vaak maanden langer omdat modellen getrained moesten worden met grote datasets met testcases (een soort benchmark). GenAI heeft in veel gevallen geen trainingstijd, en kan dus sneller ingezet worden."
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves building technical prototypes for Studio4 projects, which implies software development activities to create functional examples of GenAI applications.",
                    "phrase": "het bouwen van technische prototypes"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The description mentions the need for 'kennisborging' (knowledge retention) and building internal capacity to 'dragen' (carry/support) the practice, implying a need for sustainable, maintainable solutions, though specific MLOps practices are not detailed.",
                    "phrase": "kennisborging"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "talent dat zich kan specialiseren in GenAI, data engineering"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "na een jaar dusdanig ingewerkt zijn dat zij de practice kunnen dragen"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "innovatie projecten"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "nieuwe collega's kunnen inwerken"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "generatieve AI (GenAI)"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "GenAI technologie"
                }
            ]
        }
    }
}