{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "serves both journalists and customers of DPG Media, across all media offerings.",
                "justification": "This phrase indicates an understanding of the end-users and the business context of the search engine."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "improve the quality of the search results.",
                "justification": "Focuses on enhancing a core business function (search quality)."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Keep up with developments in the field of Information Retrieval (e.g. semantic search).",
                "justification": "This implies staying abreast of and potentially applying advanced modeling techniques like semantic search."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Build RAG solutions for editorial domain",
                "justification": "Directly mentions building Retrieval-Augmented Generation (RAG) solutions, a core generative AI modeling task."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Maintain and extend our search back-end.",
                "justification": "This is a core software development task related to building and evolving a system."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Design, develop, run and evaluate online AB-tests",
                "justification": "Involves the design and development of experiments to improve the system, a software development practice."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "support operational excellence through practices like code review and pair programming",
                "justification": "These are standard software development practices aimed at improving code quality and maintainability."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "The entire team is responsible for the operations of our services. This includes actively monitoring different applications and their infrastructure as well as intervening to solve operational problems whenever they arise.",
                "justification": "Directly describes operational responsibilities for services, including monitoring and incident resolution."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "You will be supported by a platform engineering team that manages the CICD pipelines, Machine Learning workflows and most of the infrastructure.",
                "justification": "While supported, the mention of CICD and ML workflows by another team implies the context of MLOps is present, and the team's own responsibility for operations reinforces this."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH2",
                "tool_name": "AWS"
            },
            {
                "category_id": "TECH2",
                "tool_name": "Kafka"
            },
            {
                "category_id": "TECH2",
                "tool_name": "Elasticsearch"
            },
            {
                "category_id": "TECH1",
                "tool_name": "Python"
            },
            {
                "category_id": "TECH2",
                "tool_name": "FastAPI"
            },
            {
                "category_id": "TECH9",
                "tool_name": "SQL"
            },
            {
                "category_id": "TECH6",
                "tool_name": "Docker"
            },
            {
                "category_id": "TECH5",
                "tool_name": "vector databases"
            },
            {
                "category_id": "TECH3",
                "tool_name": "semantic search"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "The company and your team members will actively support you to grow your skills and expertise."
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "The search team consists of three developers, two based in Amsterdam and another in Antwerp. This is who you will be working with on a daily basis."
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "we like to get together in the offices regularly."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "The entire team is responsible for the operations of our services."
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 5,
        "rationale": "The job explicitly mentions building RAG solutions, which is a core responsibility of a GenAI Engineer. The emphasis on semantic search and the use of technologies like vector databases further support this classification. While software development and operational tasks are present, they are in the context of deploying and maintaining GenAI applications."
    }
}