{
    "job_id": 648,
    "job_details": {
        "job_id": 648,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Associate Software Engineer, Trilogy (Remote) - $100,000/year USD",
        "Standplaats": null,
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* Designing and building high-quality AI automations to streamline processes, enhance productivity, and deliver robust, scalable solutions across diverse applications\n     * Experimenting with state-of-the-art AI tools like GPT-4 Vision and Amazon CodeWhisperer, integrating them into our developmental process to assess and enhance their utility\n     * Evaluating and optimizing the implementation of AI solutions across various infrastructures, including AWS, to ensure seamless performance and integration, Architecting and deploying sophisticated, fully-automated AI systems that require zero human intervention for a truly scalable impact",
        "Datum gevonden": "2024-09-26",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 9,
        "full_text": "Associate Software Engineer, Trilogy (Remote) - $100,000/year USD\n\n* Designing and building high-quality AI automations to streamline processes, enhance productivity, and deliver robust, scalable solutions across diverse applications\n     * Experimenting with state-of-the-art AI tools like GPT-4 Vision and Amazon CodeWhisperer, integrating them into our developmental process to assess and enhance their utility\n     * Evaluating and optimizing the implementation of AI solutions across various infrastructures, including AWS, to ensure seamless performance and integration, Architecting and deploying sophisticated, fully-automated AI systems that require zero human intervention for a truly scalable impact"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description emphasizes designing and building AI automations, experimenting with state-of-the-art AI tools like GPT-4 Vision, integrating them into developmental processes, and architecting/deploying sophisticated, fully-automated AI systems. This aligns strongly with the core responsibilities of a GenAI Engineer, particularly in leveraging generative models and building production-grade systems."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Experimenting with state-of-the-art AI tools like GPT-4 Vision' directly relates to the core process of working with and adapting AI models.",
                    "phrase": "Experimenting with state-of-the-art AI tools like GPT-4 Vision"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'Designing and building high-quality AI automations to streamline processes, enhance productivity, and deliver robust, scalable solutions across diverse applications' describes the development of software applications incorporating AI.",
                    "phrase": "Designing and building high-quality AI automations to streamline processes, enhance productivity, and deliver robust, scalable solutions across diverse applications"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'integrating them into our developmental process to assess and enhance their utility' refers to the software development task of incorporating AI tools into existing or new systems.",
                    "phrase": "integrating them into our developmental process to assess and enhance their utility"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'Evaluating and optimizing the implementation of AI solutions across various infrastructures, including AWS, to ensure seamless performance and integration' points to the operational aspects of deploying and maintaining AI systems.",
                    "phrase": "Evaluating and optimizing the implementation of AI solutions across various infrastructures, including AWS, to ensure seamless performance and integration"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'Architecting and deploying sophisticated, fully-automated AI systems that require zero human intervention for a truly scalable impact' describes the deployment and operationalization of AI systems.",
                    "phrase": "Architecting and deploying sophisticated, fully-automated AI systems that require zero human intervention for a truly scalable impact"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL3",
                    "phrase": "Designing and building high-quality AI automations to streamline processes, enhance productivity, and deliver robust, scalable solutions"
                },
                {
                    "category": "SKILL3",
                    "phrase": "Evaluating and optimizing the implementation of AI solutions"
                },
                {
                    "category": "SKILL5",
                    "phrase": "Architecting and deploying sophisticated, fully-automated AI systems"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "GPT-4 Vision"
                },
                {
                    "category": "TECH2",
                    "phrase": "AWS"
                },
                {
                    "category": "TECH2",
                    "phrase": "Amazon CodeWhisperer"
                }
            ]
        }
    }
}