{
    "job_id": 1268,
    "job_details": {
        "job_id": 1268,
        "Organisatienaam": "Wolters Kluwer N.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Principal Software Engineer - GenAI Platform Development",
        "Standplaats": "Alphen aan den Rijn",
        "Vacaturelink (origineel)": "wolterskluwer.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "As a Principal Software Engineer, you will be at the forefront of designing and implementing advanced Generative AI (GenAI) services. Your role will focus on crafting reusable, scalable AI capabilities that serve as the foundation for a variety of applications. You will leverage your strong analytical and problem-solving skills, coupled with expert-level coding and refactoring experience, to drive innovation and efficiency within our engineering teams., * Lead the design and development of robust GenAI services that can be leveraged across multiple product lines and use cases.\n     * Implement best practices in code modularity, reusability, and maintainability, ensuring our AI services are future-proof and adaptable to evolving requirements.\n     * Collaborate closely with cross-functional teams to integrate AI services into our broader product ecosystem, prioritizing ease of use and developer experience.\n     * Continuously analyze and improve existing AI services for performance enhancements and to align with current industry standards.\n     * Serve as a technical mentor to other engineers, promoting a culture of technical excellence and shared ownership of code quality.\n     * Drive innovation by staying abreast of the latest advancements in AI technologies and programming practices, evaluating their potential application within our services.",
        "Datum gevonden": "2024-07-21",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "ICT",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 7,
        "full_text": "Principal Software Engineer - GenAI Platform Development\n\nAs a Principal Software Engineer, you will be at the forefront of designing and implementing advanced Generative AI (GenAI) services. Your role will focus on crafting reusable, scalable AI capabilities that serve as the foundation for a variety of applications. You will leverage your strong analytical and problem-solving skills, coupled with expert-level coding and refactoring experience, to drive innovation and efficiency within our engineering teams., * Lead the design and development of robust GenAI services that can be leveraged across multiple product lines and use cases.\n     * Implement best practices in code modularity, reusability, and maintainability, ensuring our AI services are future-proof and adaptable to evolving requirements.\n     * Collaborate closely with cross-functional teams to integrate AI services into our broader product ecosystem, prioritizing ease of use and developer experience.\n     * Continuously analyze and improve existing AI services for performance enhancements and to align with current industry standards.\n     * Serve as a technical mentor to other engineers, promoting a culture of technical excellence and shared ownership of code quality.\n     * Drive innovation by staying abreast of the latest advancements in AI technologies and programming practices, evaluating their potential application within our services."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the design, development, and implementation of Generative AI (GenAI) services, including building reusable and scalable AI capabilities. It mentions leveraging LLMs and integrating AI services into a product ecosystem, aligning with the core responsibilities of a GenAI Engineer. The focus on building foundational services for applications, prompt engineering implicitly through service design, and the need for robust, production-grade systems points towards this profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves 'designing and implementing advanced Generative AI (GenAI) services', 'crafting reusable, scalable AI capabilities', 'implement best practices in code modularity, reusability, and maintainability', and 'collaborate closely with cross-functional teams to integrate AI services into our broader product ecosystem'. These are all core software development activities focused on building and integrating services.",
                    "phrase": "designing and implementing advanced Generative AI (GenAI) services"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description highlights the need to 'implement best practices in code modularity, reusability, and maintainability, ensuring our AI services are future-proof and adaptable to evolving requirements.' This directly relates to software engineering principles for building maintainable and scalable systems.",
                    "phrase": "Implement best practices in code modularity, reusability, and maintainability"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The requirement to 'collaborate closely with cross-functional teams to integrate AI services into our broader product ecosystem, prioritizing ease of use and developer experience' points to the software development aspect of making AI capabilities accessible and functional within a larger system.",
                    "phrase": "integrate AI services into our broader product ecosystem"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The role is focused on 'designing and implementing advanced Generative AI (GenAI) services' and 'leveraging your strong analytical and problem-solving skills... to drive innovation'. While not explicitly stating model training, the development of GenAI services implies working with and adapting generative models.",
                    "phrase": "designing and implementing advanced Generative AI (GenAI) services"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Continuously analyze and improve existing AI services for performance enhancements and to align with current industry standards' suggests an ongoing process of refining and optimizing the underlying AI models or services.",
                    "phrase": "analyze and improve existing AI services for performance enhancements"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The emphasis on 'reusable, scalable AI capabilities' and ensuring services are 'future-proof and adaptable' implies a need for robust deployment and maintenance strategies, which are key aspects of MLOps.",
                    "phrase": "reusable, scalable AI capabilities"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'Continuously analyze and improve existing AI services for performance enhancements' also touches upon the operational aspect of monitoring and optimizing deployed services.",
                    "phrase": "analyze and improve existing AI services for performance enhancements"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role involves leading the 'design and development of robust GenAI services that can be leveraged across multiple product lines and use cases', which requires understanding how these services align with broader business objectives and product strategies.",
                    "phrase": "leveraged across multiple product lines and use cases"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The collaboration with 'cross-functional teams' to integrate AI services indicates a need to understand different business needs and translate them into technical solutions.",
                    "phrase": "Collaborate closely with cross-functional teams"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "strong analytical and problem-solving skills"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "drive innovation"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "shared ownership of code quality"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Collaborate closely with cross-functional teams"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "staying abreast of the latest advancements in AI technologies"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "technical mentor to other engineers"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "Generative AI (GenAI)"
                }
            ]
        }
    }
}