{
    "job_id": 360,
    "job_details": {
        "job_id": 360,
        "Organisatienaam": "SubAdvies",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI & Automation Engineer",
        "Standplaats": "Groningen",
        "Vacaturelink (origineel)": "nationalevacaturebank.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "PLC engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Als AI & Automation Engineer bij SubAdvies ben jij de drijvende kracht achter slimme, data-gedreven oplossingen. Je ontwikkelt en optimaliseert AI-modellen die onze klanten helpen bij de strategische besluitvoering op het gebied van sociale zekerheid, verzuim en loonkostenbesparing.\n       Een belangrijk onderdeel van je werk is het optimaliseren van een inbox binnen ons eigen platform inzicht.tech. Met deze AI-gedreven tool help je klanten om complexe data begrijpelijk te maken en hiermee inzicht te bieden in hun cijfers. Dankzij jouw expertise in generatieve AI kunnen bedrijven sneller en slimmer werken, ondersteund door automatische analyses en strategische adviezen.\n       Je werkt nauw samen met collega's uit verschillende disciplines om AI-oplossingen naadloos te integreren in onze processen en systemen. Daarnaast blijf je continu op de hoogte van de nieuwste ontwikkelingen op het gebied van kunstmatige intelligentie en machine-learning. Je experimenteert met innovatieve technologieën, test nieuwe modellen en vertaalt deze naar praktische toepassingen die écht impact maken.\n       Naast je technische rol draag je ook bij aan kennisdeling binnen het team. Je helpt collega's AI beter te begrijpen en in te zetten, zodat we samen slimmer en efficiënter werken. Kortom, jij zorgt ervoor dat SubAdvies met de kracht van AI voorop blijft lopen in de markt!\n\n+ AI-gedreven oplossingen ontwikkelen voor het optimaliseren en automatiseren van adviesprocessen.\n          + Data-analyses uitvoeren om patronen te ontdekken die leiden tot nieuwe inzichten en diensten.\n          + Intelligente systemen bouwen die regelgeving kunnen interpreteren en toepassen.\n          + Samenwerken met domeinexperts om oplossingen te creëren die écht impact hebben.\n          + Prototypes ontwikkelen en deze doorontwikkelen tot schaalbare producten.",
        "Datum gevonden": "2025-03-14",
        "Beroepsgroep": "Ingenieurs, constructeurs en technici elektro",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Parttime / Fulltime",
        "Branche": "Zakelijke dienstverlening",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 3,
        "full_text": "AI & Automation Engineer\n\nAls AI & Automation Engineer bij SubAdvies ben jij de drijvende kracht achter slimme, data-gedreven oplossingen. Je ontwikkelt en optimaliseert AI-modellen die onze klanten helpen bij de strategische besluitvoering op het gebied van sociale zekerheid, verzuim en loonkostenbesparing.\n       Een belangrijk onderdeel van je werk is het optimaliseren van een inbox binnen ons eigen platform inzicht.tech. Met deze AI-gedreven tool help je klanten om complexe data begrijpelijk te maken en hiermee inzicht te bieden in hun cijfers. Dankzij jouw expertise in generatieve AI kunnen bedrijven sneller en slimmer werken, ondersteund door automatische analyses en strategische adviezen.\n       Je werkt nauw samen met collega's uit verschillende disciplines om AI-oplossingen naadloos te integreren in onze processen en systemen. Daarnaast blijf je continu op de hoogte van de nieuwste ontwikkelingen op het gebied van kunstmatige intelligentie en machine-learning. Je experimenteert met innovatieve technologieën, test nieuwe modellen en vertaalt deze naar praktische toepassingen die écht impact maken.\n       Naast je technische rol draag je ook bij aan kennisdeling binnen het team. Je helpt collega's AI beter te begrijpen en in te zetten, zodat we samen slimmer en efficiënter werken. Kortom, jij zorgt ervoor dat SubAdvies met de kracht van AI voorop blijft lopen in de markt!\n\n+ AI-gedreven oplossingen ontwikkelen voor het optimaliseren en automatiseren van adviesprocessen.\n          + Data-analyses uitvoeren om patronen te ontdekken die leiden tot nieuwe inzichten en diensten.\n          + Intelligente systemen bouwen die regelgeving kunnen interpreteren en toepassen.\n          + Samenwerken met domeinexperts om oplossingen te creëren die écht impact hebben.\n          + Prototypes ontwikkelen en deze doorontwikkelen tot schaalbare producten."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description emphasizes developing and optimizing AI models, specifically mentioning 'generatieve AI' (generative AI), and building AI-driven tools for understanding complex data and providing strategic advice. The core responsibilities include optimizing an inbox within their platform using AI, making complex data understandable, and providing automatic analyses and strategic advice. This aligns with the GenAI Engineer profile's focus on developing applications built on generative models and building production-grade user-facing software systems. The mention of 'prototypes developen en deze doorontwikkelen tot schaalbare producten' also supports the software development aspect of this role."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'ontwikkelt en optimaliseert AI-modellen' directly refers to the creation and refinement of AI models, which is the core of the Modeling task. The mention of 'generatieve AI' further specifies the type of modeling involved.",
                    "phrase": "ontwikkelt en optimaliseert AI-modellen"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Data-analyses uitvoeren om patronen te ontdekken' describes the process of analyzing data to find patterns, which is a fundamental aspect of model building and understanding data for AI applications.",
                    "phrase": "Data-analyses uitvoeren om patronen te ontdekken"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Intelligente systemen bouwen die regelgeving kunnen interpreteren en toepassen' implies the development of systems that can understand and apply complex rules, which often involves building or fine-tuning models for specific interpretation tasks.",
                    "phrase": "Intelligente systemen bouwen die regelgeving kunnen interpreteren en toepassen"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'Prototypes ontwikkelen en deze doorontwikkelen tot schaalbare producten' indicates the process of taking initial concepts and building them into robust, deployable software, which is a key aspect of Software Development.",
                    "phrase": "Prototypes ontwikkelen en deze doorontwikkelen tot schaalbare producten"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'AI-gedreven oplossingen ontwikkelen voor het optimaliseren en automatiseren van adviesprocessen' suggests building software solutions that leverage AI to automate and improve business processes, fitting the Software Development category.",
                    "phrase": "AI-gedreven oplossingen ontwikkelen voor het optimaliseren en automatiseren van adviesprocessen"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'helpen onze klanten bij de strategische besluitvoering op het gebied van sociale zekerheid, verzuim en loonkostenbesparing' shows an understanding of the business context and how AI can be applied to solve specific business challenges.",
                    "phrase": "helpen onze klanten bij de strategische besluitvoering op het gebied van sociale zekerheid, verzuim en loonkostenbesparing"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'hiermee inzicht te bieden in hun cijfers' indicates a focus on translating data into actionable business insights for clients.",
                    "phrase": "hiermee inzicht te bieden in hun cijfers"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'ondersteund door automatische analyses en strategische adviezen' highlights the goal of providing strategic business advice through AI, demonstrating business understanding.",
                    "phrase": "ondersteund door automatische analyses en strategische adviezen"
                },
                {
                    "category": "SKILL1",
                    "justification": "The phrase 'Je werkt nauw samen met collega's uit verschillende disciplines' points to collaboration with diverse teams.",
                    "phrase": "Je werkt nauw samen met collega's uit verschillende disciplines"
                },
                {
                    "category": "SKILL2",
                    "justification": "The phrase 'blijf je continu op de hoogte van de nieuwste ontwikkelingen op het gebied van kunstmatige intelligentie en machine-learning' and 'experimenteert met innovatieve technologieën' show a commitment to continuous learning and adaptability.",
                    "phrase": "blijf je continu op de hoogte van de nieuwste ontwikkelingen op het gebied van kunstmatige intelligentie en machine-learning"
                },
                {
                    "category": "SKILL5",
                    "justification": "The phrase 'vert aalt deze naar praktische toepassingen die écht impact maken' and 'zorgt ervoor dat SubAdvies met de kracht van AI voorop blijft lopen in de markt!' suggest innovation and taking ownership to drive the company forward.",
                    "phrase": "vert aalt deze naar praktische toepassingen die écht impact maken"
                },
                {
                    "category": "SKILL1",
                    "justification": "The phrase 'draag je ook bij aan kennisdeling binnen het team. Je helpt collega's AI beter te begrijpen en in te zetten' indicates communication and collaboration skills within the team.",
                    "phrase": "draag je ook bij aan kennisdeling binnen het team"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "Je werkt nauw samen met collega's uit verschillende disciplines"
                },
                {
                    "category": "SKILL2",
                    "phrase": "blijf je continu op de hoogte van de nieuwste ontwikkelingen op het gebied van kunstmatige intelligentie en machine-learning"
                },
                {
                    "category": "SKILL5",
                    "phrase": "vert aalt deze naar praktische toepassingen die écht impact maken"
                },
                {
                    "category": "SKILL1",
                    "phrase": "draag je ook bij aan kennisdeling binnen het team"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "generatieve AI"
                }
            ]
        }
    }
}