{
    "job_id": 444,
    "job_details": {
        "job_id": 444,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior Mobile Engineer, gt.school (Remote) - $100,000/year USD",
        "Standplaats": null,
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Helpdeskmedewerker informatietechnologie (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Are you a mobile engineer who thrives on complex challenges and is eager to make a real impact? Join our team to contribute to innovative products that deeply leverage AI and that are reshaping industries and changing the way we work and learn.\n\n   At gt. school, our focus isn't just on creating another app; we're pioneering an innovative approach to learning by integrating modern techniques like advanced AI, adaptive computer-based training, gamification, and continuous feedback. At the heart of it all lies TeachTap, an ambitious app that is bringing historical figures to life using AI, offering an engaging, TikTok-like learning experience to make learning more relevant and fun.\n\n   Your responsibilities will involve turning UI designs into working app features, fixing bugs, and collaborating with our product and backend teams to maintain smooth functionality. You'll be joining our small, tight-knit development team, contributing to innovation and improving our app's user experience. The pace is fast, but the rewards both personal growth and the tangible impact on students are substantial. In this position, you will have a high degree of ownership and the ability to significantly shape the product to ensure a seamless and intuitive experience for our users.\n\n   We're not just using AI as a buzzword. We're at the start of a thrilling journey with generative AI, experimenting and learning to fully leverage its potential and free our engineers from mundane tasks, allowing them to focus on what truly matters: design, decision-making, and understanding the far-reaching implications of different implementation strategies.\n\n   Showcase your skills, not just your resume. Take on our challenges: 15-min Cognitive, 90-min Coding, 180-min App-Building. Excel and you'll face a decisive interview with our Hiring Manager. More than half walk away with an offer. Ready to unleash your potential? Apply today!\n\n   What you will be doing\n\n     * Taking high-fidelity UI designs and transforming them into interactive and efficient mobile app features,\n     * Integrating screens with our modern APIs, ensuring data consistency and responsiveness,\n     * Collaborating with product managers and designers to ensure the functionality, reliability, and user-friendliness of the app.\n\n   What you will NOT be doing\n\n     * Getting stuck in endless approval loops - we value swift decision-making and autonomy.\n     * Isolated tasks - you will collaborate closely with a supportive product and backend team., * Delivering a high-quality application that serves as the primary interface for students in our cutting-edge computer-based learning environment.",
        "Datum gevonden": "2024-05-09",
        "Beroepsgroep": "Supportmedewerkers",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 5,
        "full_text": "Senior Mobile Engineer, gt.school (Remote) - $100,000/year USD\n\nAre you a mobile engineer who thrives on complex challenges and is eager to make a real impact? Join our team to contribute to innovative products that deeply leverage AI and that are reshaping industries and changing the way we work and learn.\n\n   At gt. school, our focus isn't just on creating another app; we're pioneering an innovative approach to learning by integrating modern techniques like advanced AI, adaptive computer-based training, gamification, and continuous feedback. At the heart of it all lies TeachTap, an ambitious app that is bringing historical figures to life using AI, offering an engaging, TikTok-like learning experience to make learning more relevant and fun.\n\n   Your responsibilities will involve turning UI designs into working app features, fixing bugs, and collaborating with our product and backend teams to maintain smooth functionality. You'll be joining our small, tight-knit development team, contributing to innovation and improving our app's user experience. The pace is fast, but the rewards both personal growth and the tangible impact on students are substantial. In this position, you will have a high degree of ownership and the ability to significantly shape the product to ensure a seamless and intuitive experience for our users.\n\n   We're not just using AI as a buzzword. We're at the start of a thrilling journey with generative AI, experimenting and learning to fully leverage its potential and free our engineers from mundane tasks, allowing them to focus on what truly matters: design, decision-making, and understanding the far-reaching implications of different implementation strategies.\n\n   Showcase your skills, not just your resume. Take on our challenges: 15-min Cognitive, 90-min Coding, 180-min App-Building. Excel and you'll face a decisive interview with our Hiring Manager. More than half walk away with an offer. Ready to unleash your potential? Apply today!\n\n   What you will be doing\n\n     * Taking high-fidelity UI designs and transforming them into interactive and efficient mobile app features,\n     * Integrating screens with our modern APIs, ensuring data consistency and responsiveness,\n     * Collaborating with product managers and designers to ensure the functionality, reliability, and user-friendliness of the app.\n\n   What you will NOT be doing\n\n     * Getting stuck in endless approval loops - we value swift decision-making and autonomy.\n     * Isolated tasks - you will collaborate closely with a supportive product and backend team., * Delivering a high-quality application that serves as the primary interface for students in our cutting-edge computer-based learning environment."
    },
    "analysis": {
        "job_profile_classification": {
            "profile": "Ambiguous / Not Relevant",
            "confidence_score": 2,
            "rationale": "The job description focuses heavily on traditional mobile app development, UI/UX implementation, and API integration. While it mentions leveraging AI and generative AI, it does not describe core AI engineering tasks like model development, fine-tuning, or MLOps. The role appears to be a mobile developer using AI-powered features rather than building them."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "phrase": "contribute to innovative products that deeply leverage AI",
                    "category": "TASK1",
                    "justification": "This phrase indicates an understanding of how AI contributes to the product's innovation and impact, aligning technical work with broader product goals."
                },
                {
                    "phrase": "integrating modern techniques like advanced AI, adaptive computer-based training, gamification, and continuous feedback",
                    "category": "TASK1",
                    "justification": "This shows an understanding of how various modern techniques, including AI, are integrated into the learning approach, demonstrating business context awareness."
                },
                {
                    "phrase": "bringing historical figures to life using AI",
                    "category": "TASK1",
                    "justification": "This describes a core product feature that leverages AI, indicating an understanding of the business's innovative approach to learning."
                },
                {
                    "phrase": "turning UI designs into working app features",
                    "category": "TASK4",
                    "justification": "This is a direct description of software development, specifically translating designs into functional application components."
                },
                {
                    "phrase": "fixing bugs",
                    "category": "TASK4",
                    "justification": "Bug fixing is a standard software development task aimed at maintaining and improving application functionality."
                },
                {
                    "phrase": "collaborating with our product and backend teams to maintain smooth functionality",
                    "category": "TASK4",
                    "justification": "This involves working with other development teams to ensure the application functions correctly, a key aspect of software development and integration."
                },
                {
                    "phrase": "contributing to innovation and improving our app's user experience",
                    "category": "TASK4",
                    "justification": "Improving user experience and contributing to innovation within an app are core software development responsibilities."
                },
                {
                    "phrase": "experimenting and learning to fully leverage its potential",
                    "category": "SKILL2",
                    "justification": "This phrase directly speaks to the need for continuous learning and adaptation in a rapidly evolving field like generative AI."
                },
                {
                    "phrase": "free our engineers from mundane tasks, allowing them to focus on what truly matters: design, decision-making, and understanding the far-reaching implications of different implementation strategies",
                    "category": "TASK1",
                    "justification": "This highlights a strategic understanding of how AI can be used to optimize engineering effort, allowing focus on higher-level design and decision-making."
                },
                {
                    "phrase": "Taking high-fidelity UI designs and transforming them into interactive and efficient mobile app features",
                    "category": "TASK4",
                    "justification": "This is a core software development task focused on front-end implementation and feature creation."
                },
                {
                    "phrase": "Integrating screens with our modern APIs, ensuring data consistency and responsiveness",
                    "category": "TASK4",
                    "justification": "This involves connecting application components with backend services via APIs, a fundamental software development activity."
                },
                {
                    "phrase": "Collaborating with product managers and designers to ensure the functionality, reliability, and user-friendliness of the app",
                    "category": "TASK4",
                    "justification": "This describes collaboration within the software development lifecycle to ensure product quality and user experience."
                },
                {
                    "phrase": "Delivering a high-quality application that serves as the primary interface for students in our cutting-edge computer-based learning environment",
                    "category": "TASK4",
                    "justification": "This is a direct statement about the end goal of software development: delivering a functional and high-quality application."
                },
                {
                    "phrase": "high degree of ownership",
                    "category": "SKILL5",
                    "justification": "This indicates a proactive and responsible approach to work, aligning with the concept of ownership in project success."
                },
                {
                    "phrase": "ability to significantly shape the product",
                    "category": "SKILL5",
                    "justification": "This suggests a role where the individual can take initiative and influence the direction of the product, aligning with innovation and ownership."
                }
            ],
            "technologies": [],
            "soft_skills": [
                {
                    "phrase": "collaborating with our product and backend teams",
                    "category": "SKILL1",
                    "justification": "This explicitly mentions working with other teams, indicating collaboration."
                },
                {
                    "phrase": "collaborating with product managers and designers",
                    "category": "SKILL1",
                    "justification": "This highlights the need to work effectively with non-technical stakeholders and other development roles."
                },
                {
                    "phrase": "experimenting and learning to fully leverage its potential",
                    "category": "SKILL2",
                    "justification": "This directly points to a need for continuous learning and adaptation in a new technological area."
                },
                {
                    "phrase": "high degree of ownership",
                    "category": "SKILL5",
                    "justification": "This phrase indicates a proactive and responsible approach to one's work and its outcomes."
                },
                {
                    "phrase": "ability to significantly shape the product",
                    "category": "SKILL5",
                    "justification": "This suggests a drive to take initiative and influence the direction and success of the product."
                }
            ]
        }
    }
}