{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "helpen bij het trainen van generatieve AI-modellen",
                "justification": "Deze frase duidt direct op het proces van het trainen van AI-modellen, wat een kernactiviteit is binnen de 'Modeling' categorie."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Het maken en beantwoorden van vragen met betrekking tot informatica om AI-modellen te helpen trainen",
                "justification": "Het creëren en beantwoorden van specifieke vragen (prompts) om modellen te trainen, valt onder de 'Modeling' taak, specifiek gerelateerd aan het verbeteren van modelprestaties."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Het evalueren en rangschikken van code die door AI-modellen wordt gegenereerd",
                "justification": "Het evalueren en rangschikken van gegenereerde output is een cruciaal onderdeel van modeltraining en -verbetering, wat kernactiviteiten zijn binnen 'Modeling'."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Ben jij een ervaren software-engineer die zijn of haar expertise in codering wil inzetten om AI-modellen te trainen?",
                "justification": "De rol vraagt expliciet om een 'software-engineer' en het inzetten van 'expertise in codering', wat duidt op de noodzaak van programmeervaardigheden voor de ontwikkeling van AI-gerelateerde taken."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "talenteerde programmeurs",
                "justification": "Dit verwijst direct naar de noodzaak van programmeervaardigheden, een essentieel onderdeel van softwareontwikkeling."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "generatieve AI-modellen"
            },
            {
                "category_id": "TECH3",
                "tool_name": "grote taalkundige AI-modellen"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "Er is geen eerdere ervaring met AI vereist."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "flexibele werkuren, zodat je kunt werken wanneer het jou het beste uitkomt."
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "De rol richt zich sterk op het trainen en evalueren van generatieve AI-modellen, met name op het gebied van code. De nadruk ligt op interactie met en verbetering van deze modellen, wat kenmerkend is voor een GenAI Engineer. Hoewel er software-engineeringsvaardigheden worden gevraagd, is de kernactiviteit modeltraining en -verbetering, niet zozeer het bouwen van brede applicaties rondom modellen."
    }
}