{
    "job_id": 813,
    "job_details": {
        "job_id": 813,
        "Organisatienaam": "Uber",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Software Engineer II - ML Threat Detection",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "themuse.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": "accommodations@uber.com",
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "You will drive the development and operations of security services and frameworks to support user-facing products and platforms across Uber. You are passionate and pragmatic technologists who are able to design scalable systems while delivering high-quality code. The security landscape is constantly evolving, and with the adoption of ML/GenAI backed by extensive heterogeneous data, security threats are inevitably broadened. With your deep and comprehensive expertise across major technology stacks, you will architect, implement and scale industry-leading security solutions for the entire company. You will collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind.\n\n   What the Candidate Will Need / Bonus Points\n\n     * Developing Security Solutions: designing, developing, and implementing software solutions to enhance the security posture of the organization.\n     * Threat Analysis and Detection: Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation.\n     * Code Review and Testing\n     * Research: Researching new techniques and tools to enhance the organization's cyber defense capabilities.\n     * Collaboration and Communication: Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity.",
        "Datum gevonden": "2024-09-26",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Media / Communicatie",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 9,
        "full_text": "Software Engineer II - ML Threat Detection\n\nYou will drive the development and operations of security services and frameworks to support user-facing products and platforms across Uber. You are passionate and pragmatic technologists who are able to design scalable systems while delivering high-quality code. The security landscape is constantly evolving, and with the adoption of ML/GenAI backed by extensive heterogeneous data, security threats are inevitably broadened. With your deep and comprehensive expertise across major technology stacks, you will architect, implement and scale industry-leading security solutions for the entire company. You will collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind.\n\n   What the Candidate Will Need / Bonus Points\n\n     * Developing Security Solutions: designing, developing, and implementing software solutions to enhance the security posture of the organization.\n     * Threat Analysis and Detection: Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation.\n     * Code Review and Testing\n     * Research: Researching new techniques and tools to enhance the organization's cyber defense capabilities.\n     * Collaboration and Communication: Working closely with cross-functional teams such as network operations, incident response, and compliance to ensure a cohesive approach to cybersecurity."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description emphasizes the development and operations of security services and frameworks, focusing on designing scalable systems, implementing industry-leading security solutions, and architecting solutions. While ML/GenAI is mentioned as a backing technology, the core responsibilities revolve around traditional software engineering for security, threat analysis, detection, and mitigation, aligning more closely with the 'ML Engineer' profile's focus on building and maintaining production-grade systems and applying ML to solve specific problems (in this case, security threats) rather than the core generative AI development of the 'GenAI Engineer' profile."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'drive the development and operations of security services and frameworks to support user-facing products and platforms' and 'design scalable systems while delivering high-quality code' directly relates to building and maintaining software systems.",
                    "phrase": "drive the development and operations of security services and frameworks to support user-facing products and platforms"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'architect, implement and scale industry-leading security solutions for the entire company' indicates a focus on building and deploying robust software solutions.",
                    "phrase": "architect, implement and scale industry-leading security solutions"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The mention of 'adoption of ML/GenAI backed by extensive heterogeneous data' and 'security threats are inevitably broadened' suggests the application of ML/GenAI models for threat detection and analysis.",
                    "phrase": "adoption of ML/GenAI backed by extensive heterogeneous data"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Threat Analysis and Detection: Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation' implies the use of models to identify and address threats.",
                    "phrase": "Analyzing security threats and vulnerabilities to develop strategies for detection and mitigation"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'designing, developing, and implementing software solutions to enhance the security posture of the organization' is a direct description of software development for security purposes.",
                    "phrase": "designing, developing, and implementing software solutions to enhance the security posture of the organization"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Researching new techniques and tools to enhance the organization's cyber defense capabilities' implies research into and potential application of new modeling techniques for security.",
                    "phrase": "Researching new techniques and tools to enhance the organization's cyber defense capabilities"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'drive the development and operations of security services and frameworks' indicates a responsibility for both development and operational aspects of security systems.",
                    "phrase": "drive the development and operations of security services and frameworks"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind' shows an understanding of how security integrates with business objectives and systems.",
                    "phrase": "collaborate with security leaders and with the broader engineering organization to ensure that the technologies and systems that Uber depends on are built with security-by-design in mind"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborate with security leaders and with the broader engineering organization"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Collaboration and Communication: Working closely with cross-functional teams"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "passionate and pragmatic technologists who are able to design scalable systems"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Research: Researching new techniques and tools"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "drive the development and operations of security services and frameworks"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "ML/GenAI"
                }
            ]
        }
    }
}