{
    "job_id": 141,
    "job_details": {
        "job_id": 141,
        "Organisatienaam": "Tesla",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Sr. Storage Engineer",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Systems engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Tesla is bringing disruption to two major industries, Energy and Transportation and providing a consistent and reliable Storage and Data platform plays a crucial role in achieving Company mission. Our team is responsible to deliver always running storage infrastructure so that Tesla can design, build and support its world class products. In this crucial role, you will work with various engineering, devops and product management teams to design a robust, highly available and scalable storage platform to ensure 100 % availability for our engineering, manufacturing and IT applications.\n   What You'll Do\n     * Responsible for architecture design and maintenance of Next Generation Distributed Storage, including distributed block storage, object storage, file storage etc.\n     * Ensure the architecture to meet SDS (Software Defined Storage) scenarios, HCI scenarios and hybrid cloud scenarios.\n     * Responsible for the development of Reference Architectures and technology standards based on Infrastructure Building Blocks, that can be offered as services to our internal customers\n     * Demonstrate a high level of technical expertise to support complex Storage & Backup devices, including SAN, NAS and Backup solutions across all tiers, under minimal supervision\n     * Responsible for the design, implementation, security and availability of Storage, Backups and SAN infrastructure, based on business requirements while adhering to tight operations, security, and procedural models\n     * Operate in complex, highly-secure, highly-available, operations-centric datacenter environments and interact with other technology domain experts as required, to build and maintain the Storage and Backups solutions in those datacenter environments\n     * Responsible for complex provisioning, advanced maintenance, data replication, disaster recovery, data migration and documentation for our Storage and Backup environments\n     * Write technical design and build documentation for storage infrastructure\n     * Responsible for technology strategy, engineering standards, methodologies, task-plans and best practices for Storage Engineering.",
        "Datum gevonden": "2023-02-21",
        "Beroepsgroep": "Systeemontwikkelaars en -analisten",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Industrie / Techniek",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2023,
        "Maand (van datum gevonden)": 2,
        "full_text": "Sr. Storage Engineer\n\nTesla is bringing disruption to two major industries, Energy and Transportation and providing a consistent and reliable Storage and Data platform plays a crucial role in achieving Company mission. Our team is responsible to deliver always running storage infrastructure so that Tesla can design, build and support its world class products. In this crucial role, you will work with various engineering, devops and product management teams to design a robust, highly available and scalable storage platform to ensure 100 % availability for our engineering, manufacturing and IT applications.\n   What You'll Do\n     * Responsible for architecture design and maintenance of Next Generation Distributed Storage, including distributed block storage, object storage, file storage etc.\n     * Ensure the architecture to meet SDS (Software Defined Storage) scenarios, HCI scenarios and hybrid cloud scenarios.\n     * Responsible for the development of Reference Architectures and technology standards based on Infrastructure Building Blocks, that can be offered as services to our internal customers\n     * Demonstrate a high level of technical expertise to support complex Storage & Backup devices, including SAN, NAS and Backup solutions across all tiers, under minimal supervision\n     * Responsible for the design, implementation, security and availability of Storage, Backups and SAN infrastructure, based on business requirements while adhering to tight operations, security, and procedural models\n     * Operate in complex, highly-secure, highly-available, operations-centric datacenter environments and interact with other technology domain experts as required, to build and maintain the Storage and Backups solutions in those datacenter environments\n     * Responsible for complex provisioning, advanced maintenance, data replication, disaster recovery, data migration and documentation for our Storage and Backup environments\n     * Write technical design and build documentation for storage infrastructure\n     * Responsible for technology strategy, engineering standards, methodologies, task-plans and best practices for Storage Engineering."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses on storage infrastructure, data platforms, and traditional storage solutions (SAN, NAS, Backup). While it mentions 'data platform' and 'distributed storage', it lacks any mention of machine learning, generative AI, LLMs, or related technologies. The core responsibilities are centered around infrastructure engineering and data storage management, not AI model development or deployment. Therefore, it does not fit the ML Engineer or GenAI Engineer profiles and is classified as Ambiguous as it is a technical role but not related to AI as defined in the coding book."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The role involves designing, building, and maintaining storage and data platforms, including data collection, preprocessing (implied through data replication, disaster recovery, data migration), and feature engineering (implied through architecture design for SDS, HCI, hybrid cloud).",
                    "phrase": "design a robust, highly available and scalable storage platform"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The description explicitly mentions the need to design and maintain distributed storage systems, which falls under data engineering infrastructure.",
                    "phrase": "architecture design and maintenance of Next Generation Distributed Storage, including distributed block storage, object storage, file storage etc."
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Ensuring the architecture meets specific deployment scenarios like Software Defined Storage (SDS), Hyperconverged Infrastructure (HCI), and hybrid cloud is a data engineering task related to infrastructure design.",
                    "phrase": "Ensure the architecture to meet SDS (Software Defined Storage) scenarios, HCI scenarios and hybrid cloud scenarios."
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Developing reference architectures and technology standards based on infrastructure building blocks is a data engineering task focused on creating reusable components for data services.",
                    "phrase": "development of Reference Architectures and technology standards based on Infrastructure Building Blocks"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Supporting complex Storage & Backup devices, including SAN, NAS and Backup solutions, is a core data engineering responsibility related to managing data infrastructure.",
                    "phrase": "support complex Storage & Backup devices, including SAN, NAS and Backup solutions"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Designing, implementing, security, and availability of Storage, Backups and SAN infrastructure directly relates to building and maintaining data infrastructure.",
                    "phrase": "design, implementation, security and availability of Storage, Backups and SAN infrastructure"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Operating in datacenter environments to build and maintain Storage and Backups solutions is a data engineering task focused on infrastructure deployment and maintenance.",
                    "phrase": "build and maintain the Storage and Backups solutions in those datacenter environments"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Complex provisioning, advanced maintenance, data replication, disaster recovery, and data migration are all critical aspects of managing and engineering data storage systems.",
                    "phrase": "complex provisioning, advanced maintenance, data replication, disaster recovery, data migration"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Writing technical design and build documentation for storage infrastructure is a supporting task for data engineering, ensuring knowledge transfer and maintainability.",
                    "phrase": "Write technical design and build documentation for storage infrastructure"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "Defining technology strategy, engineering standards, methodologies, and best practices for Storage Engineering is a high-level data engineering task focused on governance and future planning.",
                    "phrase": "technology strategy, engineering standards, methodologies, task-plans and best practices for Storage Engineering"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "interact with other technology domain experts"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "design a robust, highly available and scalable storage platform"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "support complex Storage & Backup devices"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Responsible for architecture design"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Responsible for the development of Reference Architectures"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Responsible for the design, implementation, security and availability"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Responsible for complex provisioning, advanced maintenance, data replication, disaster recovery, data migration and documentation"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Responsible for technology strategy, engineering standards, methodologies, task-plans and best practices"
                }
            ],
            "technologies": []
        }
    }
}