{
    "job_id": 956,
    "job_details": {
        "job_id": 956,
        "Organisatienaam": "Outlier",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Big Data Engineer voor AI-training",
        "Standplaats": "Utrecht",
        "Vacaturelink (origineel)": "find.jobs",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Data architect (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Outlier helpt 's werelds meest innovatieve bedrijven bij het verbeteren van hun AI-modellen door menselijke feedback te leveren. Ben jij een ervaren software-engineer die zijn of haar expertise in codering wil inzetten om AI-modellen te trainen?\n       Wij werken samen met organisaties om grote taalkundige AI-modellen te trainen en helpen geavanceerde generatieve AI-modellen betere code te schrijven. De projecten bevatten meestal afgebakende, zeer gevarieerde problemen die interactie vereisen met deze modellen terwijl ze leren coderen. Er is geen eerdere ervaring met AI vereist.\n\nOutlier is op zoek naar getalenteerde programmeurs om te helpen bij het trainen van generatieve AI-modellen.\n       Deze freelance-opdracht kan volledig op afstand worden uitgevoerd en biedt flexibele werkuren, zodat je kunt werken wanneer het jou het beste uitkomt.\n       Jouw mogelijke bijdragen:\n          + Het maken en beantwoorden van vragen met betrekking tot informatica om AI-modellen te helpen trainen.\n          + Het evalueren en rangschikken van code die door AI-modellen wordt gegenereerd.",
        "Datum gevonden": "2025-01-30",
        "Beroepsgroep": "Database Specialists",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 1,
        "full_text": "Big Data Engineer voor AI-training\n\nOutlier helpt 's werelds meest innovatieve bedrijven bij het verbeteren van hun AI-modellen door menselijke feedback te leveren. Ben jij een ervaren software-engineer die zijn of haar expertise in codering wil inzetten om AI-modellen te trainen?\n       Wij werken samen met organisaties om grote taalkundige AI-modellen te trainen en helpen geavanceerde generatieve AI-modellen betere code te schrijven. De projecten bevatten meestal afgebakende, zeer gevarieerde problemen die interactie vereisen met deze modellen terwijl ze leren coderen. Er is geen eerdere ervaring met AI vereist.\n\nOutlier is op zoek naar getalenteerde programmeurs om te helpen bij het trainen van generatieve AI-modellen.\n       Deze freelance-opdracht kan volledig op afstand worden uitgevoerd en biedt flexibele werkuren, zodat je kunt werken wanneer het jou het beste uitkomt.\n       Jouw mogelijke bijdragen:\n          + Het maken en beantwoorden van vragen met betrekking tot informatica om AI-modellen te helpen trainen.\n          + Het evalueren en rangschikken van code die door AI-modellen wordt gegenereerd."
    },
    "analysis": {
        "profile_classification": "Ambiguous / Not Relevant",
        "confidence_score": 2,
        "rationale": "The job description focuses on providing feedback and evaluating AI-generated code, rather than developing, training, or deploying AI models. While it mentions generative AI models, the core tasks are about human interaction and evaluation, not core AI engineering responsibilities.",
        "thematic_analysis": {
            "job_tasks": [
                {
                    "phrase": "helpt 's werelds meest innovatieve bedrijven bij het verbeteren van hun AI-modellen door menselijke feedback te leveren",
                    "category": "TASK1",
                    "justification": "This phrase indicates understanding the business goal of improving AI models and the method of achieving it through human feedback, aligning technical work with business needs."
                },
                {
                    "phrase": "Ben jij een ervaren software-engineer die zijn of haar expertise in codering wil inzetten om AI-modellen te trainen?",
                    "category": "TASK3",
                    "justification": "While it mentions 'training AI models', the context of 'expertise in coding' and the subsequent tasks suggest a role focused on providing input for training rather than the core model development or engineering."
                },
                {
                    "phrase": "Wij werken samen met organisaties om grote taalkundige AI-modellen te trainen en helpen geavanceerde generatieve AI-modellen betere code te schrijven.",
                    "category": "TASK1",
                    "justification": "This describes the business context and the goal of the organization, which is to train AI models and improve their code generation capabilities."
                },
                {
                    "phrase": "De projecten bevatten meestal afgebakende, zeer gevarieerde problemen die interactie vereisen met deze modellen terwijl ze leren coderen.",
                    "category": "TASK3",
                    "justification": "This describes the nature of the work involving interaction with models during their learning process, which is related to the training phase but from a user/feedback perspective."
                },
                {
                    "phrase": "Het maken en beantwoorden van vragen met betrekking tot informatica om AI-modellen te helpen trainen.",
                    "category": "TASK3",
                    "justification": "This task directly involves creating and answering questions related to computer science to aid in the training of AI models, indicating a role in providing training data or feedback."
                },
                {
                    "phrase": "Het evalueren en rangschikken van code die door AI-modellen wordt gegenereerd.",
                    "category": "TASK3",
                    "justification": "This task involves assessing and ranking the output of AI models, which is a form of feedback used in the model training or fine-tuning process."
                }
            ],
            "technologies": [],
            "soft_skills": [
                {
                    "phrase": "ervaren software-engineer",
                    "category": "SKILL3",
                    "justification": "Implies a background in problem-solving and technical execution, which are foundational to software engineering."
                },
                {
                    "phrase": "flexibele werkuren, zodat je kunt werken wanneer het jou het beste uitkomt",
                    "category": "SKILL5",
                    "justification": "Suggests a need for self-management and ownership of one's work schedule and output."
                }
            ]
        }
    }
}