{
    "job_id": 338,
    "job_details": {
        "job_id": 338,
        "Organisatienaam": "Pontifexx",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Developer",
        "Standplaats": "Zwolle",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Je bent een developer die bouwt aan Pontifexx Paddock, ons digitale platform voor Asset Management. Met jouw technische expertise help je de organisatie groeien en maak je het verschil door het ontwikkelen van krachtige, gebruiksvriendelijke applicaties. Daarnaast pak je praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing.\n   Vorm de toekomst van Asset Management\n   met Pontifexx Paddock\n\n   Pontifexx Tech is een vooruitstrevend onderdeel van Pontifexx en continu in beweging. Met Pontifexx Paddock combineren we AI en BI om Asset Management naar een hoger niveau te brengen. In deze rol ben je onmisbaar voor de verdere ontwikkeling van Pontifexx Paddock. Je werkt nauw samen met onze specialisten op het gebied van Maintenance, IFS Ultimo, AI en BI om nieuwe functies en koppelingen te realiseren die onze dienstverlening versterken.\n\n   In deze functie krijg je de kans om de bestaande technische basis van Pontifexx Paddock verder uit te bouwen. We hanteren al een moderne stack bestaande uit verschillende frameworks en cloudservices, maar we staan open voor jouw inbreng om deze nóg beter te maken. Je hebt dus de ruimte om met nieuwe ideeën te komen en samen met het team te bepalen welke technische verbeteringen echt verschil maken. Zo draag je bij aan best practices, performance optimalisaties en de toekomstige richting van ons platform.",
        "Datum gevonden": "2025-03-27",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Bouw",
        "Organisatiegrootte": "10-49",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 3,
        "full_text": "Developer\n\nJe bent een developer die bouwt aan Pontifexx Paddock, ons digitale platform voor Asset Management. Met jouw technische expertise help je de organisatie groeien en maak je het verschil door het ontwikkelen van krachtige, gebruiksvriendelijke applicaties. Daarnaast pak je praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing.\n   Vorm de toekomst van Asset Management\n   met Pontifexx Paddock\n\n   Pontifexx Tech is een vooruitstrevend onderdeel van Pontifexx en continu in beweging. Met Pontifexx Paddock combineren we AI en BI om Asset Management naar een hoger niveau te brengen. In deze rol ben je onmisbaar voor de verdere ontwikkeling van Pontifexx Paddock. Je werkt nauw samen met onze specialisten op het gebied van Maintenance, IFS Ultimo, AI en BI om nieuwe functies en koppelingen te realiseren die onze dienstverlening versterken.\n\n   In deze functie krijg je de kans om de bestaande technische basis van Pontifexx Paddock verder uit te bouwen. We hanteren al een moderne stack bestaande uit verschillende frameworks en cloudservices, maar we staan open voor jouw inbreng om deze nóg beter te maken. Je hebt dus de ruimte om met nieuwe ideeën te komen en samen met het team te bepalen welke technische verbeteringen echt verschil maken. Zo draag je bij aan best practices, performance optimalisaties en de toekomstige richting van ons platform."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous / Not Relevant",
            "confidence_score": 2,
            "rationale": "The job description focuses on general software development for an Asset Management platform, mentioning AI and BI as components of the platform but not as the core focus of the developer's role. There is a lack of specific tasks related to building, training, or deploying AI models, which are central to ML Engineer and GenAI Engineer roles."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task_name": "TASK4: Software Development",
                    "phrases": [
                        "Je bent een developer die bouwt aan Pontifexx Paddock, ons digitale platform voor Asset Management.",
                        "Met jouw technische expertise help je de organisatie groeien en maak je het verschil door het ontwikkelen van krachtige, gebruiksvriendelijke applicaties.",
                        "Daarnaast pak je praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing.",
                        "In deze functie krijg je de kans om de bestaande technische basis van Pontifexx Paddock verder uit te bouwen.",
                        "Je hebt dus de ruimte om met nieuwe ideeën te komen en samen met het team te bepalen welke technische verbeteringen echt verschil maken.",
                        "Zo draag je bij aan best practices, performance optimalisaties en de toekomstige richting van ons platform."
                    ],
                    "justification": "These phrases describe the core activities of building, developing, and improving a digital platform, which falls under general software development. The focus is on creating applications and technical solutions rather than AI model development."
                },
                {
                    "task_name": "TASK1: Business Understanding",
                    "phrases": [
                        "ons digitale platform voor Asset Management",
                        "help je de organisatie groeien",
                        "praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen",
                        "Vorm de toekomst van Asset Management met Pontifexx Paddock",
                        "combineren we AI en BI om Asset Management naar een hoger niveau te brengen",
                        "nieuwe functies en koppelingen te realiseren die onze dienstverlening versterken"
                    ],
                    "justification": "These phrases indicate an understanding of the business domain (Asset Management), the goal of organizational growth, customer-driven improvements, and how technology (AI/BI) serves the business objectives."
                }
            ],
            "technologies": [
                {
                    "tech_name": "AI",
                    "category": "TECH3: LLM / Generative Models"
                },
                {
                    "tech_name": "BI",
                    "category": "TECH11: Data Analysis"
                }
            ],
            "soft_skills": [
                {
                    "skill_name": "SKILL3: Problem Solving & Pragmatism",
                    "phrases": [
                        "pak je praktijkgerichte issues en verbetervoorstellen op die door onze klanten worden aangedragen en zorg je voor een passende oplossing.",
                        "bepalen welke technische verbeteringen echt verschil maken."
                    ],
                    "justification": "The role involves addressing practical issues and proposing solutions, indicating a problem-solving orientation and a pragmatic approach to technical improvements."
                },
                {
                    "skill_name": "SKILL5: Innovation & Ownership",
                    "phrases": [
                        "we staan open voor jouw inbreng om deze nóg beter te maken.",
                        "Je hebt dus de ruimte om met nieuwe ideeën te komen",
                        "Zo draag je bij aan best practices, performance optimalisaties en de toekomstige richting van ons platform."
                    ],
                    "justification": "The description encourages bringing new ideas, contributing to best practices, and influencing the future direction of the platform, suggesting a need for initiative and ownership."
                },
                {
                    "skill_name": "SKILL1: Communication & Collaboration",
                    "phrases": [
                        "Je werkt nauw samen met onze specialisten op het gebied van Maintenance, IFS Ultimo, AI en BI om nieuwe functies en koppelingen te realiseren",
                        "samen met het team te bepalen welke technische verbeteringen echt verschil maken."
                    ],
                    "justification": "The role requires close collaboration with specialists from various domains and working with the team to make technical decisions."
                },
                {
                    "skill_name": "SKILL2: Learning & Adaptability",
                    "phrases": [
                        "we staan open voor jouw inbreng om deze nóg beter te maken.",
                        "Je hebt dus de ruimte om met nieuwe ideeën te komen"
                    ],
                    "justification": "The company's openness to new ideas and improving the existing stack implies a need for continuous learning and adaptability to new approaches."
                }
            ]
        }
    }
}