{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Hoe we onze cursisten uitdagen en ze verder helpen om de lesstof goed te begrijpen.",
                "justification": "This phrase indicates a focus on understanding how to best facilitate learning and achieve educational outcomes, which is a business objective in the context of an educational institution."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "het slimmer maken van werkend Nederland.",
                "justification": "This describes the company's overall mission and goal, which the job contributes to, highlighting a business context."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "bijwerken van het nieuwste lesmateriaal voor een GenAI-cursus",
                "justification": "Working with material for a GenAI course implies a need to understand and convey concepts related to Generative AI models."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "een module over prompts",
                "justification": "Prompt engineering is a core aspect of working with generative models, falling under the 'Modeling' category."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "check je de laatste trends en ontwikkelingen in AI en IT",
                "justification": "Staying updated on AI trends directly relates to understanding and potentially adapting modeling techniques."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "ontwerpen van interactieve oefeningen waarmee we onze cursisten uitdagen",
                "justification": "Designing exercises to deepen understanding of material, especially in a GenAI context, involves structuring how users interact with and learn about AI concepts, which is related to model application and understanding."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "GenAI"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "Wil jij verder groeien en jezelf ontwikkelen in een vakgebied dat constant in beweging is?"
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "check je de laatste trends en ontwikkelingen in AI en IT om ervoor te zorgen dat jouw lesmateriaal up-to-date blijft."
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "bespreken manieren om complexe IT-concepten begrijpelijk te maken voor cursisten."
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "evalueren van de feedback van cursisten. Zo zie je direct hoe jouw werk bijdraagt aan hun succes en aan het inventariseren van verbeteringen."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "Ter uitbreiding van ons productmanagementteam zoeken wij per direct een onderwijskundig ontwikkelaar met ambitie."
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "Met een tevreden gevoel en vol nieuwe ideeën voor morgen, sluit je je laptop af."
            }
        ]
    },
    "classification": {
        "profile": "Ambiguous / Not Relevant",
        "confidence": 2,
        "rationale": "This role focuses heavily on curriculum development and teaching material creation for GenAI courses, rather than the direct engineering, fine-tuning, or deployment of GenAI models themselves. While GenAI is mentioned, the core tasks align more with educational content development and pedagogical design."
    }
}