{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Design and implement scalable and reliable backend systems and infrastructure to support our products",
                "justification": "This phrase directly describes the core activities of building and maintaining software systems."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Develop and maintain our micro-services to expose platform functionality to internal and external clients",
                "justification": "Developing and maintaining micro-services is a key aspect of software development, focusing on exposing functionality through APIs."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Collaborate with development and quality assurance teams to ensure high availability, scalability, and security of our systems",
                "justification": "Ensuring system qualities like availability, scalability, and security are integral parts of the software development lifecycle."
            },
            {
                "category_id": "TASK5",
                "category_name": "Operations Engineering (MLOps)",
                "phrase": "Collaborate with DevOps Engineers to ensure the continuous delivery and deployment of software products",
                "justification": "Working with DevOps engineers on continuous delivery and deployment is a direct indicator of operations engineering practices."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Work with software developers to identify and implement improvements to our platform architecture and functionality",
                "justification": "This involves modifying and enhancing existing software systems, which falls under software development."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Develop and maintain documentation of our systems and processes",
                "justification": "Documentation is a crucial part of the software development process to ensure understanding and maintainability."
            }
        ],
        "technologies": [],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "work closely with our Frontend Engineers, DevOps Engineers, and other stakeholders"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Collaborate with development and quality assurance teams"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Collaborate with DevOps Engineers"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Work with software developers"
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "Keep up-to-date with the latest trends and technologies"
            },
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "Mentor and train junior members of the backend team"
            }
        ]
    },
    "classification": {
        "profile": "Ambiguous / Not Relevant",
        "confidence": 2,
        "rationale": "This job description focuses on traditional backend engineering, microservices, and general platform infrastructure. There is no mention of AI, machine learning, generative models, or related technologies that would qualify it for a GenAI Engineer or ML Engineer profile. Therefore, it falls outside the scope of the provided AI-specific roles."
    }
}