{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Design and development on Miro canvas components",
                "justification": "This phrase directly relates to the creation and enhancement of software components within the Miro product."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Integrate canvas components with in-house generative AI models",
                "justification": "This involves the integration of models, specifically generative AI models, into existing product components, which is a core aspect of modeling work."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "Add functionality and drive improvements to microservices-based APIs",
                "justification": "This task focuses on enhancing and developing APIs, which falls under traditional software development practices."
            },
            {
                "category_id": "TASK1",
                "category_name": "Business Understanding",
                "phrase": "Contribute to development and execution of technical strategy",
                "justification": "This indicates involvement in defining and implementing the technical direction, which requires understanding business goals and translating them into technical plans."
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Be a role model, technically strong to mentor other engineers in the team",
                "justification": "Mentoring others implies a significant communication and knowledge-sharing component, aligning with collaboration skills."
            }
        ],
        "technologies": [],
        "soft_skills": [
            {
                "category_id": "SKILL5",
                "category_name": "Innovation & Ownership",
                "phrase": "help to significantly shape Miro's Core product"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "Be a role model, technically strong to mentor other engineers in the team"
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 4,
        "rationale": "The role explicitly mentions integrating 'generative AI models' with core user flows and shaping the collaboration workspace. While it includes software development tasks like API improvements, the primary focus on generative AI integration and its application within a product strongly aligns with the GenAI Engineer profile."
    }
}