{
    "job_id": 491,
    "job_details": {
        "job_id": 491,
        "Organisatienaam": "Genmab",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior Software Engineer, DevSecOps Release Mgmt, R&D Digital Products",
        "Standplaats": "Utrecht",
        "Vacaturelink (origineel)": "vacaturesinfarma.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Productingenieur (m/v/x)",
        "Opleidingsniveau": "WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Your Role : We are looking for an innovation-centric Senior Software Engineer, DevSecOps Release Management ( R&D ) to join our IT R&D (Research & Development) Team who is passionate about leading the O rganizational T ransformation in developing DevSecOps tooling, practices, and culture for Genmab's Research and Development Department . You will contribute to R&D-wide DevSecOps requirements and ensure adoption of same, including observability, scalability, availability, security, cost performance. The Senior Software Engineer will also be responsible for DevSecOps technical expertise in Product-oriented-delivery teams, and ensuring that the PODs are executed on time , working with a team of architects and developers . The Senior Software Engineer will support R esearch , Discovery and D evelopment activities and leverage DevSecOps tool kits such as GitLab SaaS v ersion control software, Terraform, Cloud Formation, to ensure smooth and secure delivery of R&D\n   Digital Products, build and deploy scalable and resilient applications. The Senior Software Engineer, DevSecOps Release Management will be instrumental in maintaining robust CI/CD pipelines, enhancing security practices, optimizing cloud resource managemen t , driving operational efficiency and success for the R&D Organization.\n\n   This position will be based out of our Princeton, NJ , Copenhagen, DK or Utrecht, NL and onsite 60% .\n\n   Your Responsibility :\n     * Develop and maintain CI/CD pipelines using GitLab to streamline testing, deployment, and monitoring of applications and their associated infrastructure for software applications and systems used by the R&D Organization for R&D functions such as Research Informatics, SDMS (Scientific Data Management System), Lab Management Systems, Lab and Data Integrations, Research Data products, Pathology, Imaging, Pharmacology, Development Operations etc.\n     * Lead Dev Sec Ops design and execution for IT R&D applications, working with DevSecOps CoE and Infrastructure/Operations team using the likes of GitLab, Kubernetes, AWS Cloud Formation, AWS Systems Manager, AWS Config, etc.\n     * Architect and manage infrastructure as code, utilizing tools like Terraform, Ansible, or similar, to provision and manage resources across cloud environments.\n\n     * Implement and manage CI/CD pipelines , containerization with modular architecture using microservices, infrastructure provisioning and management, ensuring rapid and reliable application deployment.\n     * Optimize cloud resource utilization by designing and implementing efficient automation scripts , monitoring resources , and proactively addressing resource-related issues.\n     * Establish and enforce Dev Sec Ops best practices, including version control, code review, automated testing, and deployment strategies for continuous integration, continuous delivery, and automated testing.\n     * Collaborate with Security and Compliance teams to ensure teams are adhering to industry best practices and regulatory requirements. Create and maintain automated security testing tools to identify vulnerabilities and security risks , collaborate with cross-functional teams to ensure security practices align with industry standards.\n     * E xecute vulnerability assessment, threat modeling, compliance standards, security automation, secure coding practices, adhering to best practices for GxP, GDPR and other regulatory compliance.\n     * Monitor and analyze DevSecOps pipelines and practices, identifying areas for improvement, optimization, and automation to enhance launch/failback consistency and accuracy.\n     * Identify opportunities to use AI tools in DevSecOps related tasks such as Application Security and monitoring, testing (unit, integration, SAST, DAST), integrating security in DevSecOps pipeline, monitoring vulnerabilities, reporting security issues for driving productivity and efficiency.\n     * Collaborate with multidisciplinary teams including colleagues from Data & Analytics, Data Science & AI and Infrastructure Platform Engineering teams, Technical Product Owners, Technical Delivery leads, developers, data engineers, visualization engineers, data scientists, AI/ML e ngineers, b ioinformaticians, understand R&D domain-specific requirements and translate them into DevSecOps technical delivery.\n     * Embrace the Agile framework and Product-oriented-delivery , the iterative and incremental approach for solving technical problems to deliver IT R&D Digital products .\n     * Contribute to documentation, knowledge sharing within the engineering tea m and clearly communicate the function of release automation specifications , and procedures .\n     * Keep up to date with emerging data technologies, trends, and best practices, and make recommendations for their adoption within the Organization's DevSecOps ecosystem.\n     * Play a pivotal role in enabling infrastructure automation for application deployment, continuous improvement , and optimization of infrastructure, monitor and manage the cloud resources and coordinate/collaborate across teams within IT to empower our scientists and researchers in R&D.",
        "Datum gevonden": "2024-04-18",
        "Beroepsgroep": "Bedrijfskundig ingenieurs en deskundigen",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Tijdelijk contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Zakelijke dienstverlening",
        "Organisatiegrootte": "200-499",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 4,
        "full_text": "Senior Software Engineer, DevSecOps Release Mgmt, R&D Digital Products\n\nYour Role : We are looking for an innovation-centric Senior Software Engineer, DevSecOps Release Management ( R&D ) to join our IT R&D (Research & Development) Team who is passionate about leading the O rganizational T ransformation in developing DevSecOps tooling, practices, and culture for Genmab's Research and Development Department . You will contribute to R&D-wide DevSecOps requirements and ensure adoption of same, including observability, scalability, availability, security, cost performance. The Senior Software Engineer will also be responsible for DevSecOps technical expertise in Product-oriented-delivery teams, and ensuring that the PODs are executed on time , working with a team of architects and developers . The Senior Software Engineer will support R esearch , Discovery and D evelopment activities and leverage DevSecOps tool kits such as GitLab SaaS v ersion control software, Terraform, Cloud Formation, to ensure smooth and secure delivery of R&D\n   Digital Products, build and deploy scalable and resilient applications. The Senior Software Engineer, DevSecOps Release Management will be instrumental in maintaining robust CI/CD pipelines, enhancing security practices, optimizing cloud resource managemen t , driving operational efficiency and success for the R&D Organization.\n\n   This position will be based out of our Princeton, NJ , Copenhagen, DK or Utrecht, NL and onsite 60% .\n\n   Your Responsibility :\n     * Develop and maintain CI/CD pipelines using GitLab to streamline testing, deployment, and monitoring of applications and their associated infrastructure for software applications and systems used by the R&D Organization for R&D functions such as Research Informatics, SDMS (Scientific Data Management System), Lab Management Systems, Lab and Data Integrations, Research Data products, Pathology, Imaging, Pharmacology, Development Operations etc.\n     * Lead Dev Sec Ops design and execution for IT R&D applications, working with DevSecOps CoE and Infrastructure/Operations team using the likes of GitLab, Kubernetes, AWS Cloud Formation, AWS Systems Manager, AWS Config, etc.\n     * Architect and manage infrastructure as code, utilizing tools like Terraform, Ansible, or similar, to provision and manage resources across cloud environments.\n\n     * Implement and manage CI/CD pipelines , containerization with modular architecture using microservices, infrastructure provisioning and management, ensuring rapid and reliable application deployment.\n     * Optimize cloud resource utilization by designing and implementing efficient automation scripts , monitoring resources , and proactively addressing resource-related issues.\n     * Establish and enforce Dev Sec Ops best practices, including version control, code review, automated testing, and deployment strategies for continuous integration, continuous delivery, and automated testing.\n     * Collaborate with Security and Compliance teams to ensure teams are adhering to industry best practices and regulatory requirements. Create and maintain automated security testing tools to identify vulnerabilities and security risks , collaborate with cross-functional teams to ensure security practices align with industry standards.\n     * E xecute vulnerability assessment, threat modeling, compliance standards, security automation, secure coding practices, adhering to best practices for GxP, GDPR and other regulatory compliance.\n     * Monitor and analyze DevSecOps pipelines and practices, identifying areas for improvement, optimization, and automation to enhance launch/failback consistency and accuracy.\n     * Identify opportunities to use AI tools in DevSecOps related tasks such as Application Security and monitoring, testing (unit, integration, SAST, DAST), integrating security in DevSecOps pipeline, monitoring vulnerabilities, reporting security issues for driving productivity and efficiency.\n     * Collaborate with multidisciplinary teams including colleagues from Data & Analytics, Data Science & AI and Infrastructure Platform Engineering teams, Technical Product Owners, Technical Delivery leads, developers, data engineers, visualization engineers, data scientists, AI/ML e ngineers, b ioinformaticians, understand R&D domain-specific requirements and translate them into DevSecOps technical delivery.\n     * Embrace the Agile framework and Product-oriented-delivery , the iterative and incremental approach for solving technical problems to deliver IT R&D Digital products .\n     * Contribute to documentation, knowledge sharing within the engineering tea m and clearly communicate the function of release automation specifications , and procedures .\n     * Keep up to date with emerging data technologies, trends, and best practices, and make recommendations for their adoption within the Organization's DevSecOps ecosystem.\n     * Play a pivotal role in enabling infrastructure automation for application deployment, continuous improvement , and optimization of infrastructure, monitor and manage the cloud resources and coordinate/collaborate across teams within IT to empower our scientists and researchers in R&D."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses heavily on DevSecOps, CI/CD pipelines, release management, and infrastructure as code. While it mentions collaboration with Data Science & AI and AI/ML engineers, and the potential use of AI tools for DevSecOps tasks, the core responsibilities and technologies listed are not directly related to building, training, or fine-tuning AI models themselves. The role is primarily about enabling the secure and efficient delivery of R&D digital products through robust engineering practices, rather than developing AI solutions. Therefore, it falls under the 'Ambiguous' category as it's a technical role but not directly focused on AI development or ML engineering as defined in the coding book."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The job description extensively details responsibilities related to CI/CD pipelines, release management, DevSecOps practices, infrastructure as code, containerization, and cloud resource management, all of which are core components of MLOps and operations engineering.",
                    "phrase": "Develop and maintain CI/CD pipelines using GitLab"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The role involves leading DevSecOps design and execution, working with specific tools and teams to ensure secure and efficient IT R&D application delivery.",
                    "phrase": "Lead Dev Sec Ops design and execution for IT R&D applications"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Architecting and managing infrastructure as code is a key aspect of modern operations and MLOps for provisioning and managing cloud resources.",
                    "phrase": "Architect and manage infrastructure as code"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Implementing and managing CI/CD pipelines, containerization, and infrastructure provisioning are central to ensuring rapid and reliable application deployment.",
                    "phrase": "Implement and manage CI/CD pipelines , containerization with modular architecture using microservices, infrastructure provisioning and management"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Optimizing cloud resource utilization through automation, monitoring, and proactive issue resolution is a critical operations engineering task.",
                    "phrase": "Optimize cloud resource utilization by designing and implementing efficient automation scripts"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Establishing and enforcing DevSecOps best practices, including version control, code review, automated testing, and deployment strategies, is fundamental to operations engineering.",
                    "phrase": "Establish and enforce Dev Sec Ops best practices"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Collaborating with security teams to ensure adherence to best practices and regulatory requirements, and creating automated security testing tools, falls under the operational security aspect of DevSecOps.",
                    "phrase": "Collaborate with Security and Compliance teams to ensure teams are adhering to industry best practices and regulatory requirements"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Executing vulnerability assessment, threat modeling, and ensuring compliance with security standards are operational tasks focused on security within the development lifecycle.",
                    "phrase": "E xecute vulnerability assessment, threat modeling, compliance standards, security automation, secure coding practices"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Monitoring and analyzing DevSecOps pipelines and practices to identify areas for improvement and automation is a core responsibility in operations engineering.",
                    "phrase": "Monitor and analyze DevSecOps pipelines and practices"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role requires understanding R&D domain-specific requirements and translating them into DevSecOps technical delivery, indicating a need to grasp business context.",
                    "phrase": "understand R&D domain-specific requirements and translate them into DevSecOps technical delivery"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "While the focus is DevSecOps, the role involves building and deploying scalable and resilient applications, which includes traditional software development aspects.",
                    "phrase": "build and deploy scalable and resilient applications"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The description explicitly mentions identifying opportunities to use AI tools in DevSecOps tasks, indicating an awareness of AI's application within operational contexts.",
                    "phrase": "Identify opportunities to use AI tools in DevSecOps related tasks"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The role is described as leading organizational transformation in developing DevSecOps tooling, practices, and culture, which requires understanding business goals and strategic direction.",
                    "phrase": "leading the O rganizational T ransformation in developing DevSecOps tooling, practices, and culture"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves working with architects and developers to ensure product-oriented delivery teams execute on time, implying involvement in the software development lifecycle.",
                    "phrase": "ensuring that the PODs are executed on time"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The responsibility to ensure observability, scalability, availability, security, and cost performance of R&D-wide DevSecOps requirements directly relates to operational excellence.",
                    "phrase": "ensure observability, scalability, availability, security, cost performance"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role supports Research, Discovery and Development activities and leverages toolkits for smooth and secure delivery of R&D Digital Products, which involves software delivery.",
                    "phrase": "support R esearch , Discovery and D evelopment activities and leverage DevSecOps tool kits"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Maintaining robust CI/CD pipelines is a core MLOps responsibility for streamlining the software delivery process.",
                    "phrase": "maintaining robust CI/CD pipelines"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Enhancing security practices within the development and release process is a key aspect of DevSecOps.",
                    "phrase": "enhancing security practices"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Optimizing cloud resource management is a crucial part of operations engineering for efficiency and cost-effectiveness.",
                    "phrase": "optimizing cloud resource managemen t"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Driving operational efficiency and success for the R&D Organization is a high-level goal of operations engineering.",
                    "phrase": "driving operational efficiency and success for the R&D Organization"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Ensuring rapid and reliable application deployment through CI/CD, containerization, and infrastructure management is a direct operations engineering task.",
                    "phrase": "ensuring rapid and reliable application deployment"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Implementing automation scripts for cloud resource optimization and monitoring is a key operational task.",
                    "phrase": "implementing efficient automation scripts , monitoring resources , and proactively addressing resource-related issues"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Enforcing best practices for continuous integration, continuous delivery, and automated testing is central to operations engineering.",
                    "phrase": "continuous integration, continuous delivery, and automated testing"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Ensuring security practices align with industry standards and collaborating with cross-functional teams on security is an operational responsibility.",
                    "phrase": "ensure security practices align with industry standards"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Automated security testing tools are part of the operational toolkit for identifying vulnerabilities.",
                    "phrase": "Create and maintain automated security testing tools"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Monitoring vulnerabilities and reporting security issues are operational tasks within DevSecOps.",
                    "phrase": "monitoring vulnerabilities, reporting security issues"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Enhancing productivity and efficiency through AI tools in DevSecOps tasks is an operational improvement initiative.",
                    "phrase": "driving productivity and efficiency"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "Collaborating with multidisciplinary teams including Data & Analytics, Data Science & AI, and translating their requirements into DevSecOps technical delivery demonstrates business and domain understanding.",
                    "phrase": "Collaborate with multidisciplinary teams including colleagues from Data & Analytics, Data Science & AI"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "Embracing Agile and Product-oriented-delivery for solving technical problems aligns with modern software development methodologies.",
                    "phrase": "Embrace the Agile framework and Product-oriented-delivery"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "Contributing to documentation and knowledge sharing, and clearly communicating specifications and procedures, supports the business need for clear operational processes.",
                    "phrase": "Contribute to documentation, knowledge sharing within the engineering tea m and clearly communicate the function of release automation specifications , and procedures"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "Keeping up to date with emerging data technologies, trends, and best practices, and making recommendations for adoption, shows a commitment to continuous learning and adaptability.",
                    "phrase": "Keep up to date with emerging data technologies, trends, and best practices"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Enabling infrastructure automation for application deployment, continuous improvement, and optimization of infrastructure is a core operations engineering function.",
                    "phrase": "enabling infrastructure automation for application deployment, continuous improvement , and optimization of infrastructure"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "Monitoring and managing cloud resources and coordinating across teams to empower scientists and researchers is an operational support role.",
                    "phrase": "monitor and manage the cloud resources and coordinate/collaborate across teams within IT"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "working with a team of architects and developers"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Collaborate with Security and Compliance teams"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborate with cross-functional teams"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Collaborate with multidisciplinary teams"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "coordinate/collaborate across teams within IT"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "innovation-centric Senior Software Engineer"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "Keep up to date with emerging data technologies, trends, and best practices"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "ensure smooth and secure delivery of R&D Digital Products"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "driving operational efficiency and success"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "optimizing cloud resource utilization"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "identifying areas for improvement, optimization, and automation"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "driving productivity and efficiency"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "continuous improvement , and optimization of infrastructure"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "Play a pivotal role in enabling infrastructure automation"
                }
            ],
            "technologies": [
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "GitLab SaaS"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "Terraform"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "Cloud Formation"
                },
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "AWS"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "Ansible"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "Kubernetes"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "AWS Systems Manager"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "AWS Config"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "CI/CD pipelines"
                },
                {
                    "category": "TECH6: MLOps & Data Pipelines",
                    "phrase": "containerization"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "automation scripts"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "AI tools"
                }
            ]
        }
    }
}