{
    "job_id": 87,
    "job_details": {
        "job_id": 87,
        "Organisatienaam": "SKIM",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Machine Learning Engineer",
        "Standplaats": "Rotterdam",
        "Vacaturelink (origineel)": "skimgroup.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Machine learning engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "To support and create Support our existing cloud platforms and deploy new ones. We value a proactive attitude with great curiosity to explore new potential solutions. You will Guide, design and deploy cloud solutions for internal and external use Identify and drive improvement initiatives such as developing new tools, new applications, more efficient solutions, develop dashboards and other creative visualizations. Support existing and develop new Shiny-based or PowerBI interactive tools for internal and external use Critique our existing modelling workflows and implement standard ML pipelines in R To innovate and guide Lead and support our team as well as industry teams by creating new solutions that create value for our clients. Improve existing and develop new ML applications, including the use of DL models Explore the business potential of novel models and methods, including but not limited to LLMs and other transformer-based models Support on live client projects with data analysis\n   and insight delivery",
        "Datum gevonden": "2023-07-20",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2023,
        "Maand (van datum gevonden)": 7,
        "full_text": "Machine Learning Engineer\n\nTo support and create Support our existing cloud platforms and deploy new ones. We value a proactive attitude with great curiosity to explore new potential solutions. You will Guide, design and deploy cloud solutions for internal and external use Identify and drive improvement initiatives such as developing new tools, new applications, more efficient solutions, develop dashboards and other creative visualizations. Support existing and develop new Shiny-based or PowerBI interactive tools for internal and external use Critique our existing modelling workflows and implement standard ML pipelines in R To innovate and guide Lead and support our team as well as industry teams by creating new solutions that create value for our clients. Improve existing and develop new ML applications, including the use of DL models Explore the business potential of novel models and methods, including but not limited to LLMs and other transformer-based models Support on live client projects with data analysis\n   and insight delivery"
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "rationale": "The job description emphasizes the creation, improvement, and deployment of ML applications, including the use of DL models and novel transformer-based models. It also highlights the need to critique existing modeling workflows, implement standard ML pipelines, and support live client projects with data analysis and insight delivery. While LLMs are mentioned, the core focus remains on traditional ML engineering tasks like building and deploying models, data analysis, and MLOps, aligning more closely with the ML Engineer profile than a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'deploy new ones' in the context of cloud platforms and 'develop dashboards and other creative visualizations' and 'develop new Shiny-based or PowerBI interactive tools' indicates building and deploying software applications.",
                    "phrase": "deploy new ones"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'developing new tools, new applications' directly refers to the creation of software.",
                    "phrase": "developing new tools, new applications"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'develop dashboards and other creative visualizations' implies building software components for data presentation.",
                    "phrase": "develop dashboards and other creative visualizations"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'develop new Shiny-based or PowerBI interactive tools' indicates the development of interactive software applications.",
                    "phrase": "develop new Shiny-based or PowerBI interactive tools"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Critique our existing modelling workflows and implement standard ML pipelines in R' directly refers to the process of creating and refining machine learning models and pipelines.",
                    "phrase": "Critique our existing modelling workflows and implement standard ML pipelines"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Improve existing and develop new ML applications, including the use of DL models' clearly indicates the development and improvement of machine learning models, including deep learning.",
                    "phrase": "Improve existing and develop new ML applications, including the use of DL models"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Explore the business potential of novel models and methods, including but not limited to LLMs and other transformer-based models' points to research and development involving advanced modeling techniques.",
                    "phrase": "Explore the business potential of novel models and methods, including but not limited to LLMs and other transformer-based models"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'Support our existing cloud platforms and deploy new ones' implies managing and deploying infrastructure, which is a part of data engineering.",
                    "phrase": "Support our existing cloud platforms and deploy new ones"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "The phrase 'Support our existing cloud platforms and deploy new ones' suggests involvement in the deployment and maintenance of cloud-based systems, which aligns with MLOps practices.",
                    "phrase": "Support our existing cloud platforms and deploy new ones"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'Guide, design and deploy cloud solutions for internal and external use' implies understanding the needs of both internal and external users and aligning technical solutions with those needs.",
                    "phrase": "Guide, design and deploy cloud solutions for internal and external use"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'Identify and drive improvement initiatives' suggests a proactive approach to understanding business needs and implementing solutions.",
                    "phrase": "Identify and drive improvement initiatives"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The phrase 'create new solutions that create value for our clients' directly links technical work to client value and business outcomes.",
                    "phrase": "create new solutions that create value for our clients"
                },
                {
                    "category": "TASK2: Data Engineering",
                    "justification": "The phrase 'Support on live client projects with data analysis and insight delivery' involves processing and preparing data for analysis.",
                    "phrase": "Support on live client projects with data analysis"
                },
                {
                    "category": "TASK3: Modeling",
                    "justification": "The phrase 'Support on live client projects with data analysis and insight delivery' involves analyzing data to derive insights, which is a precursor to or part of modeling.",
                    "phrase": "Support on live client projects with data analysis and insight delivery"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL5: Innovation and Ownership",
                    "phrase": "value a proactive attitude with great curiosity to explore new potential solutions"
                },
                {
                    "category": "SKILL5: Innovation and Ownership",
                    "phrase": "innovate and guide"
                },
                {
                    "category": "SKILL5: Innovation and Ownership",
                    "phrase": "Lead and support our team"
                },
                {
                    "category": "SKILL3: Problem Solving & Pragmatism",
                    "phrase": "drive improvement initiatives"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "great curiosity to explore new potential solutions"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "Lead and support our team as well as industry teams"
                }
            ],
            "technologies": [
                {
                    "category": "TECH2: Cloud Platforms & Services",
                    "phrase": "cloud platforms"
                },
                {
                    "category": "TECH1: Programming Languages",
                    "phrase": "R"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "LLMs"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "transformer-based models"
                },
                {
                    "category": "TECH4: LLM Frameworks & Libraries",
                    "phrase": "Shiny-based"
                },
                {
                    "category": "TECH7: Data Visualization",
                    "phrase": "PowerBI"
                }
            ]
        }
    }
}