{
    "job_id": 474,
    "job_details": {
        "job_id": 474,
        "Organisatienaam": "Ebay",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Machine Learning Engineer",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "jobsonline.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Machine learning engineer (m/v/x)",
        "Opleidingsniveau": "WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "We are seeking a highly skilled and motivated Applied Researcher to join our dynamic Generative AI team. The ideal candidate will have a strong background in Natural Language Processing (NLP), Large Language Models (LLMs), and Machine Learning. You will be responsible for developing and implementing sophisticated deep learning models to further empowering our buyers and sellers. You will work closely with engineering and multi-functional NLP and platform engineers to create new capabilities from initial algorithms and out to features in our products and services., * Conduct research on the latest technologies and methodologies in NLP, LLMs, and multimodal LLMs to drive innovation within the team and push the boundaries of what is possible.\n     * Lead and significantly contribute to one or more technical areas of research in NLP to deliver high quality solutions for our customers.\n     * Design, develop, and refine NLP applications and large language models, ensuring they are robust, scalable, and effective.\n     * Collaborate closely with multi-functional teams, including Engineering, Product Management, Quality Assurance, and Operations, to integrate research outcomes into practical applications.\n     * Maintain a high profile both internally and externally, sharing knowledge and findings through conferences, workshops, publications, and open-source contributions.\n     * Cultivate partnerships with other research teams to create synergistic technologies that enhance overall product experiences.\n     * Continuously monitor advancements in AI, LLM, NLP, and related fields to ensure the team remains at the cutting edge.",
        "Datum gevonden": "2024-03-20",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Handel",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 3,
        "full_text": "Machine Learning Engineer\n\nWe are seeking a highly skilled and motivated Applied Researcher to join our dynamic Generative AI team. The ideal candidate will have a strong background in Natural Language Processing (NLP), Large Language Models (LLMs), and Machine Learning. You will be responsible for developing and implementing sophisticated deep learning models to further empowering our buyers and sellers. You will work closely with engineering and multi-functional NLP and platform engineers to create new capabilities from initial algorithms and out to features in our products and services., * Conduct research on the latest technologies and methodologies in NLP, LLMs, and multimodal LLMs to drive innovation within the team and push the boundaries of what is possible.\n     * Lead and significantly contribute to one or more technical areas of research in NLP to deliver high quality solutions for our customers.\n     * Design, develop, and refine NLP applications and large language models, ensuring they are robust, scalable, and effective.\n     * Collaborate closely with multi-functional teams, including Engineering, Product Management, Quality Assurance, and Operations, to integrate research outcomes into practical applications.\n     * Maintain a high profile both internally and externally, sharing knowledge and findings through conferences, workshops, publications, and open-source contributions.\n     * Cultivate partnerships with other research teams to create synergistic technologies that enhance overall product experiences.\n     * Continuously monitor advancements in AI, LLM, NLP, and related fields to ensure the team remains at the cutting edge."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes work with Large Language Models (LLMs), Natural Language Processing (NLP), and multimodal LLMs, including developing, refining, and integrating these models into products. The core responsibilities align with building and deploying generative AI applications, which is the primary focus of a GenAI Engineer. While 'Machine Learning Engineer' is mentioned in the title, the detailed responsibilities point more towards generative AI applications than traditional predictive modeling."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The description explicitly mentions 'developing and implementing sophisticated deep learning models', 'research on the latest technologies and methodologies in NLP, LLMs, and multimodal LLMs', 'design, develop, and refine NLP applications and large language models', and 'continuously monitor advancements in AI, LLM, NLP'. These all directly relate to the creation, adaptation, and refinement of models.",
                    "phrase": "developing and implementing sophisticated deep learning models"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'research on the latest technologies and methodologies in NLP, LLMs, and multimodal LLMs' directly aligns with the modeling aspect of exploring and applying advanced AI techniques.",
                    "phrase": "research on the latest technologies and methodologies in NLP, LLMs, and multimodal LLMs"
                },
                {
                    "category": "TASK3",
                    "justification": "The responsibility to 'design, develop, and refine NLP applications and large language models' is a core modeling task, focusing on the creation and improvement of generative models.",
                    "phrase": "Design, develop, and refine NLP applications and large language models"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'integrate research outcomes into practical applications' and 'features in our products and services' indicates the need to build software that incorporates the developed models.",
                    "phrase": "integrate research outcomes into practical applications"
                },
                {
                    "category": "TASK4",
                    "justification": "The mention of working with 'engineering and multi-functional NLP and platform engineers to create new capabilities from initial algorithms and out to features in our products and services' implies software development to bring models to life as product features.",
                    "phrase": "create new capabilities from initial algorithms and out to features in our products and services"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'empowering our buyers and sellers' indicates an understanding of the business context and how AI solutions can serve business needs.",
                    "phrase": "empowering our buyers and sellers"
                },
                {
                    "category": "SKILL1",
                    "justification": "The description mentions working 'closely with engineering and multi-functional NLP and platform engineers' and collaborating with 'Engineering, Product Management, Quality Assurance, and Operations', which highlights the need for strong collaboration.",
                    "phrase": "Collaborate closely with multi-functional teams"
                },
                {
                    "category": "SKILL2",
                    "justification": "The continuous monitoring of advancements and research into new technologies demonstrates a commitment to learning and adapting in a fast-evolving field.",
                    "phrase": "Continuously monitor advancements in AI, LLM, NLP, and related fields"
                },
                {
                    "category": "SKILL5",
                    "justification": "The responsibility to 'Lead and significantly contribute to one or more technical areas of research' and 'Maintain a high profile... sharing knowledge and findings' suggests initiative and ownership.",
                    "phrase": "Lead and significantly contribute to one or more technical areas of research"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "Collaborate closely with multi-functional teams"
                },
                {
                    "category": "SKILL2",
                    "phrase": "Continuously monitor advancements in AI, LLM, NLP, and related fields"
                },
                {
                    "category": "SKILL5",
                    "phrase": "Lead and significantly contribute to one or more technical areas of research"
                },
                {
                    "category": "SKILL5",
                    "phrase": "Maintain a high profile both internally and externally, sharing knowledge and findings"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "Large Language Models (LLMs)"
                },
                {
                    "category": "TECH3",
                    "phrase": "multimodal LLMs"
                },
                {
                    "category": "TECH1",
                    "phrase": "Natural Language Processing (NLP)"
                }
            ]
        }
    }
}