{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "ensure that all features are designed and implemented in a testable way",
                "justification": "This phrase directly relates to the design and implementation phase of software development, focusing on ensuring that features can be effectively tested."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "advocating for teams to verify and test work in isolated independent units and embed testing early in the lifecycle",
                "justification": "This involves guiding development teams on how to build and test software components, emphasizing early integration of testing into the development lifecycle."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "build applications with clear non-functional requirements (eg performance, security, accessibility, usability)",
                "justification": "This task involves the development of applications, specifically focusing on incorporating non-functional requirements into the build process."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "performing tests such as load-testing, accessibility testing, or security testing",
                "justification": "These are specific types of testing performed on applications during their development lifecycle to ensure quality and functionality."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "plan, execute, and supervise testing of products and features",
                "justification": "This describes core activities within the software development process related to managing and overseeing testing efforts."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "identify and investigate issues and ensure they are handled in a sustainable and repeatable way",
                "justification": "This involves a development-centric approach to issue resolution, focusing on systematic handling and continuous improvement of the process."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "ensure that testing is embedded in the lifecycle of the product by being involved in the planning and design stages of applications and services",
                "justification": "This highlights the involvement in the early stages of software development, integrating testing considerations from planning and design."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "advocate for testing best practices by explaining why testing is required, and enables others to own testing and quality checks of the product",
                "justification": "This involves promoting and enabling quality assurance within the software development process, empowering teams to take ownership of testing."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "drive and coordinate collaborative improvements of the test automation infrastructure and processes in teams",
                "justification": "This pertains to improving the underlying systems and workflows for developing and automating software tests."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "building automated tests that are isolated, deterministic, valuable and provide fast, reliable feedback",
                "justification": "This is a direct description of developing automated testing components for software quality assurance."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "using techniques such as risk-based testing, exploratory testing, mobbing, pairing",
                "justification": "These are methodologies and techniques used in the development and testing of software, often involving strategic planning and exploration of potential issues."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "increase the overall quality of tests for a product",
                "justification": "While related to testing, the act of 'increasing overall quality' of tests can be seen as a form of modeling or improving the testing process itself."
            }
        ],
        "technologies": [],
        "soft_skills": [
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "systematically identify patterns and underlying issues in complex situations, and to find solutions by applying logical and analytical thinking"
            },
            {
                "category_id": "SKILL3",
                "category_name": "Problem Solving & Pragmatism",
                "phrase": "constructively evaluate and develop ideas, plans and solutions by reviewing them, objectively taking into account external knowledge, initiating 'SMART' improvements and articulating their rationale"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "deliver clear, well-structured, and meaningful information to a target audience by using suitable communication mediums and language tailored to the audience"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "achieve mutually agreeable solutions by staying adaptable, communicating ideas in clear coherent language and practising active listening"
            },
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "ask relevant (follow-up) questions to properly engage with the speaker and really understand what they are saying, by applying listening and reflection techniques"
            },
            {
                "category_id": "SKILL2",
                "category_name": "Learning & Adaptability",
                "phrase": "staying adaptable"
            }
        ]
    },
    "classification": {
        "profile": "Ambiguous / Not Relevant",
        "confidence": 5,
        "rationale": "This job description focuses heavily on software testing, quality assurance, and process improvement within a software development lifecycle. It does not mention any specific AI technologies, generative models, or related tasks such as prompt engineering or RAG systems."
    }
}