{
    "thematic_analysis": {
        "job_tasks": [
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Je gaat werken met LLMs om natuurlijke taalverwerkingstoepassingen te ontwikkelen die onze juridische diensten ondersteunen.",
                "justification": "This phrase directly refers to working with Large Language Models (LLMs) for natural language processing applications, which falls under model development."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Je past RAG-technieken toe om relevante informatie uit grote datasets te halen en te gebruiken in AI-modellen.",
                "justification": "The phrase explicitly mentions applying RAG techniques, which is a method for enhancing AI models with external information, fitting the modeling category."
            },
            {
                "category_id": "TASK3",
                "category_name": "Modeling",
                "phrase": "Je werkt aan projecten om door middel van Generative AI en Agentic AI modellen te ontwikkelen die onze juristen ondersteunen in het geven hoogwaardig kwalitatief advies of ontwikkeling van virtuele assistenten als vraagbaak voor collega's en klanten.",
                "justification": "This statement clearly indicates the development of models using Generative AI and Agentic AI for specific business support functions."
            },
            {
                "category_id": "TASK4",
                "category_name": "Software Development",
                "phrase": "bouwt en implementeer je AI-oplossingen in de Azure Cloud.",
                "justification": "The phrase refers to building and implementing AI solutions, which are software development tasks."
            }
        ],
        "technologies": [
            {
                "category_id": "TECH3",
                "tool_name": "Large Language Models (LLMs)"
            },
            {
                "category_id": "TECH4",
                "tool_name": "Retrieval-Augmented Generation (RAG)"
            },
            {
                "category_id": "TECH3",
                "tool_name": "Generative AI"
            },
            {
                "category_id": "TECH4",
                "tool_name": "Agentic AI"
            },
            {
                "category_id": "TECH1",
                "tool_name": "Python"
            },
            {
                "category_id": "TECH2",
                "tool_name": "Azure Cloud"
            }
        ],
        "soft_skills": [
            {
                "category_id": "SKILL1",
                "category_name": "Communication & Collaboration",
                "phrase": "helpen je graag om je vaardigheden in Azure te ontwikkelen en certificeren."
            }
        ]
    },
    "classification": {
        "profile": "GenAI Engineer",
        "confidence": 5,
        "rationale": "The job description heavily emphasizes working with LLMs, RAG techniques, Generative AI, and Agentic AI for developing applications. It also mentions building and implementing AI solutions, aligning perfectly with the core responsibilities and typical projects of a GenAI Engineer."
    }
}