{
    "job_id": 1084,
    "job_details": {
        "job_id": 1084,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD",
        "Standplaats": "Enschede",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality",
        "Datum gevonden": "2024-08-09",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "AI Software Engineer, IgniteTech (Remote) - $60,000/year USD\n\n* Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n     * Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n     * Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction., * Improve support for both internal and external clients, significantly boosting the company's innovation capacity and service quality"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description heavily emphasizes the development, fine-tuning, and deployment of applications built on large language models (LLMs) and other generative AI technologies. Key responsibilities include creating autonomous support platforms using LLMs, integrating state-of-the-art AI technologies like GPT-4 Vision, and building systems like customer-facing assistants. This aligns directly with the definition and core responsibilities of a GenAI Engineer, particularly in building and maintaining production-grade user-facing software systems powered by generative AI."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Create and improve autonomous support platforms using LLMs' directly refers to the development and adaptation of models for specific tasks.",
                    "phrase": "Create and improve autonomous support platforms using LLMs"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'troubleshooting, maintaining, and updating tools based on user feedback and support tickets' implies building and maintaining software systems that incorporate AI functionalities.",
                    "phrase": "troubleshooting, maintaining, and updating tools based on user feedback and support tickets"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'creating an assistant able to guide customers through an upgrade process' describes the development of a specific AI-powered application.",
                    "phrase": "creating an assistant able to guide customers through an upgrade process"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Test and integrate state-of-the-art AI technologies' refers to the process of evaluating and incorporating AI models.",
                    "phrase": "Test and integrate state-of-the-art AI technologies"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'providing support and guidance for internal teams on how to best utilize these technologies within their workflows' indicates understanding business needs and aligning technical solutions.",
                    "phrase": "providing support and guidance for internal teams on how to best utilize these technologies within their workflows"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'Evaluate and enhance the performance and integration of AI solutions' directly relates to improving and optimizing AI models.",
                    "phrase": "Evaluate and enhance the performance and integration of AI solutions"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction' points to operational aspects of deployed AI solutions.",
                    "phrase": "ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction"
                },
                {
                    "category": "TASK1",
                    "justification": "The phrase 'significantly boosting the company's innovation capacity and service quality' highlights the alignment of technical work with business objectives.",
                    "phrase": "significantly boosting the company's innovation capacity and service quality"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "providing support and guidance for internal teams"
                },
                {
                    "category": "SKILL3",
                    "phrase": "troubleshooting"
                },
                {
                    "category": "SKILL5",
                    "phrase": "improve support"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "LLMs"
                },
                {
                    "category": "TECH3",
                    "phrase": "GPT-4 Vision"
                },
                {
                    "category": "TECH2",
                    "phrase": "Amazon CodeWhisperer"
                },
                {
                    "category": "TECH2",
                    "phrase": "AWS"
                }
            ]
        }
    }
}