{
    "job_id": 1191,
    "job_details": {
        "job_id": 1191,
        "Organisatienaam": "EXIN",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Exam Developer",
        "Standplaats": "Utrecht",
        "Vacaturelink (origineel)": "jobsonline.nl",
        "Contactpersoon": "Monteur Buitendienst",
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Software engineer (m/v/x)",
        "Opleidingsniveau": "HBO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "As an Exam Developer, you coordinate all the activities related to developing new exams, translating existing exams to several different languages, updating the exams to current standards during maintenance, and implementing exam products in the various systems. In addition, you review the quality of the exams through item and test analysis. You work on all exams that form part of EXIN's certification portfolio.\n\n   Importantly, you will collaborate closely with the Exam Developers to integrate generative AI solutions into our processes. You can translate internal guidelines into machine learning algorithms while maintaining legal, qualitative and ethical compliance in the outcomes. You stay up to date with the latest research and developments in the field of AI and machine learning.\n\n   Where you come in\n\n   You are part of a committed team of Exam Developers, working in close cooperation with the Product Owner who ensures that the products in EXIN's certification portfolio are aligned with the needs of the market. You coordinate work with the Exam Developers and with small groups of international subject matter experts or third parties., * Coordinating work with subject matter experts and cooperating with third parties in creating, localizing, implementing and maintaining exam products\n     * Ensuring that deliverables are in line with high-quality standards, are within budget, and delivered on time\n     * (Co)developing and improving exam products in line with guidelines for educational measurement\n     * Testing exam products (exams and corresponding materials) for the other team members\n     * Independently writing and maintaining machine learning algorithms complying with standards, best practices and company policies\n     * Supporting our Customer Success Center by preparing responses to customer questions on the content of the exams\n     * Detecting (using test analysis) and resolving issues related to the exam products, and performing root cause analyses to take corrective actions\n     * Keeping your knowledge in the domain up-to-date\n     * Representing EXIN through attending (online) events",
        "Datum gevonden": "2024-08-02",
        "Beroepsgroep": "Programmeurs",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Parttime / Fulltime",
        "Branche": "Onderwijs / Onderzoek",
        "Organisatiegrootte": "200-499",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "Exam Developer\n\nAs an Exam Developer, you coordinate all the activities related to developing new exams, translating existing exams to several different languages, updating the exams to current standards during maintenance, and implementing exam products in the various systems. In addition, you review the quality of the exams through item and test analysis. You work on all exams that form part of EXIN's certification portfolio.\n\n   Importantly, you will collaborate closely with the Exam Developers to integrate generative AI solutions into our processes. You can translate internal guidelines into machine learning algorithms while maintaining legal, qualitative and ethical compliance in the outcomes. You stay up to date with the latest research and developments in the field of AI and machine learning.\n\n   Where you come in\n\n   You are part of a committed team of Exam Developers, working in close cooperation with the Product Owner who ensures that the products in EXIN's certification portfolio are aligned with the needs of the market. You coordinate work with the Exam Developers and with small groups of international subject matter experts or third parties., * Coordinating work with subject matter experts and cooperating with third parties in creating, localizing, implementing and maintaining exam products\n     * Ensuring that deliverables are in line with high-quality standards, are within budget, and delivered on time\n     * (Co)developing and improving exam products in line with guidelines for educational measurement\n     * Testing exam products (exams and corresponding materials) for the other team members\n     * Independently writing and maintaining machine learning algorithms complying with standards, best practices and company policies\n     * Supporting our Customer Success Center by preparing responses to customer questions on the content of the exams\n     * Detecting (using test analysis) and resolving issues related to the exam products, and performing root cause analyses to take corrective actions\n     * Keeping your knowledge in the domain up-to-date\n     * Representing EXIN through attending (online) events"
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous / Not Relevant",
            "confidence_score": 2,
            "rationale": "The job description focuses heavily on exam development, localization, and quality assurance, with only a tangential mention of integrating generative AI. The core responsibilities do not align with the specialized tasks of an ML or GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task_name": "Business Understanding",
                    "phrases": [
                        {
                            "phrase": "align technical solutions with strategic goals",
                            "justification": "This phrase directly relates to understanding the broader business context and ensuring technical work supports strategic objectives."
                        },
                        {
                            "phrase": "aligned with the needs of the market",
                            "justification": "This indicates a need to understand market demands and translate them into product requirements."
                        },
                        {
                            "phrase": "translate internal guidelines into machine learning algorithms",
                            "justification": "This involves understanding business or internal rules and converting them into a technical specification."
                        }
                    ]
                },
                {
                    "task_name": "Data Engineering",
                    "phrases": []
                },
                {
                    "task_name": "Modeling",
                    "phrases": [
                        {
                            "phrase": "translate existing exams to several different languages",
                            "justification": "While not traditional ML modeling, this involves transforming content from one format (language) to another, which can be seen as a form of data transformation."
                        },
                        {
                            "phrase": "implementing exam products in the various systems",
                            "justification": "This involves integrating exam content into systems, which can involve data structuring and processing."
                        },
                        {
                            "phrase": "review the quality of the exams through item and test analysis",
                            "justification": "Item and test analysis are statistical methods used to evaluate the performance of assessment items, which is a form of model evaluation."
                        },
                        {
                            "phrase": "integrate generative AI solutions into our processes",
                            "justification": "This directly points to the use and integration of generative AI models."
                        },
                        {
                            "phrase": "machine learning algorithms",
                            "justification": "This explicitly mentions the development or use of machine learning algorithms."
                        },
                        {
                            "phrase": "maintaining legal, qualitative and ethical compliance in the outcomes",
                            "justification": "This involves ensuring the outputs of models meet specific standards and constraints."
                        },
                        {
                            "phrase": "Developing and improving exam products in line with guidelines for educational measurement",
                            "justification": "This involves creating and refining products based on specific measurement principles, which can involve algorithmic approaches."
                        },
                        {
                            "phrase": "Testing exam products (exams and corresponding materials) for the other team members",
                            "justification": "This involves evaluating the quality and performance of the exam products, akin to model testing."
                        },
                        {
                            "phrase": "Independently writing and maintaining machine learning algorithms",
                            "justification": "This is a direct statement about developing and managing ML algorithms."
                        },
                        {
                            "phrase": "Detecting (using test analysis) and resolving issues related to the exam products, and performing root cause analyses",
                            "justification": "Test analysis is a statistical method for evaluating exam quality, and root cause analysis is a problem-solving technique often applied to model performance issues."
                        }
                    ]
                },
                {
                    "task_name": "Software Development",
                    "phrases": [
                        {
                            "phrase": "implementing exam products in the various systems",
                            "justification": "This involves integrating exam content into existing software systems, requiring software development skills."
                        },
                        {
                            "phrase": "building backend services",
                            "justification": "Implied by the need to implement products in systems and maintain algorithms."
                        }
                    ]
                },
                {
                    "task_name": "Operations Engineering (MLOps)",
                    "phrases": [
                        {
                            "phrase": "maintaining machine learning algorithms",
                            "justification": "This implies ongoing management and upkeep of algorithms in a production or semi-production environment."
                        },
                        {
                            "phrase": "resolving issues related to the exam products",
                            "justification": "This involves troubleshooting and fixing problems, which is a core part of operations."
                        }
                    ]
                }
            ],
            "technologies": [
                {
                    "tech_name": "generative AI",
                    "category": "TECH3: LLM / Generative Models"
                },
                {
                    "tech_name": "machine learning algorithms",
                    "category": "TECH10: Data Modeling"
                }
            ],
            "soft_skills": [
                {
                    "skill_name": "Communication & Collaboration",
                    "phrases": [
                        {
                            "phrase": "collaborate closely with the Exam Developers",
                            "justification": "Directly indicates the need for teamwork and interaction with colleagues."
                        },
                        {
                            "phrase": "working in close cooperation with the Product Owner",
                            "justification": "Highlights the importance of collaboration with product management."
                        },
                        {
                            "phrase": "coordinate work with the Exam Developers and with small groups of international subject matter experts or third parties",
                            "justification": "Emphasizes coordination and communication across different groups and international stakeholders."
                        },
                        {
                            "phrase": "Coordinating work with subject matter experts and cooperating with third parties",
                            "justification": "Reinforces the need for strong coordination and cooperation skills with external parties."
                        },
                        {
                            "phrase": "Supporting our Customer Success Center by preparing responses to customer questions",
                            "justification": "Requires clear communication to explain exam content to customers."
                        },
                        {
                            "phrase": "Representing EXIN through attending (online) events",
                            "justification": "Implies communication and representation skills in external forums."
                        }
                    ]
                },
                {
                    "skill_name": "Learning & Adaptability",
                    "phrases": [
                        {
                            "phrase": "Stay up to date with the latest research and developments in the field of AI and machine learning",
                            "justification": "Directly states the need for continuous learning in a rapidly evolving field."
                        },
                        {
                            "phrase": "Keeping your knowledge in the domain up-to-date",
                            "justification": "Indicates a requirement to stay current with knowledge in the relevant domain."
                        }
                    ]
                },
                {
                    "skill_name": "Problem Solving & Pragmatism",
                    "phrases": [
                        {
                            "phrase": "review the quality of the exams through item and test analysis",
                            "justification": "Involves analytical skills to assess and improve exam quality."
                        },
                        {
                            "phrase": "Detecting (using test analysis) and resolving issues related to the exam products, and performing root cause analyses to take corrective actions",
                            "justification": "Highlights the ability to identify, diagnose, and fix problems."
                        },
                        {
                            "phrase": "(Co)developing and improving exam products",
                            "justification": "Suggests an iterative approach to problem-solving and product enhancement."
                        }
                    ]
                },
                {
                    "skill_name": "Ethical & Legal Responsibility",
                    "phrases": [
                        {
                            "phrase": "maintaining legal, qualitative and ethical compliance in the outcomes",
                            "justification": "Directly addresses the need to adhere to legal, qualitative, and ethical standards."
                        },
                        {
                            "phrase": "complying with standards, best practices and company policies",
                            "justification": "Indicates adherence to established rules and guidelines."
                        }
                    ]
                },
                {
                    "skill_name": "Innovation & Ownership",
                    "phrases": [
                        {
                            "phrase": "coordinate all the activities related to developing new exams",
                            "justification": "Implies taking responsibility for the exam development process."
                        },
                        {
                            "phrase": "Independently writing and maintaining machine learning algorithms",
                            "justification": "Suggests autonomy and taking ownership of the algorithm development lifecycle."
                        },
                        {
                            "phrase": "Ensuring that deliverables are in line with high-quality standards, are within budget, and delivered on time",
                            "justification": "Demonstrates a focus on quality, efficiency, and timely delivery, indicating ownership."
                        }
                    ]
                }
            ]
        }
    }
}