{
    "job_id": 358,
    "job_details": {
        "job_id": 358,
        "Organisatienaam": "Stedin Netbeheer B.V.",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Developer Digitale Innovatie",
        "Standplaats": "Rotterdam",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Beleidsmedewerker milieuzaken (m/v/x)",
        "Opleidingsniveau": "WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Door de energietransitie neemt ons werk toe. Daarom willen we ons werk verslimmen en versnellen door het onderzoeken van, experimenteren met en opschalen van Digitale Innovaties. Onze focus ligt op praktisch experimenteren met digitale technologieën die binnen 1-2 jaar implementeerbaar zijn. Daarbij gebruiken we verschillende vehicles, zoals software, fysieke robots, mixed reality en drones. We focussen daarbij onder andere op AI Agents, Edge Computing, Spatial Computing en Digital Twins.\n\n   Als Developer heb je een boeiende en cruciale rol in ons team. Elke dag brengt nieuwe uitdagingen, maar er zijn enkele kernactiviteiten die consistent terugkomen in deze functie. Je werkt samen met (een deel van) het team aan verschillende projecten binnen onze funnel. Hierbij ben je, alleen of in samenwerking met een andere Developer, verantwoordelijk voor het ontwerpen en ontwikkelen van een Proof of Concept, pilotoplossing en/of eindproduct.\n\n   Tijdens de ontwikkelingsfase houd je rekening met de vastgestelde kaders en de development best practices die binnen ons team en Stedin zijn opgesteld. Dit omvat ook belangrijke aspecten zoals privacy, security en architectuur checks. Je stemt regelmatig af met de Lead Developer, Delivery Manager en andere Developers in het team om gezamenlijk tot de beste oplossing te komen.\n\n   Gedurende sessies met de business (het team of de afdeling waarvoor we de oplossing ontwikkelen) koppel je de voortgang terug en bepaal je de vervolgstappen samen met de Delivery Manager. Daarnaast vind je het leuk om op de hoogte te blijven van de nieuwste trends en ontwikkelingen in technologie, en deze kennis toe te passen in projecten. Je hebt ook de vrijheid om zelf nieuwe kansen binnen het bedrijf te verkennen.\n\n   Tot slot is onze afdeling het afgelopen jaar gegroeid van drie naar elf collega's, en deze groeiambitie zal zich voortzetten. We waarderen jouw input bij het vormgeven van onze processen en portfolio. Het is belangrijk dat je graag meedenkt over deze zaken, kunt functioneren in een veranderende werkomgeving en plezier hebt in het werken met een divers productportfolio.\n\n   Als Developer heb je niet alleen een heel leuke, maar ook een belangrijke en leerzame functie in ons team. Elke dag is anders, maar de volgende werkzaamheden komen in elk geval terug in de rol:\n\n   Je werkt samen met (een deel van) het team aan de verschillende projecten in onze funnel. Hier ben je alleen of samen met een andere Developer verantwoordelijk voor het ontwerpen en ontwikkelen van een Proof of Concept, pilot oplossing en/of eindproduct.\n\n   Tijdens het ontwikkelen hou je rekening met de juiste kaders en de development best practices die we als team en Stedin hebben opgesteld. Hierbij kan je ook denken aan de juiste privacy, security of architectuur checks.\n\n   Je stemt regelmatig af met de lead Developer, delivery manager en de andere Developers in het team om samen tot de beste oplossing te komen. Tijdens sessies met de business (het team/de afdeling waar we de oplossing voor ontwikkelen) koppel je de ontwikkelingen terug en stem je de juiste vervolgstappen af. Dit doe je samen met de delivery manager. Ook vind je het leuk om op de hoogte te zijn van de nieuwste trends en ontwikkelingen in de technologie en deze kennis toe te passen in projecten. Hierbij kun je ook zelf op zoek gaan naar nieuwe kansen binnen het bedrijf.\n\n   En tot slot: het afgelopen jaar is de afdeling gegroeid van 3 naar 11 collega's. Die groeiambitie gaat de komende tijd nog door en we waarderen jouw ideeën in het vormgeven van onze processen en portfolio. Daarom is het fijn als je graag meedenkt over dat soort zaken, kan werken in een veranderende werkomgeving en het leuk vindt om je bezig te houden met een heel divers product portfolio.\n\n   \"Als Digitale Innovatie team werken we er elke dag aan om digitale technologieën aan de grondslag te leggen van de energietransitie. Het is heel bijzonder om elke dag te zien hoe je daaraan bijdraagt en hoe we samen als team hele mooie oplossingen neerzetten. Daarnaast groeien we ontzettend en is het hartstikke leerzaam om een steentje bij te dragen aan het vormgeven van onze nieuwe werkprocessen.\" - Maira van Andel, Delivery Manager Digitale Innovatie.\n\nVolgens ons Stedin@Work concept werk je 50% thuis en 50% op kantoor, wel zo flexibel. Wij zorgen voor jouw thuiswerkfaciliteiten, een thuiswerkvergoeding en reizen naar kantoor doe je met je OV vrij-abonnement waarmee je ook buiten werk onbeperkt kan reizen!",
        "Datum gevonden": "2025-03-04",
        "Beroepsgroep": "Beleidsmedewerkers",
        "Beroepsklasse": "Beleid en bestuur",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Nutsvoorzieningen",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 3,
        "full_text": "Developer Digitale Innovatie\n\nDoor de energietransitie neemt ons werk toe. Daarom willen we ons werk verslimmen en versnellen door het onderzoeken van, experimenteren met en opschalen van Digitale Innovaties. Onze focus ligt op praktisch experimenteren met digitale technologieën die binnen 1-2 jaar implementeerbaar zijn. Daarbij gebruiken we verschillende vehicles, zoals software, fysieke robots, mixed reality en drones. We focussen daarbij onder andere op AI Agents, Edge Computing, Spatial Computing en Digital Twins.\n\n   Als Developer heb je een boeiende en cruciale rol in ons team. Elke dag brengt nieuwe uitdagingen, maar er zijn enkele kernactiviteiten die consistent terugkomen in deze functie. Je werkt samen met (een deel van) het team aan verschillende projecten binnen onze funnel. Hierbij ben je, alleen of in samenwerking met een andere Developer, verantwoordelijk voor het ontwerpen en ontwikkelen van een Proof of Concept, pilotoplossing en/of eindproduct.\n\n   Tijdens de ontwikkelingsfase houd je rekening met de vastgestelde kaders en de development best practices die binnen ons team en Stedin zijn opgesteld. Dit omvat ook belangrijke aspecten zoals privacy, security en architectuur checks. Je stemt regelmatig af met de Lead Developer, Delivery Manager en andere Developers in het team om gezamenlijk tot de beste oplossing te komen.\n\n   Gedurende sessies met de business (het team of de afdeling waarvoor we de oplossing ontwikkelen) koppel je de voortgang terug en bepaal je de vervolgstappen samen met de Delivery Manager. Daarnaast vind je het leuk om op de hoogte te blijven van de nieuwste trends en ontwikkelingen in technologie, en deze kennis toe te passen in projecten. Je hebt ook de vrijheid om zelf nieuwe kansen binnen het bedrijf te verkennen.\n\n   Tot slot is onze afdeling het afgelopen jaar gegroeid van drie naar elf collega's, en deze groeiambitie zal zich voortzetten. We waarderen jouw input bij het vormgeven van onze processen en portfolio. Het is belangrijk dat je graag meedenkt over deze zaken, kunt functioneren in een veranderende werkomgeving en plezier hebt in het werken met een divers productportfolio.\n\n   Als Developer heb je niet alleen een heel leuke, maar ook een belangrijke en leerzame functie in ons team. Elke dag is anders, maar de volgende werkzaamheden komen in elk geval terug in de rol:\n\n   Je werkt samen met (een deel van) het team aan de verschillende projecten in onze funnel. Hier ben je alleen of samen met een andere Developer verantwoordelijk voor het ontwerpen en ontwikkelen van een Proof of Concept, pilot oplossing en/of eindproduct.\n\n   Tijdens het ontwikkelen hou je rekening met de juiste kaders en de development best practices die we als team en Stedin hebben opgesteld. Hierbij kan je ook denken aan de juiste privacy, security of architectuur checks.\n\n   Je stemt regelmatig af met de lead Developer, delivery manager en de andere Developers in het team om samen tot de beste oplossing te komen. Tijdens sessies met de business (het team/de afdeling waar we de oplossing voor ontwikkelen) koppel je de ontwikkelingen terug en stem je de juiste vervolgstappen af. Dit doe je samen met de delivery manager. Ook vind je het leuk om op de hoogte te zijn van de nieuwste trends en ontwikkelingen in de technologie en deze kennis toe te passen in projecten. Hierbij kun je ook zelf op zoek gaan naar nieuwe kansen binnen het bedrijf.\n\n   En tot slot: het afgelopen jaar is de afdeling gegroeid van 3 naar 11 collega's. Die groeiambitie gaat de komende tijd nog door en we waarderen jouw ideeën in het vormgeven van onze processen en portfolio. Daarom is het fijn als je graag meedenkt over dat soort zaken, kan werken in een veranderende werkomgeving en het leuk vindt om je bezig te houden met een heel divers product portfolio.\n\n   \"Als Digitale Innovatie team werken we er elke dag aan om digitale technologieën aan de grondslag te leggen van de energietransitie. Het is heel bijzonder om elke dag te zien hoe je daaraan bijdraagt en hoe we samen als team hele mooie oplossingen neerzetten. Daarnaast groeien we ontzettend en is het hartstikke leerzaam om een steentje bij te dragen aan het vormgeven van onze nieuwe werkprocessen.\" - Maira van Andel, Delivery Manager Digitale Innovatie.\n\nVolgens ons Stedin@Work concept werk je 50% thuis en 50% op kantoor, wel zo flexibel. Wij zorgen voor jouw thuiswerkfaciliteiten, een thuiswerkvergoeding en reizen naar kantoor doe je met je OV vrij-abonnement waarmee je ook buiten werk onbeperkt kan reizen!"
    },
    "analysis": {
        "job_profile_classification": {
            "profile": "Ambiguous / Not Relevant",
            "confidence_score": 2,
            "rationale": "The job description focuses heavily on developing digital innovations and proofs of concept using various technologies, including AI agents. However, it lacks specific details about core AI/ML tasks like model training, fine-tuning, or deep data engineering. The emphasis is more on applying existing digital technologies and building solutions rather than specializing in AI model development."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task_category": "TASK1: Business Understanding",
                    "phrases": [
                        "Door de energietransitie neemt ons werk toe.",
                        "ons werk verslimmen en versnellen door het onderzoeken van, experimenteren met en opschalen van Digitale Innovaties.",
                        "Onze focus ligt op praktisch experimenteren met digitale technologieën die binnen 1-2 jaar implementeerbaar zijn.",
                        "Gedurende sessies met de business (het team of de afdeling waarvoor we de oplossing ontwikkelen) koppel je de voortgang terug en bepaal je de vervolgstappen samen met de Delivery Manager.",
                        "Daarnaast vind je het leuk om op de hoogte te blijven van de nieuwste trends en ontwikkelingen in technologie, en deze kennis toe te passen in projecten.",
                        "Je hebt ook de vrijheid om zelf nieuwe kansen binnen het bedrijf te verkennen.",
                        "Het is belangrijk dat je graag meedenkt over deze zaken, kunt functioneren in een veranderende werkomgeving en plezier hebt in het werken met een divers productportfolio.",
                        "Als Digitale Innovatie team werken we er elke dag aan om digitale technologieën aan de grondslag te leggen van de energietransitie.",
                        "Het is heel bijzonder om elke dag te zien hoe je daaraan bijdraagt en hoe we samen als team hele mooie oplossingen neerzetten.",
                        "Daarnaast groeien we ontzettend en is het hartstikke leerzaam om een steentje bij te dragen aan het vormgeven van onze nieuwe werkprocessen."
                    ],
                    "justification": "These phrases highlight understanding the business context (energy transition), aligning technical work with business goals (verslimmen en versnellen, implementeerbaar), translating business needs into technical requirements (sessies met de business), and exploring new opportunities within the company."
                },
                {
                    "task_category": "TASK4: Software Development",
                    "phrases": [
                        "onderzoeken van, experimenteren met en opschalen van Digitale Innovaties.",
                        "Daarbij gebruiken we verschillende vehicles, zoals software, fysieke robots, mixed reality en drones.",
                        "Als Developer heb je een boeiende en cruciale rol in ons team.",
                        "Je werkt samen met (een deel van) het team aan verschillende projecten binnen onze funnel.",
                        "Hierbij ben je, alleen of in samenwerking met een andere Developer, verantwoordelijk voor het ontwerpen en ontwikkelen van een Proof of Concept, pilotoplossing en/of eindproduct.",
                        "Tijdens de ontwikkelingsfase houd je rekening met de vastgestelde kaders en de development best practices die binnen ons team en Stedin zijn opgesteld.",
                        "Dit omvat ook belangrijke aspecten zoals privacy, security en architectuur checks.",
                        "Je stemt regelmatig af met de Lead Developer, Delivery Manager en andere Developers in het team om gezamenlijk tot de beste oplossing te komen.",
                        "Je stemt regelmatig af met de lead Developer, delivery manager en de andere Developers in het team om samen tot de beste oplossing te komen.",
                        "koppelen de voortgang terug en bepaal je de vervolgstappen samen met de Delivery Manager.",
                        "koppelen de ontwikkelingen terug en stem je de juiste vervolgstappen af."
                    ],
                    "justification": "These phrases describe the core activities of designing, developing, and implementing digital innovations, proofs of concept, pilot solutions, and end products. It also mentions adhering to development best practices, privacy, security, and architecture checks, which are all part of software development."
                },
                {
                    "task_category": "TASK3: Modeling",
                    "phrases": [
                        "focussen daarbij onder andere op AI Agents"
                    ],
                    "justification": "The mention of 'AI Agents' directly relates to the development or application of models, which falls under the modeling category, specifically generative techniques."
                },
                {
                    "task_category": "TASK5: Operations Engineering (MLOps)",
                    "phrases": [
                        "opschalen van Digitale Innovaties."
                    ],
                    "justification": "The term 'opschalen' (scaling up) implies moving from a developed concept to a production or operational environment, which is a key aspect of MLOps."
                }
            ],
            "technologies": [
                {
                    "tech_category": "TECH3: LLM / Generative Models",
                    "technologies": [
                        "AI Agents"
                    ]
                },
                {
                    "tech_category": "TECH1: Programming Languages",
                    "technologies": [
                        "software"
                    ]
                }
            ],
            "soft_skills": [
                {
                    "skill_category": "SKILL1: Communication & Collaboration",
                    "skills": [
                        "Je werkt samen met (een deel van) het team",
                        "alleen of in samenwerking met een andere Developer",
                        "Je stemt regelmatig af met de Lead Developer, Delivery Manager en andere Developers in het team",
                        "om gezamenlijk tot de beste oplossing te komen",
                        "Gedurende sessies met de business",
                        "koppelen de voortgang terug",
                        "bepaal je de vervolgstappen samen met de Delivery Manager",
                        "samen met de delivery manager",
                        "samen als team hele mooie oplossingen neerzetten"
                    ]
                },
                {
                    "skill_category": "SKILL2: Learning & Adaptability",
                    "skills": [
                        "onderzoeken van, experimenteren met",
                        "praktisch experimenteren met digitale technologieën",
                        "vind je het leuk om op de hoogte te blijven van de nieuwste trends en ontwikkelingen in technologie",
                        "deze kennis toe te passen in projecten",
                        "zelf nieuwe kansen binnen het bedrijf te verkennen",
                        "kunt functioneren in een veranderende werkomgeving",
                        "het afgelopen jaar is de afdeling gegroeid van 3 naar 11 collega's, die groeiambitie gaat de komende tijd nog door",
                        "hartstikke leerzaam om een steentje bij te dragen aan het vormgeven van onze nieuwe werkprocessen"
                    ]
                },
                {
                    "skill_category": "SKILL3: Problem Solving & Pragmatism",
                    "skills": [
                        "ons werk verslimmen en versnellen",
                        "praktisch experimenteren met digitale technologieën die binnen 1-2 jaar implementeerbaar zijn",
                        "ontwerpen en ontwikkelen van een Proof of Concept, pilotoplossing en/of eindproduct",
                        "vastgestelde kaders en de development best practices",
                        "privacy, security en architectuur checks",
                        "tot de beste oplossing te komen",
                        "nieuwe kansen binnen het bedrijf te verkennen",
                        "meedenkt over deze zaken",
                        "heel divers productportfolio"
                    ]
                },
                {
                    "skill_category": "SKILL5: Innovation & Ownership",
                    "skills": [
                        "onderzoeken van, experimenteren met en opschalen van Digitale Innovaties.",
                        "zelf nieuwe kansen binnen het bedrijf te verkennen.",
                        "input bij het vormgeven van onze processen en portfolio.",
                        "graag meedenkt over deze zaken"
                    ]
                }
            ]
        }
    }
}