{
    "job_id": 292,
    "job_details": {
        "job_id": 292,
        "Organisatienaam": "Mozilla",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Engineer",
        "Standplaats": null,
        "Vacaturelink (origineel)": "nlppeople.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "The Firefox team is a community of engineers who care deeply about delivering the fastest, friendliest, most usable browser possible. We are responsible for making the things you see in the browser work securely, quickly, and well! We are looking for a Staff Machine Learning Engineer to help us develop and grow new Generative AI driven products and tools. You will play a key role in enabling safe and healthy machine learning and Generative AI driven experiences in Firefox., A Staff Engineer is the next level from a Senior Engineer. At Mozilla this role can vary but typically a Staff Engineer is a domain expert who leads others within a single team to tackle multi-month projects. Tasks that may be initially ambiguous or require significant planning and require them to influence or direct the work of several engineers. They sequence deliverables and manage risks in their team's projects, provide feedback on our strategy and goals affecting the team, and turn our strategy into action for their team members. Staff Engineers mentor others by stewarding some responsibilities to more junior and senior engineers so they can take on new ones. They collaborate with management on building team consensus and providing direction. Staff Engineers identify gaps and opportunities for improvement to enable a culture of inclusion and allyship, at all levels of the organization.\n\n   What You'll Do\n\n   Lead the design, development, and integration of Generative AI solutions in Firefox, collaborating cross functionally with product management, full stack engineering and design.\n   Build infrastructure for training and inference of LLMs and small language and vision models for use cases on the web and mobile Firefox product experiences.\n   Implement robust validation and testing procedures to ensure the developed models' generalizability and reliability\n   Continuously monitor and optimize deployed models for performance and efficiency",
        "Datum gevonden": "2025-02-05",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Engineer\n\nThe Firefox team is a community of engineers who care deeply about delivering the fastest, friendliest, most usable browser possible. We are responsible for making the things you see in the browser work securely, quickly, and well! We are looking for a Staff Machine Learning Engineer to help us develop and grow new Generative AI driven products and tools. You will play a key role in enabling safe and healthy machine learning and Generative AI driven experiences in Firefox., A Staff Engineer is the next level from a Senior Engineer. At Mozilla this role can vary but typically a Staff Engineer is a domain expert who leads others within a single team to tackle multi-month projects. Tasks that may be initially ambiguous or require significant planning and require them to influence or direct the work of several engineers. They sequence deliverables and manage risks in their team's projects, provide feedback on our strategy and goals affecting the team, and turn our strategy into action for their team members. Staff Engineers mentor others by stewarding some responsibilities to more junior and senior engineers so they can take on new ones. They collaborate with management on building team consensus and providing direction. Staff Engineers identify gaps and opportunities for improvement to enable a culture of inclusion and allyship, at all levels of the organization.\n\n   What You'll Do\n\n   Lead the design, development, and integration of Generative AI solutions in Firefox, collaborating cross functionally with product management, full stack engineering and design.\n   Build infrastructure for training and inference of LLMs and small language and vision models for use cases on the web and mobile Firefox product experiences.\n   Implement robust validation and testing procedures to ensure the developed models' generalizability and reliability\n   Continuously monitor and optimize deployed models for performance and efficiency"
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "rationale": "The job description explicitly mentions developing and growing new Generative AI driven products and tools, leading the design, development, and integration of Generative AI solutions, and building infrastructure for training and inference of LLMs and small language and vision models. This aligns directly with the definition and core responsibilities of a GenAI Engineer, particularly the focus on generative techniques and building user-facing applications."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "justification": "The phrase 'develop and grow new Generative AI driven products and tools' and 'training and inference of LLMs and small language and vision models' directly relates to the creation and adaptation of generative models.",
                    "phrase": "develop and grow new Generative AI driven products and tools"
                },
                {
                    "category": "TASK3",
                    "justification": "The phrase 'training and inference of LLMs and small language and vision models' explicitly refers to the core activities of working with generative models.",
                    "phrase": "training and inference of LLMs and small language and vision models"
                },
                {
                    "category": "TASK4",
                    "justification": "The phrase 'Lead the design, development, and integration of Generative AI solutions in Firefox' indicates building and integrating AI features into a product.",
                    "phrase": "Lead the design, development, and integration of Generative AI solutions in Firefox"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'Implement robust validation and testing procedures to ensure the developed models' generalizability and reliability' and 'Continuously monitor and optimize deployed models for performance and efficiency' describe the operational aspects of managing models in production.",
                    "phrase": "Implement robust validation and testing procedures to ensure the developed models' generalizability and reliability"
                },
                {
                    "category": "TASK5",
                    "justification": "The phrase 'Continuously monitor and optimize deployed models for performance and efficiency' directly relates to the ongoing management and maintenance of models in a production environment.",
                    "phrase": "Continuously monitor and optimize deployed models for performance and efficiency"
                },
                {
                    "category": "TASK1",
                    "justification": "The description of a Staff Engineer as a 'domain expert who leads others within a single team to tackle multi-month projects' and 'influence or direct the work of several engineers' points to understanding the broader technical strategy and guiding its implementation.",
                    "phrase": "domain expert who leads others within a single team to tackle multi-month projects"
                },
                {
                    "category": "SKILL1",
                    "justification": "The phrase 'collaborating cross functionally with product management, full stack engineering and design' highlights the need for effective communication and teamwork with different departments.",
                    "phrase": "collaborating cross functionally with product management, full stack engineering and design"
                },
                {
                    "category": "SKILL3",
                    "justification": "The description of a Staff Engineer's role in handling 'ambiguous or require significant planning' and 'sequence deliverables and manage risks' points to strong problem-solving and strategic planning abilities.",
                    "phrase": "ambiguous or require significant planning"
                },
                {
                    "category": "SKILL5",
                    "justification": "The description of a Staff Engineer as a 'domain expert who leads others' and 'influence or direct the work of several engineers' suggests a role with significant ownership and leadership.",
                    "phrase": "domain expert who leads others"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL1",
                    "phrase": "collaborating cross functionally with product management, full stack engineering and design"
                },
                {
                    "category": "SKILL3",
                    "phrase": "ambiguous or require significant planning"
                },
                {
                    "category": "SKILL5",
                    "phrase": "domain expert who leads others"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "phrase": "Generative AI"
                },
                {
                    "category": "TECH3",
                    "phrase": "LLMs"
                },
                {
                    "category": "TECH3",
                    "phrase": "small language and vision models"
                }
            ]
        }
    }
}