{
    "job_id": 841,
    "job_details": {
        "job_id": 841,
        "Organisatienaam": "Booking.com",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Machine Learning Engineer II - Recommendation Applications ML (Marketplace)",
        "Standplaats": "Amsterdam",
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Machine learning engineer (m/v/x)",
        "Opleidingsniveau": "WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "This role is based in Amsterdam. Booking.com's Marketplace Department turns travel goals into travel realities. Our purpose? To create frictionless experiences at each and every stage of the trip. From browsing to booking and beyond, our focus is on building the connected experiences which make journeys smoother, faster and more enjoyable. Think of us as travel matchmakers, ensuring seamless integration across our product verticals to effortlessly and intuitively connect traveler preferences and actions.\n\n   The Recommendation Applications ML team is dedicated to enhancing the overall customer experience and user journey. The team's mission is to be the centralized hub for all machine learning (ML) recommendation initiatives, providing scalable, reusable, state-of-the-art ML models. These models aim to increase relevance and personalization, enabling customers to be context-aware and make quicker, more informed decisions. Our team supports the vision of making travelers feel understood and assisted in every step of the travel booking journey.\n\n   In 2025, we are planning to focus on expanding and optimizing our recommendation systems, for example by improving personalization and leveraging GenAI to build fine-tuned models for more relevant recommendations.\n\n   As a Machine Learning Engineer II, you will be responsible for developing production-grade Machine Learning systems, from models to features and pipelines. You will own the design and delivery of ML systems, from initial idea generation and collecting business requirements from product stakeholders to implementation. You will work closely together with the other Machine Learning Scientists and Machine Learning Engineers in the Intent Discovery track as well as with Data Engineers, Software Engineers and Product Managers., * Develop production-grade ML systems, from models to features and pipelines, accounting for reliability, scalability, real-time requirements, monitoring, and retraining.\n     * Build readable and reusable code, applying code quality best practices and using standard libraries. Choose the right technology or coding methodology and refactor and simplify code when necessary.\n     * Take full ownership of services end-to-end by actively monitoring system health, performance, and business impact. Ensure the relevant service level objectives (SLOs) are met.\n     * Combine innovation with reuse by abstracting ML/AI concepts from one application to a generalized framework, including leveraging published research, open-source technologies, and previously-developed products at Booking.\n     * Be responsible for business-related data governance processes, technical implementation, and maintenance of data processing services and storage systems, as well as ML governance processes.\n     * Evaluate possible architecture solutions considering business and technology requirements.\n     * Contribute to the internal ML/AI community by sharing knowledge and participating in internal ML programs.\n     * Continuously evolve your craft by keeping up to date with the latest developments in ML/AI and related technologies and upskilling as needed.",
        "Datum gevonden": "2025-01-30",
        "Beroepsgroep": "IT R&D Professionals",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "ICT",
        "Organisatiegrootte": "1000+",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 1,
        "full_text": "Machine Learning Engineer II - Recommendation Applications ML (Marketplace)\n\nThis role is based in Amsterdam. Booking.com's Marketplace Department turns travel goals into travel realities. Our purpose? To create frictionless experiences at each and every stage of the trip. From browsing to booking and beyond, our focus is on building the connected experiences which make journeys smoother, faster and more enjoyable. Think of us as travel matchmakers, ensuring seamless integration across our product verticals to effortlessly and intuitively connect traveler preferences and actions.\n\n   The Recommendation Applications ML team is dedicated to enhancing the overall customer experience and user journey. The team's mission is to be the centralized hub for all machine learning (ML) recommendation initiatives, providing scalable, reusable, state-of-the-art ML models. These models aim to increase relevance and personalization, enabling customers to be context-aware and make quicker, more informed decisions. Our team supports the vision of making travelers feel understood and assisted in every step of the travel booking journey.\n\n   In 2025, we are planning to focus on expanding and optimizing our recommendation systems, for example by improving personalization and leveraging GenAI to build fine-tuned models for more relevant recommendations.\n\n   As a Machine Learning Engineer II, you will be responsible for developing production-grade Machine Learning systems, from models to features and pipelines. You will own the design and delivery of ML systems, from initial idea generation and collecting business requirements from product stakeholders to implementation. You will work closely together with the other Machine Learning Scientists and Machine Learning Engineers in the Intent Discovery track as well as with Data Engineers, Software Engineers and Product Managers., * Develop production-grade ML systems, from models to features and pipelines, accounting for reliability, scalability, real-time requirements, monitoring, and retraining.\n     * Build readable and reusable code, applying code quality best practices and using standard libraries. Choose the right technology or coding methodology and refactor and simplify code when necessary.\n     * Take full ownership of services end-to-end by actively monitoring system health, performance, and business impact. Ensure the relevant service level objectives (SLOs) are met.\n     * Combine innovation with reuse by abstracting ML/AI concepts from one application to a generalized framework, including leveraging published research, open-source technologies, and previously-developed products at Booking.\n     * Be responsible for business-related data governance processes, technical implementation, and maintenance of data processing services and storage systems, as well as ML governance processes.\n     * Evaluate possible architecture solutions considering business and technology requirements.\n     * Contribute to the internal ML/AI community by sharing knowledge and participating in internal ML programs.\n     * Continuously evolve your craft by keeping up to date with the latest developments in ML/AI and related technologies and upskilling as needed."
    },
    "analysis": {
        "profile_classification": {
            "profile": "ML Engineer",
            "confidence_score": 4,
            "rationale": "The role heavily emphasizes developing and productionizing ML systems, including data pipelines, model training, and MLOps. While GenAI is mentioned for future expansion, the core responsibilities and technologies align more closely with a traditional ML Engineer focused on recommendation systems."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task": "TASK1: Business Understanding",
                    "evidence": [
                        {
                            "phrase": "collecting business requirements from product stakeholders",
                            "justification": "This phrase directly indicates the need to understand and translate business needs into technical requirements for ML systems."
                        },
                        {
                            "phrase": "Evaluate possible architecture solutions considering business and technology requirements",
                            "justification": "This highlights the need to align technical solutions with business objectives and constraints."
                        },
                        {
                            "phrase": "contribute to the vision of making travelers feel understood and assisted in every step of the travel booking journey",
                            "justification": "This describes the overarching business goal that the ML systems are intended to support."
                        }
                    ]
                },
                {
                    "task": "TASK2: Data Engineering",
                    "evidence": [
                        {
                            "phrase": "from models to features and pipelines",
                            "justification": "This implies involvement in building and maintaining data pipelines necessary for ML models."
                        },
                        {
                            "phrase": "Be responsible for business-related data governance processes, technical implementation, and maintenance of data processing services and storage systems",
                            "justification": "This explicitly mentions responsibilities related to data processing services and storage systems, which are core to data engineering."
                        }
                    ]
                },
                {
                    "task": "TASK3: Modeling",
                    "evidence": [
                        {
                            "phrase": "Recommendation Applications ML team",
                            "justification": "The team's focus is on recommendation systems, which are a type of ML model."
                        },
                        {
                            "phrase": "centralized hub for all machine learning (ML) recommendation initiatives, providing scalable, reusable, state-of-the-art ML models",
                            "justification": "This directly states the team's purpose is to develop and provide ML models."
                        },
                        {
                            "phrase": "expanding and optimizing our recommendation systems, for example by improving personalization and leveraging GenAI to build fine-tuned models for more relevant recommendations",
                            "justification": "This indicates the core activity of developing, fine-tuning, and optimizing ML models, including generative ones."
                        },
                        {
                            "phrase": "Develop production-grade Machine Learning systems, from models to features and pipelines",
                            "justification": "This is a direct statement about developing ML models as part of production systems."
                        },
                        {
                            "phrase": "abstracting ML/AI concepts from one application to a generalized framework",
                            "justification": "This implies the creation and adaptation of ML/AI models and concepts."
                        }
                    ]
                },
                {
                    "task": "TASK4: Software Development",
                    "evidence": [
                        {
                            "phrase": "Develop production-grade Machine Learning systems, from models to features and pipelines",
                            "justification": "This involves building robust, production-ready systems that integrate ML components."
                        },
                        {
                            "phrase": "Build readable and reusable code, applying code quality best practices and using standard libraries.",
                            "justification": "This is a fundamental software development practice."
                        },
                        {
                            "phrase": "Choose the right technology or coding methodology and refactor and simplify code when necessary.",
                            "justification": "This describes software engineering decision-making and code maintenance."
                        },
                        {
                            "phrase": "Take full ownership of services end-to-end",
                            "justification": "This implies responsibility for the entire software service lifecycle."
                        },
                        {
                            "phrase": "building the connected experiences which make journeys smoother, faster and more enjoyable",
                            "justification": "This describes the user-facing application aspect that ML systems will be integrated into."
                        }
                    ]
                },
                {
                    "task": "TASK5: Operations Engineering (MLOps)",
                    "evidence": [
                        {
                            "phrase": "Develop production-grade Machine Learning systems, from models to features and pipelines, accounting for reliability, scalability, real-time requirements, monitoring, and retraining.",
                            "justification": "This covers key MLOps aspects like reliability, scalability, monitoring, and retraining of production ML systems."
                        },
                        {
                            "phrase": "Take full ownership of services end-to-end by actively monitoring system health, performance, and business impact. Ensure the relevant service level objectives (SLOs) are met.",
                            "justification": "This directly relates to monitoring, performance, and meeting SLOs, which are critical MLOps functions."
                        },
                        {
                            "phrase": "technical implementation, and maintenance of data processing services and storage systems, as well as ML governance processes.",
                            "justification": "Maintenance of data processing services and ML governance are key MLOps responsibilities."
                        }
                    ]
                }
            ],
            "technologies": [
                {
                    "tech": "TECH1: Programming Languages",
                    "evidence": [
                        {
                            "phrase": "Build readable and reusable code",
                            "justification": "Implies the use of programming languages, though specific ones are not named."
                        }
                    ]
                },
                {
                    "tech": "TECH3: LLM / Generative Models",
                    "evidence": [
                        {
                            "phrase": "leveraging GenAI to build fine-tuned models for more relevant recommendations",
                            "justification": "Explicitly mentions Generative AI (GenAI) and fine-tuning models."
                        }
                    ]
                },
                {
                    "tech": "TECH4: LLM Frameworks & Libraries",
                    "evidence": [
                        {
                            "phrase": "leveraging published research, open-source technologies",
                            "justification": "Suggests the use of libraries and frameworks common in ML/AI research and development."
                        }
                    ]
                },
                {
                    "tech": "TECH6: MLOps & Data Pipelines",
                    "evidence": [
                        {
                            "phrase": "pipelines",
                            "justification": "Refers to data and ML pipelines, a core component of MLOps."
                        },
                        {
                            "phrase": "monitoring, and retraining",
                            "justification": "These are essential MLOps activities."
                        },
                        {
                            "phrase": "ML governance processes",
                            "justification": "ML governance is a key aspect of MLOps."
                        }
                    ]
                },
                {
                    "tech": "TECH10: Data Modeling",
                    "evidence": [
                        {
                            "phrase": "Machine Learning (ML) recommendation initiatives, providing scalable, reusable, state-of-the-art ML models",
                            "justification": "This refers to the core activity of building and training ML models, which involves data modeling."
                        },
                        {
                            "phrase": "fine-tuned models",
                            "justification": "Indicates model adaptation and training, a part of data modeling."
                        }
                    ]
                },
                {
                    "tech": "TECH11: Data Analysis",
                    "evidence": [
                        {
                            "phrase": "improving personalization",
                            "justification": "Personalization often involves analyzing user data to tailor recommendations."
                        }
                    ]
                }
            ],
            "soft_skills": [
                {
                    "skill": "SKILL1: Communication & Collaboration",
                    "evidence": [
                        {
                            "phrase": "work closely together with the other Machine Learning Scientists and Machine Learning Engineers in the Intent Discovery track as well as with Data Engineers, Software Engineers and Product Managers.",
                            "justification": "Highlights the need to collaborate with various technical and product teams."
                        },
                        {
                            "phrase": "collecting business requirements from product stakeholders",
                            "justification": "Requires communication to gather needs from non-technical stakeholders."
                        },
                        {
                            "phrase": "Contribute to the internal ML/AI community by sharing knowledge",
                            "justification": "Implies sharing knowledge and collaborating within the organization."
                        }
                    ]
                },
                {
                    "skill": "SKILL2: Learning & Adaptability",
                    "evidence": [
                        {
                            "phrase": "Continuously evolve your craft by keeping up to date with the latest developments in ML/AI and related technologies and upskilling as needed.",
                            "justification": "Directly states the need for continuous learning and adaptation to new technologies."
                        },
                        {
                            "phrase": "leveraging GenAI to build fine-tuned models",
                            "justification": "Suggests adapting to and utilizing newer technologies like GenAI."
                        }
                    ]
                },
                {
                    "skill": "SKILL3: Problem Solving & Pragmatism",
                    "evidence": [
                        {
                            "phrase": "Develop production-grade Machine Learning systems, from models to features and pipelines, accounting for reliability, scalability, real-time requirements, monitoring, and retraining.",
                            "justification": "This requires solving complex engineering challenges to ensure system performance and reliability."
                        },
                        {
                            "phrase": "Evaluate possible architecture solutions considering business and technology requirements.",
                            "justification": "Involves analyzing options and making pragmatic choices based on requirements."
                        },
                        {
                            "phrase": "refactor and simplify code when necessary.",
                            "justification": "Demonstrates a pragmatic approach to code quality and maintainability."
                        }
                    ]
                },
                {
                    "skill": "SKILL5: Innovation & Ownership",
                    "evidence": [
                        {
                            "phrase": "Take full ownership of services end-to-end",
                            "justification": "Directly indicates taking responsibility and ownership of the services."
                        },
                        {
                            "phrase": "Combine innovation with reuse by abstracting ML/AI concepts from one application to a generalized framework",
                            "justification": "Encourages innovative thinking and building reusable components."
                        },
                        {
                            "phrase": "initial idea generation",
                            "justification": "Suggests a proactive and innovative approach to problem-solving."
                        }
                    ]
                }
            ]
        }
    }
}