{
    "job_id": 1233,
    "job_details": {
        "job_id": 1233,
        "Organisatienaam": "Refreshworks",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "AI Engineer (NL)",
        "Standplaats": "Den Haag",
        "Vacaturelink (origineel)": "collegerecruiter.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Engineer (overig) (m/v/x)",
        "Opleidingsniveau": "HBO/WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Bij Refreshworks, dé AI business transformation partner, werken we aan de toekomst. Onze missie is om werkend Nederland koploper te laten worden in de vierde industriële revolutie, met AI als drijvende kracht. We helpen bedrijven groeien én kosten besparen. Jouw rol Wat ga je doen? Als AI Engineer bij Refreshworks.ai speel je een cruciale rol in de ontwikkeling en implementatie van cutting-edge AI-oplossingen: Ontwikkeling van AI-modellen: ontwerp, ontwikkel, en implementeer geavanceerde voorspellende modellen en algoritmes. Je werkt aan diverse uitdagingen zoals computer vision, regressie- en classificatieproblemen, optimalisatie en natural language processing (NLP). Experimenten en Proof-of-Concepts: Ontwikkel experimenten om de technische haalbaarheid van verschillende modellen aan te tonen en om ze onderling te vergelijken. Cross-functionele samenwerking: werk samen met diverse afdelingen om AI-oplossingen naadloos te integreren binnen onze bedrijfsprocessen. Kennisdeling en presentatie: deel je bevindingen en aanbevelingen met zowel technische teams als niet-technische stakeholders. Blijf up-to-date met de laatste trends in data science en AI, en deel deze kennis binnen het bedrijf. Wie we zoeken Jouw profiel: We zijn op zoek naar iemand met een passie voor AI en een drive om te innoveren. Je achtergrond en vaardigheden omvatten: Opleiding: HBO- of WO-diploma in Data Science, informatica, Computer Science, Wiskunde of een gerelateerd veld. Ervaring: minimaal 2 jaar relevante werkervaring met aantoonbare expertise in AI of machine learning. Technische vaardigheden: uitstekende programmeerkennis in Python, ervaring met data-analyse tools/platformen, en bekendheid met machine learning frameworks. Specialisatie: ervaring met generatieve AI-modellen en tools, zoals OpenAI GPT4, en kennis van Microsoft Azure AI services of de Google Cloud AI oplossingen Communicatie: sterke communicatieve vaardigheden in zowel Nederlands als Engels. Persoonlijke eigenschappen: proactief, analytisch sterk, teamgericht, open voor nieuwe ideeën, en constant strevend naar verbetering. Wat we bieden Persoonlijke groei: Kennis is onze ware kracht. We leren door te doen, te experimenteren en door de beste te bestuderen. Refreshworks maakt van jou een voorloper. Inclusief: Wees jezelf en dan ben je goed genoeg. We zijn er trots op een bedrijf te zijn dat werkt met mensen van over de hele wereld. Ons team bestaat uit mensen uit veel verschillende landen en Engels is de voertaal op kantoor. Ohana: In de Hawaïaanse cultuur betekent Ohana familie. In een onderzoek uit 2021 onder onze teamleden was dit de 1 beschrijving van onze cultuur, dus het werd onze waarde. Sport: We houden van activiteiten ,je vindt ons op de padelbaan, golfbaan, boulderhal of verschillende bars. Een keer per maand doen we een leuke activiteit met het team. Trips: Elk jaar gaan we met het team op vakantie naar het buitenland. Lissabon, Parijs, Madrid We verwelkomen uw voorstellen om deze traditie levend te houden. Over Refreshworks Over Refreshworks Refreshworks is de plek waar digitale disciplines samenkomen. Al 12 jaar gebruiken we technologie om bedrijven te laten groeien, en nu met de opkomst van AI is onze impact groter dan ooit. Als AI Engineer werk je aan uiteenlopende projecten die echt business impact maken. Heb jij een passie voor AI en een drive om te innoveren? Wacht dan niet langer, sluit je aan bij ons team en help werkend Nederland koploper te worden in de AI-revolutie &Work helpt je verder Refreshworks werkt samen met &Work. &Work begrijpt dat het belangrijk is om te werken op een plek waar je gewaardeerd wordt, waar je je verder kunt ontwikkelen en waar je de ruimte krijgt om te groeien. Door via &Work te solliciteren, krijg je direct toegang tot hun brede netwerk van werkgevers. &Work kan je helpen bij de introductie bij Refreshworks, achtergrondinformatie verstrekken, je voorbereiden op gesprekken zodat je jezelf overtuigend kan presenteren en je bijstaan tijdens de onderhandelingen om je een mooie stap vooruit te laten zetten in je carrière.",
        "Datum gevonden": "2024-08-04",
        "Beroepsgroep": "Engineering (overig)",
        "Beroepsklasse": "Engineering",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Media / Communicatie",
        "Organisatiegrootte": "1-9",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 8,
        "full_text": "AI Engineer (NL)\n\nBij Refreshworks, dé AI business transformation partner, werken we aan de toekomst. Onze missie is om werkend Nederland koploper te laten worden in de vierde industriële revolutie, met AI als drijvende kracht. We helpen bedrijven groeien én kosten besparen. Jouw rol Wat ga je doen? Als AI Engineer bij Refreshworks.ai speel je een cruciale rol in de ontwikkeling en implementatie van cutting-edge AI-oplossingen: Ontwikkeling van AI-modellen: ontwerp, ontwikkel, en implementeer geavanceerde voorspellende modellen en algoritmes. Je werkt aan diverse uitdagingen zoals computer vision, regressie- en classificatieproblemen, optimalisatie en natural language processing (NLP). Experimenten en Proof-of-Concepts: Ontwikkel experimenten om de technische haalbaarheid van verschillende modellen aan te tonen en om ze onderling te vergelijken. Cross-functionele samenwerking: werk samen met diverse afdelingen om AI-oplossingen naadloos te integreren binnen onze bedrijfsprocessen. Kennisdeling en presentatie: deel je bevindingen en aanbevelingen met zowel technische teams als niet-technische stakeholders. Blijf up-to-date met de laatste trends in data science en AI, en deel deze kennis binnen het bedrijf. Wie we zoeken Jouw profiel: We zijn op zoek naar iemand met een passie voor AI en een drive om te innoveren. Je achtergrond en vaardigheden omvatten: Opleiding: HBO- of WO-diploma in Data Science, informatica, Computer Science, Wiskunde of een gerelateerd veld. Ervaring: minimaal 2 jaar relevante werkervaring met aantoonbare expertise in AI of machine learning. Technische vaardigheden: uitstekende programmeerkennis in Python, ervaring met data-analyse tools/platformen, en bekendheid met machine learning frameworks. Specialisatie: ervaring met generatieve AI-modellen en tools, zoals OpenAI GPT4, en kennis van Microsoft Azure AI services of de Google Cloud AI oplossingen Communicatie: sterke communicatieve vaardigheden in zowel Nederlands als Engels. Persoonlijke eigenschappen: proactief, analytisch sterk, teamgericht, open voor nieuwe ideeën, en constant strevend naar verbetering. Wat we bieden Persoonlijke groei: Kennis is onze ware kracht. We leren door te doen, te experimenteren en door de beste te bestuderen. Refreshworks maakt van jou een voorloper. Inclusief: Wees jezelf en dan ben je goed genoeg. We zijn er trots op een bedrijf te zijn dat werkt met mensen van over de hele wereld. Ons team bestaat uit mensen uit veel verschillende landen en Engels is de voertaal op kantoor. Ohana: In de Hawaïaanse cultuur betekent Ohana familie. In een onderzoek uit 2021 onder onze teamleden was dit de 1 beschrijving van onze cultuur, dus het werd onze waarde. Sport: We houden van activiteiten ,je vindt ons op de padelbaan, golfbaan, boulderhal of verschillende bars. Een keer per maand doen we een leuke activiteit met het team. Trips: Elk jaar gaan we met het team op vakantie naar het buitenland. Lissabon, Parijs, Madrid We verwelkomen uw voorstellen om deze traditie levend te houden. Over Refreshworks Over Refreshworks Refreshworks is de plek waar digitale disciplines samenkomen. Al 12 jaar gebruiken we technologie om bedrijven te laten groeien, en nu met de opkomst van AI is onze impact groter dan ooit. Als AI Engineer werk je aan uiteenlopende projecten die echt business impact maken. Heb jij een passie voor AI en een drive om te innoveren? Wacht dan niet langer, sluit je aan bij ons team en help werkend Nederland koploper te worden in de AI-revolutie &Work helpt je verder Refreshworks werkt samen met &Work. &Work begrijpt dat het belangrijk is om te werken op een plek waar je gewaardeerd wordt, waar je je verder kunt ontwikkelen en waar je de ruimte krijgt om te groeien. Door via &Work te solliciteren, krijg je direct toegang tot hun brede netwerk van werkgevers. &Work kan je helpen bij de introductie bij Refreshworks, achtergrondinformatie verstrekken, je voorbereiden op gesprekken zodat je jezelf overtuigend kan presenteren en je bijstaan tijdens de onderhandelingen om je een mooie stap vooruit te laten zetten in je carrière."
    },
    "analysis": {
        "profile_classification": {
            "profile": "GenAI Engineer",
            "confidence_score": 4,
            "rationale": "The job description emphasizes the development and implementation of cutting-edge AI solutions, specifically mentioning generative AI models like OpenAI GPT4, and the creation of predictive models for tasks like computer vision, regression, and NLP. The role involves building and integrating AI solutions, aligning with the core responsibilities of a GenAI Engineer."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "task": "Modeling",
                    "phrases": [
                        "Ontwikkeling van AI-modellen",
                        "ontwerp, ontwikkel, en implementeer geavanceerde voorspellende modellen en algoritmes",
                        "Je werkt aan diverse uitdagingen zoals computer vision, regressie- en classificatieproblemen, optimalisatie en natural language processing (NLP)",
                        "Experimenten en Proof-of-Concepts: Ontwikkel experimenten om de technische haalbaarheid van verschillende modellen aan te tonen en om ze onderling te vergelijken",
                        "ervaring met generatieve AI-modellen en tools, zoals OpenAI GPT4"
                    ],
                    "justification": "These phrases directly relate to the creation, development, and evaluation of AI models, including predictive and generative types, which is the core of the Modeling task."
                },
                {
                    "task": "Software Development",
                    "phrases": [
                        "implementatie van cutting-edge AI-oplossingen",
                        "Cross-functionele samenwerking: werk samen met diverse afdelingen om AI-oplossingen naadloos te integreren binnen onze bedrijfsprocessen."
                    ],
                    "justification": "This task involves integrating AI solutions into business processes and developing user-facing applications, as indicated by phrases about implementation and seamless integration."
                },
                {
                    "task": "Operations Engineering (MLOps)",
                    "phrases": [
                        "implementatie van cutting-edge AI-oplossingen",
                        "Microsoft Azure AI services of de Google Cloud AI oplossingen"
                    ],
                    "justification": "The mention of implementing AI solutions and specific cloud AI services suggests involvement in the deployment and operational aspects of AI models."
                },
                {
                    "task": "Business Understanding",
                    "phrases": [
                        "AI business transformation partner",
                        "missie is om werkend Nederland koploper te laten worden in de vierde industriële revolutie, met AI als drijvende kracht",
                        "helpen bedrijven groeien én kosten besparen",
                        "AI-oplossingen naadloos te integreren binnen onze bedrijfsprocessen",
                        "AI Engineer werk je aan uiteenlopende projecten die echt business impact maken"
                    ],
                    "justification": "These phrases highlight the role's connection to business goals, transformation, cost savings, and making a business impact, indicating a need for business understanding."
                },
                {
                    "task": "Data Engineering",
                    "phrases": [
                        "ervaring met data-analyse tools/platformen"
                    ],
                    "justification": "While not extensively detailed, the mention of data analysis tools/platforms implies some level of data handling and preparation, which is part of Data Engineering."
                }
            ],
            "technologies": [
                {
                    "technology": "Python",
                    "category": "TECH1: Programming Languages"
                },
                {
                    "technology": "OpenAI GPT4",
                    "category": "TECH3: LLM / Generative Models"
                },
                {
                    "technology": "Microsoft Azure AI services",
                    "category": "TECH2: Cloud Platforms & Services"
                },
                {
                    "technology": "Google Cloud AI oplossingen",
                    "category": "TECH2: Cloud Platforms & Services"
                }
            ],
            "soft_skills": [
                {
                    "skill": "Kennisdeling en presentatie: deel je bevindingen en aanbevelingen met zowel technische teams als niet-technische stakeholders.",
                    "category": "SKILL1: Communication & Collaboration"
                },
                {
                    "skill": "Blijf up-to-date met de laatste trends in data science en AI, en deel deze kennis binnen het bedrijf.",
                    "category": "SKILL2: Learning & Adaptability"
                },
                {
                    "skill": "proactief, analytisch sterk, teamgericht, open voor nieuwe ideeën, en constant strevend naar verbetering.",
                    "category": "SKILL3: Problem Solving & Pragmatism"
                },
                {
                    "skill": "passie voor AI en een drive om te innoveren.",
                    "category": "SKILL5: Innovation & Ownership"
                },
                {
                    "skill": "Communicatie: sterke communicatieve vaardigheden in zowel Nederlands als Engels.",
                    "category": "SKILL1: Communication & Collaboration"
                }
            ]
        }
    }
}