{
    "job_id": 444,
    "job_details": {
        "job_id": 444,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Senior Mobile Engineer, gt.school (Remote) - $100,000/year USD",
        "Standplaats": null,
        "Vacaturelink (origineel)": "glassdoor.nl",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Helpdeskmedewerker informatietechnologie (m/v/x)",
        "Opleidingsniveau": "Onbekend",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "Are you a mobile engineer who thrives on complex challenges and is eager to make a real impact? Join our team to contribute to innovative products that deeply leverage AI and that are reshaping industries and changing the way we work and learn.\n\n   At gt. school, our focus isn't just on creating another app; we're pioneering an innovative approach to learning by integrating modern techniques like advanced AI, adaptive computer-based training, gamification, and continuous feedback. At the heart of it all lies TeachTap, an ambitious app that is bringing historical figures to life using AI, offering an engaging, TikTok-like learning experience to make learning more relevant and fun.\n\n   Your responsibilities will involve turning UI designs into working app features, fixing bugs, and collaborating with our product and backend teams to maintain smooth functionality. You'll be joining our small, tight-knit development team, contributing to innovation and improving our app's user experience. The pace is fast, but the rewards both personal growth and the tangible impact on students are substantial. In this position, you will have a high degree of ownership and the ability to significantly shape the product to ensure a seamless and intuitive experience for our users.\n\n   We're not just using AI as a buzzword. We're at the start of a thrilling journey with generative AI, experimenting and learning to fully leverage its potential and free our engineers from mundane tasks, allowing them to focus on what truly matters: design, decision-making, and understanding the far-reaching implications of different implementation strategies.\n\n   Showcase your skills, not just your resume. Take on our challenges: 15-min Cognitive, 90-min Coding, 180-min App-Building. Excel and you'll face a decisive interview with our Hiring Manager. More than half walk away with an offer. Ready to unleash your potential? Apply today!\n\n   What you will be doing\n\n     * Taking high-fidelity UI designs and transforming them into interactive and efficient mobile app features,\n     * Integrating screens with our modern APIs, ensuring data consistency and responsiveness,\n     * Collaborating with product managers and designers to ensure the functionality, reliability, and user-friendliness of the app.\n\n   What you will NOT be doing\n\n     * Getting stuck in endless approval loops - we value swift decision-making and autonomy.\n     * Isolated tasks - you will collaborate closely with a supportive product and backend team., * Delivering a high-quality application that serves as the primary interface for students in our cutting-edge computer-based learning environment.",
        "Datum gevonden": "2024-05-09",
        "Beroepsgroep": "Supportmedewerkers",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2024,
        "Maand (van datum gevonden)": 5,
        "full_text": "Senior Mobile Engineer, gt.school (Remote) - $100,000/year USD\n\nAre you a mobile engineer who thrives on complex challenges and is eager to make a real impact? Join our team to contribute to innovative products that deeply leverage AI and that are reshaping industries and changing the way we work and learn.\n\n   At gt. school, our focus isn't just on creating another app; we're pioneering an innovative approach to learning by integrating modern techniques like advanced AI, adaptive computer-based training, gamification, and continuous feedback. At the heart of it all lies TeachTap, an ambitious app that is bringing historical figures to life using AI, offering an engaging, TikTok-like learning experience to make learning more relevant and fun.\n\n   Your responsibilities will involve turning UI designs into working app features, fixing bugs, and collaborating with our product and backend teams to maintain smooth functionality. You'll be joining our small, tight-knit development team, contributing to innovation and improving our app's user experience. The pace is fast, but the rewards both personal growth and the tangible impact on students are substantial. In this position, you will have a high degree of ownership and the ability to significantly shape the product to ensure a seamless and intuitive experience for our users.\n\n   We're not just using AI as a buzzword. We're at the start of a thrilling journey with generative AI, experimenting and learning to fully leverage its potential and free our engineers from mundane tasks, allowing them to focus on what truly matters: design, decision-making, and understanding the far-reaching implications of different implementation strategies.\n\n   Showcase your skills, not just your resume. Take on our challenges: 15-min Cognitive, 90-min Coding, 180-min App-Building. Excel and you'll face a decisive interview with our Hiring Manager. More than half walk away with an offer. Ready to unleash your potential? Apply today!\n\n   What you will be doing\n\n     * Taking high-fidelity UI designs and transforming them into interactive and efficient mobile app features,\n     * Integrating screens with our modern APIs, ensuring data consistency and responsiveness,\n     * Collaborating with product managers and designers to ensure the functionality, reliability, and user-friendliness of the app.\n\n   What you will NOT be doing\n\n     * Getting stuck in endless approval loops - we value swift decision-making and autonomy.\n     * Isolated tasks - you will collaborate closely with a supportive product and backend team., * Delivering a high-quality application that serves as the primary interface for students in our cutting-edge computer-based learning environment."
    },
    "analysis": {
        "profile_classification": {
            "profile": "Ambiguous",
            "rationale": "The job description focuses heavily on mobile application development, UI/UX implementation, and API integration. While it mentions the use of AI and generative AI as a core part of the product's innovation (e.g., bringing historical figures to life, adaptive learning), the primary responsibilities and required skills are centered around traditional mobile engineering rather than the development, fine-tuning, or deployment of AI models themselves. The role is about *using* AI-powered features within an app, not building the AI models or the core AI infrastructure. Therefore, it does not fit the 'ML Engineer' or 'GenAI Engineer' profiles, which require deep expertise in model development and MLOps. It falls under 'Ambiguous' as it's a technical role but not directly focused on AI engineering as defined in the Coding Book."
        },
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description explicitly states 'turning UI designs into working app features', 'fixing bugs', 'collaborating with our product and backend teams to maintain smooth functionality', 'Taking high-fidelity UI designs and transforming them into interactive and efficient mobile app features', and 'Integrating screens with our modern APIs'. These are core software development activities for a mobile engineer.",
                    "phrase": "turning UI designs into working app features"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The description mentions 'fixing bugs', which is a fundamental part of software development to ensure application stability and quality.",
                    "phrase": "fixing bugs"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The role involves 'collaborating with our product and backend teams to maintain smooth functionality', which is a common aspect of software development teams working on integrated systems.",
                    "phrase": "collaborating with our product and backend teams to maintain smooth functionality"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The phrase 'Integrating screens with our modern APIs, ensuring data consistency and responsiveness' directly relates to building the connective tissue of an application, a key software development task.",
                    "phrase": "Integrating screens with our modern APIs, ensuring data consistency and responsiveness"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The responsibility to 'collaborate with product managers and designers to ensure the functionality, reliability, and user-friendliness of the app' is a standard software development practice focused on delivering a quality product.",
                    "phrase": "Collaborating with product managers and designers to ensure the functionality, reliability, and user-friendliness of the app"
                },
                {
                    "category": "TASK4: Software Development",
                    "justification": "The statement 'Delivering a high-quality application that serves as the primary interface for students in our cutting-edge computer-based learning environment' describes the end goal of software development for this role.",
                    "phrase": "Delivering a high-quality application that serves as the primary interface for students in our cutting-edge computer-based learning environment"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The description highlights the company's focus on 'reshaping industries and changing the way we work and learn' and 'pioneering an innovative approach to learning by integrating modern techniques like advanced AI, adaptive computer-based training, gamification, and continuous feedback'. This shows an understanding of the business domain and strategic goals.",
                    "phrase": "reshaping industries and changing the way we work and learn"
                },
                {
                    "category": "TASK1: Business Understanding",
                    "justification": "The mention of 'TeachTap, an ambitious app that is bringing historical figures to life using AI, offering an engaging, TikTok-like learning experience to make learning more relevant and fun' demonstrates an understanding of the product's business value and target audience.",
                    "phrase": "TeachTap, an ambitious app that is bringing historical figures to life using AI, offering an engaging, TikTok-like learning experience to make learning more relevant and fun"
                },
                {
                    "category": "TASK5: Operations Engineering (MLOps)",
                    "justification": "While not a primary focus, the phrase 'experimenting and learning to fully leverage its potential and free our engineers from mundane tasks, allowing them to focus on what truly matters: design, decision-making, and understanding the far-reaching implications of different implementation strategies' hints at an operational aspect of integrating AI, though it's more about the *outcome* of AI use than MLOps itself.",
                    "phrase": "experimenting and learning to fully leverage its potential and free our engineers from mundane tasks"
                },
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "justification": "The description states 'you will have a high degree of ownership and the ability to significantly shape the product', which directly maps to the 'Ownership' aspect of this soft skill.",
                    "phrase": "high degree of ownership and the ability to significantly shape the product"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "justification": "The job requires 'collaborating with our product and backend teams' and 'collaborating with product managers and designers', indicating a need for teamwork and communication.",
                    "phrase": "collaborating with our product and backend teams"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "justification": "The phrase 'experimenting and learning to fully leverage its potential' suggests a need for continuous learning and adaptation, especially in the context of generative AI.",
                    "phrase": "experimenting and learning to fully leverage its potential"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL5: Innovation & Ownership",
                    "phrase": "high degree of ownership and the ability to significantly shape the product"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborating with our product and backend teams"
                },
                {
                    "category": "SKILL1: Communication & Collaboration",
                    "phrase": "collaborating with product managers and designers"
                },
                {
                    "category": "SKILL2: Learning & Adaptability",
                    "phrase": "experimenting and learning to fully leverage its potential"
                }
            ],
            "technologies": [
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "advanced AI"
                },
                {
                    "category": "TECH3: LLM / Generative Models",
                    "phrase": "generative AI"
                }
            ]
        }
    }
}