{
    "job_id": 224,
    "job_details": {
        "job_id": 224,
        "Organisatienaam": "Crossover",
        "Type adverteerder": "Directe werkgever",
        "Vacaturetitel": "Software Engineer, Trilogy (Remote) - $100,000/year USD",
        "Standplaats": null,
        "Vacaturelink (origineel)": "indeed.com",
        "Contactpersoon": null,
        "Telefoonnummer": null,
        "E-mail": null,
        "Beroep": "Helpdeskmedewerker informatietechnologie (m/v/x)",
        "Opleidingsniveau": "WO",
        "Jobfeed feedbacklink": "Meld fout",
        "Functieomschrijving": "* Crafting AI-powered automations that don't just streamline processes-they reinvent them. Your creations will be the Swiss Army knives of productivity, adaptable and indispensable across a spectrum of applications.\n     * Playing in the AI sandbox with cutting-edge tools like GPT-4 Vision and Amazon CodeWhisperer. You'll be the kid in the candy store, but instead of sugar rushes, you'll be delivering game-changing innovations.\n     * Donning your optimization hat to ensure our AI solutions run like well-oiled machines across various infrastructures, including AWS. You'll be the performance tuner, making sure our digital engines purr with efficiency.\n\n   What you will NOT be doing\n\n     * Slaving over traditional coding-our AI is your trusty sidekick, handling the grunt work while you focus on the big picture and groundbreaking ideas.\n     * Falling into a monotonous routine-each day brings a new puzzle to solve, a fresh challenge to tackle. Boredom is not in our vocabulary., Your primary mission: to breathe life into fully-automated AI systems that operate with the precision of a Swiss watch and the independence of a wild mustang. These aren't your run-of-the-mill automations-we're talking about AI powerhouses that can run circles around tasks without breaking a sweat or needing a human nudge.",
        "Datum gevonden": "2025-02-13",
        "Beroepsgroep": "Supportmedewerkers",
        "Beroepsklasse": "Informatie- en communicatietechnologie",
        "Contracttype": "Vast contract",
        "Parttime / fulltime": "Fulltime (> 32 uur)",
        "Branche": "Overig / Onbekend",
        "Organisatiegrootte": "Onbekend",
        "Jaar (van datum gevonden)": 2025,
        "Maand (van datum gevonden)": 2,
        "full_text": "Software Engineer, Trilogy (Remote) - $100,000/year USD\n\n* Crafting AI-powered automations that don't just streamline processes-they reinvent them. Your creations will be the Swiss Army knives of productivity, adaptable and indispensable across a spectrum of applications.\n     * Playing in the AI sandbox with cutting-edge tools like GPT-4 Vision and Amazon CodeWhisperer. You'll be the kid in the candy store, but instead of sugar rushes, you'll be delivering game-changing innovations.\n     * Donning your optimization hat to ensure our AI solutions run like well-oiled machines across various infrastructures, including AWS. You'll be the performance tuner, making sure our digital engines purr with efficiency.\n\n   What you will NOT be doing\n\n     * Slaving over traditional coding-our AI is your trusty sidekick, handling the grunt work while you focus on the big picture and groundbreaking ideas.\n     * Falling into a monotonous routine-each day brings a new puzzle to solve, a fresh challenge to tackle. Boredom is not in our vocabulary., Your primary mission: to breathe life into fully-automated AI systems that operate with the precision of a Swiss watch and the independence of a wild mustang. These aren't your run-of-the-mill automations-we're talking about AI powerhouses that can run circles around tasks without breaking a sweat or needing a human nudge."
    },
    "analysis": {
        "profile_classification": "GenAI Engineer",
        "confidence_score": 4,
        "rationale": "The job description heavily emphasizes crafting AI-powered automations and reinventing processes using cutting-edge AI tools like GPT-4 Vision. The focus on building \"fully-automated AI systems\" and \"AI powerhouses\" aligns with the core responsibilities of a GenAI Engineer, particularly in developing and deploying generative AI solutions.",
        "thematic_analysis": {
            "job_tasks": [
                {
                    "category": "TASK3",
                    "phrase": "Crafting AI-powered automations that don't just streamline processes-they reinvent them.",
                    "justification": "This phrase directly relates to building and developing AI models or systems that perform automated tasks, which falls under the 'Modeling' category."
                },
                {
                    "category": "TASK3",
                    "phrase": "Playing in the AI sandbox with cutting-edge tools like GPT-4 Vision and Amazon CodeWhisperer.",
                    "justification": "Mentioning specific generative AI models like GPT-4 Vision and tools like CodeWhisperer indicates direct work with and adaptation of these models, fitting the 'Modeling' task."
                },
                {
                    "category": "TASK5",
                    "phrase": "Donning your optimization hat to ensure our AI solutions run like well-oiled machines across various infrastructures, including AWS.",
                    "justification": "Ensuring AI solutions run efficiently across infrastructures like AWS points to the operational aspects of deploying and maintaining AI systems, aligning with 'Operations Engineering (MLOps)'."
                },
                {
                    "category": "TASK4",
                    "phrase": "Your creations will be the Swiss Army knives of productivity, adaptable and indispensable across a spectrum of applications.",
                    "justification": "Describing creations as 'Swiss Army knives of productivity' and 'adaptable across a spectrum of applications' implies building software components or applications that integrate AI functionalities."
                },
                {
                    "category": "TASK4",
                    "phrase": "Your primary mission: to breathe life into fully-automated AI systems that operate with the precision of a Swiss watch and the independence of a wild mustang.",
                    "justification": "This describes the development and deployment of functional AI systems, which involves software engineering to make them operational and user-facing."
                },
                {
                    "category": "TASK4",
                    "phrase": "These aren't your run-of-the-mill automations-we're talking about AI powerhouses that can run circles around tasks without breaking a sweat or needing a human nudge.",
                    "justification": "This emphasizes building robust, independent AI systems, which requires significant software development to ensure their functionality and autonomy."
                },
                {
                    "category": "TASK1",
                    "phrase": "focus on the big picture and groundbreaking ideas.",
                    "justification": "This indicates a need to understand how AI solutions contribute to broader goals and to conceptualize innovative applications."
                }
            ],
            "technologies": [
                {
                    "category": "TECH3",
                    "name": "GPT-4 Vision"
                },
                {
                    "category": "TECH2",
                    "name": "Amazon CodeWhisperer"
                },
                {
                    "category": "TECH2",
                    "name": "AWS"
                }
            ],
            "soft_skills": [
                {
                    "category": "SKILL5",
                    "phrase": "focus on the big picture and groundbreaking ideas."
                },
                {
                    "category": "SKILL3",
                    "phrase": "each day brings a new puzzle to solve, a fresh challenge to tackle."
                },
                {
                    "category": "SKILL5",
                    "phrase": "Your primary mission: to breathe life into fully-automated AI systems"
                }
            ]
        }
    }
}